{
  "ai_data_engineering": [
    {
      "url": "http://www.dataiku.com/stories/blog/the-modern-analysts-path-from-question-to-insight",
      "title": "The Modern Analyst’s Simplified Path From Question to Insight",
      "summary": "It’s Monday morning, marketing just asked a seemingly simple question: “Which suppliers are driving the most customer complaints, and are there any patterns?”",
      "published_ts": 1762437600,
      "source_name": "Dataiku Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/enhanced-search-with-match-highlights-and-explanations-in-amazon-sagemaker/",
      "title": "Enhanced search with match highlights and explanations in Amazon SageMaker",
      "summary": "Amazon SageMaker now enhances search results in Amazon SageMaker Unified Studio with additional context that improves transparency and interpretability. The capability introduces inline highlighting for matched terms and an explanation panel that details where and how each match occurred across metadata fields such as name, description, glossary, and schema. In this post, we demonstrate how to use enhanced search in Amazon SageMaker.",
      "published_ts": 1762297049,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "http://www.dataiku.com/stories/blog/building-agents-with-snowflake-cortex-ai",
      "title": "Building Agents With Snowflake Cortex AI at Every Level",
      "summary": "Organizations care about tech optionality — not just to avoid vendor lock-in, but also to make sure they’re using the best tool for the job. This particularly applies to AI agents. The more tools and systems at an agent’s disposal, the better the agent. Dataiku has always aimed to put these tools in the hands of a diverse range of users, which is why we’re excited to provide no-code UIs to build AI agents leveraging the entire Snowflake Cortex AI stack in conjunction with the release of Snowflake Intelligence.",
      "published_ts": 1762268474,
      "source_name": "Dataiku Blog"
    }
  ],
  "cloud": [],
  "cloud_infra_observability": [
    {
      "url": "https://aws.amazon.com/blogs/big-data/amazon-kinesis-data-streams-launches-on-demand-advantage-for-instant-throughput-increases-and-streaming-at-scale/",
      "title": "Amazon Kinesis Data Streams launches On-demand Advantage for instant throughput increases and streaming at scale",
      "summary": "Today, AWS announced the new Amazon Kinesis Data Streams On-demand Advantage mode, which includes warm throughput capability and an updated pricing structure. With this feature you can enable instant scaling for traffic surges while optimizing costs for consistent streaming workloads. In this post, we explore this new feature, including key use cases, configuration options, pricing considerations, and best practices for optimal performance.",
      "published_ts": 1762207231,
      "source_name": "Redshift / AWS Big Data"
    }
  ],
  "data_modeling_governance": [
    {
      "url": "https://aws.amazon.com/blogs/big-data/scaling-data-governance-with-amazon-datazone-covestro-success-story/",
      "title": "Scaling data governance with Amazon DataZone: Covestro success story",
      "summary": "In this post, we show you how Covestro transformed its data architecture by implementing Amazon DataZone and AWS Serverless Data Lake Framework, transitioning from a centralized data lake to a data mesh architecture. The implementation enabled streamlined data access, better data quality, and stronger governance at scale, achieving a 70% reduction in time-to-market for over 1,000 data pipelines.",
      "published_ts": 1762203726,
      "source_name": "Redshift / AWS Big Data"
    }
  ],
  "dataprep_orchestration_etl": [
    {
      "url": "https://www.zdnet.fr/actualites/les-suppressions-demplois-liees-a-lia-vous-inquietent-comment-les-cols-blancs-peuvent-se-proteger-des-maintenant-484574.htm#xtor=RSS-1",
      "title": "Les suppressions d'emplois liées à l'IA vous inquiètent ? Comment les cols blancs peuvent se protéger - dès maintenant",
      "summary": "Vous voulez éviter d'être victime de la grande transformation de l'emploi à cause de l'IA ? Voici comment procéder.",
      "published_ts": 1762391491,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://dagster.io/blog/introducing-our-new-ebook-scaling-data-teams",
      "title": "A Practical Guide to Building Data Platforms That Grow with You",
      "summary": "Discover how to design and scale data platforms with clarity and confidence. Learn from real Dagster users and practical examples in our free eBook, Scaling Data Teams.",
      "published_ts": 1762358935,
      "source_name": "Dagster Blog"
    }
  ],
  "db_sql_olap": [
    {
      "url": "https://powerbi.microsoft.com/en-us/blog/advance-your-career-in-data-ai-with-microsoft-fabric-data-days/",
      "title": "Advance your career in Data &amp; AI with Microsoft Fabric Data Days",
      "summary": "There’s no AI without data. Are you ready to invest in your future? Fabric Data Days starts on November 4th! We’re offering 50+ days of immersive learning designed for data professionals at every level and students alike. Don’t miss your chance to gain practical experience from experts and connect with a global community of experts. … Continue reading “Advance your career in Data & AI with Microsoft Fabric Data Days”",
      "published_ts": 1762164000,
      "source_name": "Power BI Blog"
    }
  ],
  "lake_storage_formats": [
    {
      "url": "https://vutr.substack.com/p/i-spent-8-understanding-how-parquet",
      "title": "I spent 8 hours understanding how Parquet actually stores the data.",
      "summary": "From logical data representation to data encoding and compression.",
      "published_ts": 1762226155,
      "source_name": "VuTrinh · Data Engineering"
    }
  ],
  "ml_ai": [
    {
      "url": "https://www.lemagit.fr/actualites/366634244/Stockage-pour-lIA-Huawei-devoile-sa-strategie-a-Madrid",
      "title": "Stockage pour l’IA : Huawei dévoile sa stratégie à Madrid",
      "summary": "<p>En matière de stockage de données pour l’IA, Huawei a une stratégie en deux temps&nbsp;: fournir dès maintenant des baies de SSD accélérées et, d’ici à la fin de l’année, tout un ensemble de logiciels pour préparer ces données à l’IA. Un planning que le constructeur chinois a détaillé lors de l’événement <a href=\"https://www.lemagit.fr/actualites/366633919/Huawei-sefforce-de-maintenir-une-longueur-davance-dans-tous-les-reseaux\">Huawei Connect 2025</a> qu’il vient d’organiser à Madrid.</p> \n<p>«&nbsp;Nos dernières baies de stockage OceanStor offrent des débits de 500 Go/s et des dizaines de millions d’IOPS. Nous sommes tellement en avance sur la concurrence que nous n’aurons plus besoin de lancer de nouveaux modèles avant deux ans&nbsp;», lance Yuan Yuan, le patron des baies de disque élastiques (en photo en haut de cet article), lors d’un entretien avec LeMagIT.</p> \n<p>«&nbsp;Mais la vitesse ne suffit pas. Il s’agit d’aider les entreprises à valoriser leurs données dans les IA. Pour ce faire, nous avons conçu une pile complète que nous appelons l’<a href=\"https://e.huawei.com/sg/solutions/storage/scale-out-storage/ai-data-lake\">AI Data Lake</a>. Outre les baies de stockage, elle comprend toute une pile de logiciels qui permettent, d’une part, de contrôler les données (regroupement, indexation, gestion des versions et des accès)&nbsp;; c’est la partie Omni-Dataverse qui sera bientôt complétée par eDataInsight. Et, d’autre part, de brancher ces données à l’IA&nbsp;; c’est la partie iData + ModelEngine&nbsp;», précise-t-il.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Quatre baies de stockage pour l’IA\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Quatre baies de stockage pour l’IA</h2>\n <p>Huawei avait historiquement deux familles de baies de stockage de production&nbsp;: les <a href=\"https://www.lemagit.fr/actualites/366623534/Stockage-Huawei-presente-la-v7-de-ses-baies-OceanStor-Dorado\">OceanStor Dorado </a>comme stockage bloc pour les serveurs applicatifs (images de machines virtuelles et de containers, bases de données), ainsi que les <a href=\"https://www.lemagit.fr/actualites/366551283/Stockage-Huawei-lance-la-baie-OceanStor-Pacific-9920-en-Europe\">OceanStor Pacific</a>, des NAS pour partager les données de travail au format fichier ou objet. Les OceanStor Pacific se déclinent aujourd’hui en deux versions accélérées, avec deux nouveaux modèles 9926 et 9928 pensés pour les travaux d’inférence. Et il existe désormais une troisième famille, les baies de SSD OceanStor A-Series, spécifiquement conçues pour épauler l’entraînement des intelligences artificielles. &nbsp;&nbsp;&nbsp;</p>\n <p>Les OceanStor Pacific 9926 et 9928 sont physiquement identiques. Ils se composent d’un boîtier 2U pouvant contenir 36 SSD QLC extra-plats, mais allongés, un format propriétaire «&nbsp;Palm-Sized&nbsp;» de Huawei. Lors de sa conférence à Madrid, ces SSD avaient une capacité de 61 To, mais le constructeur promet que les modèles <a href=\"https://www.lemagit.fr/actualites/366616027/Les-premiers-SSD-122-To-se-montrent\">en 122 To</a> seront disponibles d’ici à la fin de l’année.</p>\n <p>«&nbsp;Ces machines pèsent seulement 45 kg pour une capacité de stockage brute de 2 Po&nbsp;! Personne d’autre n’atteint une telle densité&nbsp;», se félicite Yuan Yuan, qui précise que la capacité est huit fois plus importante qu’avec une baie 2U composée de disques durs mécaniques et qui pèse deux fois plus lourd.</p>\n <p>En termes de puissance, les OceanStor Pacific 9926 et 9928 sont équipées de deux processeurs <a href=\"https://www.lemagit.fr/actualites/252526515/Huawei-en-campagne-pour-devenir-un-grand-acteur-du-stockage\">ARM Kunpeng 920</a>, conçus par Huawei, de 1 To de RAM et de connecteurs Ethernet RoCE en 200 Gbit/s ou Infiniband en 400 Gbit/s. Leur débit est de 90 Go/s et leur vitesse d’accès est de 2,4 millions d’IOPS. Enfin, 256 baies peuvent être déployées en cluster pour augmenter d’autant la capacité et la bande passante.</p>\n <p>La différence entre les modèles 9926 et 9928 est que le second supporte plus de protocoles d’accès, notamment <a href=\"https://www.lemagit.fr/conseil/S3-contre-HDFS-que-choisir-pour-son-data-lake\">l’API HDFS</a> typique des lacs de données, alors que le 9926 se limite aux accès fichier, en NFS, et objet, en S3.</p>\n <p>La famille A-Series se distingue principalement des Pacific par l’utilisation de SSD MLC plus rapides. Dans un boîtier 8U contenant 64 SSD, l’OceanStor A800 atteint ainsi un débit de 500 Go/s et une vitesse d’accès de 10 millions d’IOPS. En l’occurrence, la machine contient deux contrôleurs qui disposent chacun de quatre processeurs ARM Kunpeng 920 et de 1 To de RAM (soit huit processeurs et 2 To de RAM par machine).</p>\n <p>Surtout, l’OceanStor A800 est équipé de puces accélératrices NPU derrière ses cartes réseau pour lire et écrire les données directement sur les SSD, sans passer par un décodage au niveau des processeurs. Ce dispositif permettrait d’accélérer les accès de 40%. Huawei parle d’une technologie NPUDirect Storage (NDS), qui n’est pas sans rappeler le <a href=\"https://www.lemagit.fr/actualites/366618802/Infrastructure-IA-Nvidia-adapte-son-reseau-rapide-Spectrum-X-au-stockage\">GPUDirect Storage</a> de Nvidia du côté des serveurs de calcul. Les cartes réseau proposent des ports 200 Gbit/s, en Ethernet RoCE comme en Infiniband.</p>\n <p>Il existe aussi une petite baie OceanStor A600 qui reprend les caractéristiques physiques des nouvelles OceanStor Pacific 9926 et 9928&nbsp;: 2U, 36 SSD. Comme l’A800, elle dispose de deux contrôleurs. Ici, chacun contient deux ARM Kunpeng 920, 512 Go de RAM et des NPU qui accélèrent les accès de 30%. Le débit de l’OceanStor A600 est de 160 Go/s et, ce, alors que ses cartes réseau sont limitées du 100 Gbit/s.</p>\n</section>         \n<section class=\"section main-article-chapter\" data-menu-title=\"Des accélérations logicielles\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des accélérations logicielles</h2>\n <p>En outre, toutes ces nouvelles baies de stockage pour l’IA s’accompagnent d’une couche logicielle appelée <a href=\"https://www.huaweicentral.com/huawei-launches-ucm-algorithm-as-reliable-alternative-to-hbm-chips/#google_vignette\">UCM</a> (Unified Cache Manager). Elle permet aux serveurs de calcul d’accéder aux baies de stockage via un protocole clé-valeur (KV), soit une sorte d’accès en mode bloc, mais avec des blocs de taille variable.</p>\n <p>«&nbsp;UCM, qui nécessite l’installation d’un pilote côté serveurs, va faire un fort usage de la RAM embarquée dans les baies de stockage pour y maintenir un cache. Ce cache fonctionne aussi bien pour le RAG (inférence sur un LLM préentraîné) que pour l’entraînement d’une IA&nbsp;», explique un porte-parole de Huawei devant le stand des OceanStor A-Series.</p>\n <p>Selon Yuan Yuan, UCM, de par son fonctionnement, permet d’utiliser des serveurs de calcul dont les GPU sont dépourvus de mémoire HBM, qui leur sert habituellement de cache ultra rapide. Huawei aurait développé cette technologie suite à l’embargo américain concernant <a href=\"https://www.lemagit.fr/actualites/366630089/Une-nouvelle-interdiction-americaine-menace-la-production-de-memoires\">l’export de mémoires HBM vers la Chine</a>.</p>\n <p>UCM fera partie à terme d’un ensemble de logiciels Open source baptisé CANN (Compute Architecture for Neural Networks) que Huawei compte partager d’ici à la fin de l’année et qu’il relie à sa plateforme logicielle Ai Data Lake. À ce stade, on ignore si CANN comprendra un outil pour convertir les données de l’entreprise cliente au format vectoriel, nécessaire au traitement par une IA, et si cet outil fonctionnerait directement sur les baies OceanStor, à la manière de la baie de stockage intelligente AFX présentée récemment par NetApp.</p>\n</section>",
      "published_ts": 1762726500,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/dessin/Cybersecurite-du-Musee-du-Louvre-un-debat-tronque",
      "title": "Cybersécurité du Musée du Louvre : un débat tronqué",
      "summary": "<p>Depuis le cambriolage du 19&nbsp;octobre, la sécurité du Louvre fait l’objet de toutes les attentions. Ce qui vaut aussi pour sa cybersécurité. Mais pas nécessairement en posant les bonnes questions.</p> \n<p>&gt; Lire <a href=\"Depuis%20le cambriolage du 19&nbsp;octobre, la sécurité du Louvre fait l’objet de toutes les attentions. Ce qui vaut aussi pour sa cybersécurité. Mais pas nécessairement en posant les bonnes questions.  > Lire l’article de Valéry Rieß-Marchive https://www.lemagit.fr/actualites/366634294/Cybersecurite-du-musee-du-Louvre-un-debat-tronque\">l’article de Valéry Rieß-Marchive</a><br><br></p>",
      "published_ts": 1762709580,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1545841-rv1-pire-tshirt-noir/",
      "title": "Ce t-shirt d'une célèbre enseigne est à fuir : il est à jeter après quelques lavages",
      "summary": "UFC Que – Choisir a comparé 22 marques de t-shirts noirs en coton avec une dizaine de critères comme la résistance, l'aspect ou encore les résidus chimiques. Cette marque est la grande perdante.",
      "published_ts": 1762667103,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/pratique/les-airpods-beneficient-dun-outil-de-gestion-de-lalimentation-tres-pratique-avec-ios-26-voici-comment-lactiver-484676.htm#xtor=RSS-1",
      "title": "Les AirPods bénéficient d'un outil de gestion de l'alimentation très pratique avec iOS 26 : voici comment l'activer",
      "summary": "Fini le temps où l'on s'endormait et où l'on se réveillait avec une saison entière de sa série préférée déjà manquée.",
      "published_ts": 1762654281,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/pratique/protegez-votre-vie-privee-comment-debusquer-et-desactiver-un-logiciel-espion-sur-android-et-iphone-484656.htm#xtor=RSS-1",
      "title": "Protégez votre vie privée : Comment débusquer et désactiver un logiciel espion sur Android et iPhone",
      "summary": "Votre smartphone contient toutes vos données personnelles, ce qui en fait une cible de choix pour les pirates et les espions. Voici comment le protéger.",
      "published_ts": 1762596681,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/economie/immobilier/1545863-cd1-80-000-euros-4m2/",
      "title": "80 000 euros pour 4 m² : dans ce studio à vendre, il faut mettre le lit sur l'évier pour dormir",
      "summary": "C'est une chambre \"unique qui est une parfaite illustration de la vie parisienne\", selon l'agence immobilière.",
      "published_ts": 1762581002,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1545833-cd1-inondation-ville/",
      "title": "L'inondation du siècle va forcément frapper cette grande ville française et ce ne sera que le début",
      "summary": "Climatologues et météorologues s'intéressent à cet événement qui pourrait prendre de l'ampleur avec le réchauffement climatique.",
      "published_ts": 1762580703,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/pratique/montre-samsung-activez-ces-8-parametres-meconnus-pour-une-utilisation-quotidienne-optimisee-484661.htm#xtor=RSS-1",
      "title": "Montre Samsung : activez ces 8 paramètres méconnus pour une utilisation quotidienne optimisée",
      "summary": "La gamme Galaxy Watch de Samsung intègre la dernière version d'Android, offrant ainsi des fonctionnalités clés dont vous devriez profiter.",
      "published_ts": 1762567913,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545919-j-ai-teste-pour-vous-comet-le-navigateur-booste-a-l-ia-de-perplexity/",
      "title": "J'ai testé pour vous COMET, le navigateur boosté à l'IA de Perplexity",
      "summary": "Test sur plusieurs semaines du navigateur COMET et partage de résultats.",
      "published_ts": 1762527530,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545913-face-a-la-copiabilite-generalisee-comment-rester-irremplacable/",
      "title": "Face à la copiabilité généralisée, comment rester irremplaçable ?",
      "summary": "À l'ère de l'IA, un produit, un service ou une idée peuvent être copiés vite et à bas coût. Aujourd'hui, la vraie valeur d'une entreprise réside dans l'expérience, le récit et l'écosystème.",
      "published_ts": 1762527461,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545911-l-observabilite-intelligente-l-outil-critique-pour-assurer-la-gestion-des-environnements-informatiques-hybrides/",
      "title": "L'observabilité intelligente : l'outil critique pour assurer la gestion des environnements informatiques hybrides",
      "summary": "La donnée qui prolifère rend inefficaces les outils de visibilité IT classiques, incapables de distinguer les informations habituelles de celles qui pourraient constituer une menace. Comment faire ?",
      "published_ts": 1762527443,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545865-piloter-la-performance-dans-l-ecosysteme-de-l-ia-vers-la-mesure-et-l-optimisation/",
      "title": "Piloter la performance dans l'écosystème de l'IA : vers la mesure et l'optimisation",
      "summary": "Après avoir repensé sa stratégie de contenu, la question de l'évaluation de l'efficacité des efforts se pose. Dans l'univers de la AI Engine Optimization (AEO) ou recherche par l'IA, les métriques traditionnelles ne suffisent plus. Il est pourtant essentiel de mesurer, analyser et optimiser la performance dans ce nouvel écosystème.",
      "published_ts": 1762527341,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545823-ai-factories-en-afrique-transformer-l-essai-par-l-energie-les-talents-et-la-donnee/",
      "title": "AI factories en Afrique : transformer l'essai par l'énergie, les talents et la donnée",
      "summary": "AI factories en Afrique : la puissance de calcul arrive sur le terrain. Pour transformer l'essai : énergie fiable, talents opérationnels, données gouvernées. Place aux résultats, fin des promesses.",
      "published_ts": 1762527254,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://blog.octo.com/connaissez-vous-vraiment-les-okr-quelques-astuces-pour-bien-demarrer",
      "title": "Connaissez vous vraiment les OKR ? Quelques astuces pour bien démarrer",
      "summary": "Je vous partage quelques astuces OKR à avoir pour bien démarrer et éviter quelques pièges. Avançons dans un cycle OKR et voyons comment progresser un peu plus sereinement",
      "published_ts": 1762521310,
      "source_name": "OCTO Talks!"
    },
    {
      "url": "https://www.zdnet.fr/pratique/je-dirige-une-tres-petite-entreprise-voici-21-facons-simples-ou-lia-me-fait-gagner-du-temps-chaque-jour-484597.htm#xtor=RSS-1",
      "title": "Je dirige une très petite entreprise. Voici 21 façons simples où l'IA me fait gagner du temps chaque jour",
      "summary": "Du codage au marketing en passant par la production sur YouTube, voici comment une entreprise de deux personnes exploite l'IA pour surpasser des équipes dix fois plus grandes qu'elle.",
      "published_ts": 1762517518,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634089/Cyberhebdo-du-7-novembre-2025",
      "title": "Cyberhebdo du 7 novembre 2025 : l’Allemagne encore fortement touchée",
      "summary": "<p>Bienvenue dans ce nouveau numéro du Cyberhebdo, votre rendez-vous hebdomadaire dédié à l’actualité des cyberattaques à travers le monde.</p> \n<p>Au cours de la semaine écoulée, notre veille a recensé huit incidents majeurs rapportés dans la presse internationale, touchant des organisations et institutions de six pays&nbsp;: Taïwan (TWN), Pays-Bas (NLD), Allemagne (DEU), Suisse (CHE), États-Unis (USA) et Australie (AUS).</p> \n<p>Fait marquant de cette édition&nbsp;: l’Allemagne (DEU) se distingue comme le pays le plus ciblé, avec trois attaques recensées sur son territoire. Cette concentration d’incidents met en lumière la pression croissante qui s’exerce sur les infrastructures et entreprises allemandes, dans un contexte de menace cyber toujours plus intense.&nbsp;</p> \n<p>Nous vous rappelons que notre revue de presse se concentre sur les cyberattaques significatives et ne traite pas des attaques DDoS ni des défigurations de sites Web.</p> \n<p>30/10/2025 – <b>Haileybury College</b> (AUS)<br>Haileybury College a été victime d’une attaque cybernétique en octobre, avec un accès limité à son réseau. L’école a contenu la violation une fois l’intrusion découverte et a isolé les systèmes touchés. L’école prend la sécurité du réseau très au sérieux et la sécurité des étudiants et du personnel est sa priorité absolue. (<a href=\"https://www.cyberdaily.au/security/12870-prestigious-haileybury-college-confirms-cyber-security-incident\">source</a>)</p> \n<p>02/11/2025 –&nbsp;<b>Ruag LLC</b> (CHE)<br>La société Ruag LLC, filiale américaine de Ruag, un groupe d’armement suisse, a été victime d’une attaque de ransomware. Cependant l’incident est isolé et n’affecte pas les systèmes ou les données en Suisse. L’attaque a été attribuée à un groupe international agissant à l’échelle mondiale. Les mesures de sécurité appropriées ont été prises pour faire face à l’incident. (<a href=\"https://www.20min.ch/story/ruag-llc-tochtergesellschaft-der-ruag-von-cyberangriff-betroffen-103445810\">source</a>)</p> \n<p>03/11/2025 –&nbsp;<strong>Comté de Dillon</strong>&nbsp;(USA)<br>Le comté de Dillon en Caroline du Sud a détecté une perturbation de son réseau le 3&nbsp;novembre et enquête sur une possible faille de sécurité avec des spécialistes forensiques tiers et les forces de l’ordre. Les responsables n’ont pas précisé quels systèmes ont été affectés. Le comté travaille avec des spécialistes externes et les forces de l’ordre pour déterminer l’ampleur de la perturbation. (<a href=\"https://dysruptionhub.com/dillon-county-sc-possible-hack/\">source</a>)</p> \n<p>03/11/2025 - <b>Kingcan Holdings Limited</b>&nbsp;(TWN)<br>La filiale de Fujian Fuzhen Metal Packaging Co., Ltd., (fabricant d’emballages métalliques) a été victime d’une cyberattaque, mais grâce à l’activation rapide des mécanismes de défense, il n’y a pas eu de fuite de données personnelles ou d’informations confidentielles, et l’impact sur les opérations de l’entreprise est minime. Une cyberattaque contre Kingcan a été revendiquée par Radar le jour même. (<a href=\"https://emops.twse.com.tw/server-java/t05sr01_1_e?&amp;isNew=Y&amp;seq_no=1&amp;spoke_time=190727&amp;spoke_date=20251103&amp;co_id=8411\">source</a>)</p> \n<p>04/11/2025 –&nbsp;<b>Grande paroisse Saint-Luc de Düren</b> (DEU)<br>La grande paroisse Saint-Luc de Düren, en Allemagne, a été victime d’une attaque de hackers, les systèmes informatiques ont été visés dans la nuit du 3&nbsp;novembre. La paroisse comprend notamment la communauté de St Anna et l’église Annakirche. (<a href=\"https://www.aachener-zeitung.de/lokales/region-dueren/dueren/st.-lukas-ist-opfer-eines-hackerangriffs-geworden/103432091.html\">source</a>)</p> \n<p>05/11/2025 –&nbsp;<strong>Centre médical du Haut-Palatinat&nbsp;nord</strong>&nbsp;(DEU)<br>Le centre médical du Haut-Palatinat&nbsp;nord a subi une attaque informatique, ce qui a conduit à la fermeture temporaire de deux de ses sites à Tirschenreuth et Kemnath. Les cliniques ne sont pas affectées et le site de Weiden continue de fonctionner. Les systèmes ont été déconnectés en raison de la découverte d’un logiciel malveillant. (<a href=\"https://www.oberpfalzecho.de/beitrag/cyberangriff-legt-mvz-in-tirschenreuth-und-kemnath-lahm\">source</a>)</p> \n<p>06/11/2025 –&nbsp;<b>Ludwigshafen</b> (DEU)<br>Le réseau de la ville de Ludwigshafen a été victime d’une attaque de pirates, ce qui a entraîné une panne généralisée. Les détails de l’incident ne sont pas encore connus, mais il s’agit potentiellement du deuxième cas d’attaque de ce type dans la région, après celle qui a touché l’administration du district il y a trois ans. Une conférence de presse est prévue pour fournir plus d’informations. (<a href=\"https://www.mannheimer-morgen.de/orte/ludwigshafen_artikel,-ludwigshafen-hackerangriff-legt-netzwerk-der-stadtverwaltung-ludwigshafen-lahm-_arid,2339209.html\">source</a>)</p> \n<p>06/11/2025 –&nbsp;<b>RTV Noord</b> (NLD)<br>Le radiodiffuseur public RTV Noord a été victime d’une attaque de pirates, ce qui a des conséquences importantes pour les émissions et les publications sur toutes les plateformes. Les employés travaillent dur pour trouver une solution. Les pirates ont laissé un message dans les systèmes de RTV Noord, mais son contenu n’a pas été divulgué. (via eCrime.ch) (<a href=\"https://www.rtvnoord.nl/economie/RX-231/rtv-noord-gehackt-gevolgen-voor-uitzendingen-en-alle-platforms\">source</a>)</p> \n<p><i>Revue de presse réalisée en partie avec ChatGPT. <a href=\"https://www.lemagit.fr/actualites/365535799/Cyberhebdo-LeMagIT-met-lIA-au-service-de-linformation-de-ses-lecteurs\">Les explications sont à lire ici</a>.</i></p>",
      "published_ts": 1762516740,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634294/Cybersecurite-du-musee-du-Louvre-un-debat-tronque",
      "title": "Cybersécurité du Musée du Louvre : un débat tronqué",
      "summary": "<p>La Cour des comptes vient de publier son rapport sur la gestion de l’établissement public du Musée du Louvre entre 2018 et 2024. Très attendu, notamment à la suite du <a href=\"https://www.lemonde.fr/societe/article/2025/10/19/le-louvre-victime-d-un-braquage-et-ferme-pour-la-journee-des-bijoux-d-une-valeur-inestimable-derobes_6648121_3225.html\">cambriolage</a> du 19&nbsp;octobre, ce rapport pointe un «&nbsp;retard préoccupant en matière de systèmes d’information en cours de rattrapage&nbsp;», avec notamment un «&nbsp;sous-investissement chronique&nbsp;».</p> \n<p>On y apprend notamment que c’est en 2021 qu’une démarche de cartographie des risques a été lancée. Sans surprise, «&nbsp;les risques d’attaques informatiques externes sont ceux ayant reçu la cotation la plus élevée en termes d’impact et de probabilité&nbsp;».</p> \n<p>Le rapport <a href=\"https://www.ccomptes.fr/sites/default/files/2025-11/20251106-Etablissement-public-musee-du-Louvre.pdf\">révèle</a> que «&nbsp;le recrutement d’un responsable de la sécurité des systèmes d’information (RSSI), prévu dans le plan d’action de la carte des risques, a pu se concrétiser en avril&nbsp;2024, dans le contexte de préparation des Jeux olympiques et de tentatives récurrentes de fraudes à la billetterie&nbsp;».</p> \n<p>Avant cela, les missions correspondantes étaient «&nbsp;prises en charge par le chef de service système réseau et sécurité&nbsp;». Selon les informations à notre disposition, ce dernier est resté en poste de novembre&nbsp;2016 à juin&nbsp;2023.</p> \n<p>Nous avons retrouvé la trace d’une annonce du Musée du Louvre, le 5&nbsp;juin&nbsp;2023, pour le recrutement de son RSSI. Alors, donc, que son chef de service système réseau et sécurité était activement sur le départ. Le 29&nbsp;décembre&nbsp;2023, l’établissement public <a href=\"https://www.linkedin.com/posts/musee-du-louvre_louvre-recrutement-culture-activity-7146456980117757952-ogiW?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAARBf4B7ZyAK6E1F1F4Y_BV7f_OFO_B8WM\">publiait</a> une autre annonce, cherchant manifestement toujours son RSSI. Derrière la question de la cybersécurité du Louvre se cache peut-être aussi une question de gestion des ressources humaines.</p> \n<p>Les <a href=\"https://www.liberation.fr/checknews/louvre-en-mot-de-passe-logiciels-obsoletes-mises-a-jour-impossibles-dix-ans-de-failles-dans-la-securite-informatique-du-premier-musee-au-monde-20251101_RD5YGV6WMVAXLL6U3SRGVFBIBY/\">révélations</a> de nos confrères de <i>Libération</i> sur la cybersécurité du Louvre, qui pointent notamment deux audits de l’Agence nationale de la sécurité des systèmes d’information (Anssi) en 2014 et 2017, n’ont pas manqué de provoquer des débats animés, sur les mots de passe et la gestion de l’obsolescence.</p> \n<p>Mais sans connaissance de la topologie du système d’information, et plus généralement des mesures susceptibles d’avoir été mises en place pour protéger les systèmes concernés, il est difficile de juger la véritable gravité de ce qui, superficiellement, pourrait paraître très préoccupant.</p> \n<p>De nombreux connaisseurs l’ont relevé sur les réseaux sociaux&nbsp;: «&nbsp;si c’est en circuit fermé, peu importe le système, à moins de soupçonner les employés. Il y a plein de vieux systèmes comme ça dans l’industrie. Ils ne sont tout simplement pas connectés à l’extérieur et font très bien le job&nbsp;».</p> \n<p>L’ancien chef de service système réseau et sécurité du musée l’a lui-même relevé, indiquant à quand remonte le premier audit en question, et soulignant qu’il s’agissait d’un «&nbsp;réseau fermé&nbsp;», non exposé au risque d’intrusion logique. Et d’expliquer que «&nbsp;la mitigation du risque sur des PC isolés, dans des locaux sécurisés, dans des zones sécurisées, sans accès externe, sans Internet, en vase clos, sur une infra[structure] matérielle dédiée et isolée, ça enlève un certain nombre de risques&nbsp;».</p> \n<p>Lui, qui est donc arrivé entre les deux audits, insiste en outre&nbsp;: «&nbsp;beaucoup de choses ont été faites depuis&nbsp;».</p>",
      "published_ts": 1762516500,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.journaldunet.com/management/emploi-cadres/1543481-le-cout-cache-d-un-cdi-la-vraie-rentabilite-des-missions-freelances-pour-vos-projets/",
      "title": "CDI ou freelance ? La vraie rentabilité de vos projets, de l'expert solo au collectif",
      "summary": "Le CDI cache des coûts élevés pour vos projets. Le freelance est la solution rentable. Solo ou en collectif, il offre expertise, flexibilité et coordination pour optimiser votre budget.",
      "published_ts": 1762511367,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/quest-ce-que-le-vibe-coding-le-mot-de-lannee-2025-selon-le-dictionnaire-collins/",
      "title": "Qu’est-ce que le « vibe coding », le mot de l’année 2025 selon le dictionnaire Collins ?",
      "summary": "C’est une expression née sur X, popularisée par les ingénieurs, et désormais consacrée par les linguistes : « vibe coding » vient d’être désigné mot de l’année 2025 par le dictionnaire britannique Collins. Une reconnaissance qui illustre la fusion toujours plus étroite entre le langage naturel et la technologie, et la manière dont l’intelligence artificielle transforme la […]",
      "published_ts": 1762511193,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/snapchat-sallie-a-perplexity-un-partenariat-a-400-millions-de-dollars/",
      "title": "Snapchat s’allie à Perplexity : un partenariat à 400 millions de dollars",
      "summary": "Si Snapchat s’était fait très discret dans l’univers de l’intelligence artificielle, le réseau social semble déterminé à se positionner face à la concurrence. En effet, Snap Inc. vient d’annoncer un accord majeur avec Perplexity, afin de marquer une nouvelle étape pour l’entreprise qui cherche à réinventer son expérience utilisateur. Un moteur de recherche conversationnel intégré […]",
      "published_ts": 1762511015,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/netflix-atteint-un-record-mondial-avec-94-millions-dutilisateurs-de-son-offre-financee-par-la-pub/",
      "title": "Netflix atteint un record mondial avec 94 millions d’utilisateurs de son offre financée par la pub",
      "summary": "Trois ans après son lancement, et après des chiffres très encourageants partagés par la plateforme l’an dernier, l’offre avec publicité de Netflix s’impose comme un véritable moteur de croissance sur le territoire français. Selon les données du nouveau baromètre Watch de Médiamétrie, réalisé en partenariat avec Les Echos, 10 millions de personnes regardent chaque mois […]",
      "published_ts": 1762510990,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/ia-ou-moteurs-de-recherche-les-francais-continuent-de-faire-confiance-a-google-plutot-qua-chatgpt/",
      "title": "IA ou moteurs de recherche : les Français continuent de faire confiance à Google plutôt qu’à ChatGPT",
      "summary": "Si tous les signes montrent que l’IA s’impose peu à peu dans les usages quotidiens, jusqu’à être devenue une habitude pour plus d’un milliard de personnes sur la planète, les Français continuent de privilégier les moteurs de recherche traditionnels pour s’informer. C’est ce que met en lumière le deuxième volet de l’étude menée par Eskimoz […]",
      "published_ts": 1762510670,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/tinder-espere-relancer-sa-croissance-en-analysant-les-photos-de-ses-utilisateurs/",
      "title": "Tinder espère relancer sa croissance en analysant les photos de ses utilisateurs",
      "summary": "Après s’être retrouvé en difficulté depuis 2022, face à des choix technologiques discutables, une baisse des abonnés payants, et des concurrents de plus en plus agressifs, Tinder ne s’avoue pas vaincu… Dans son dernier rapport aux investisseurs, Tinder sort l’arme de l’intelligence artificielle. Le groupe Match, propriétaire de l’application, teste actuellement une nouvelle fonctionnalité baptisée […]",
      "published_ts": 1762510618,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/face-a-openai-et-anthropic-apple-sallierait-a-google-pour-relancer-siri/",
      "title": "Face à OpenAI et Anthropic, Apple s’allierait à Google pour relancer Siri",
      "summary": "Alors qu’Apple promettait depuis 2024 une révolution avec Apple Intelligence, la firme de Cupertino semble toujours à la peine face à la concurrence d’OpenAI, Anthropic ou Google. Pour relancer la course, elle s’apprêterait à signer un accord inédit avec Google, pour offrir à Siri un véritable cerveau dopé à l’IA grâce à Gemini… Gemini, le […]",
      "published_ts": 1762510473,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545901-invoice-to-cash-un-barometre-discret-mais-essentiel-de-la-robustesse-financiere-des-entreprises/",
      "title": "Invoice-to-Cash : un baromètre discret mais essentiel de la robustesse financière des entreprises",
      "summary": "Les équipes comptables doivent aujourd'hui endosser un rôle de bouclier anticrise, l'occasion de rappeler l'importance cruciale des processus Invoice-to-Cash au service d'une croissance durable.",
      "published_ts": 1762509803,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/efficacite-personnelle/1545877-repenser-les-reunions-hybrides-vers-une-culture-du-travail-plus-intelligente-et-centree-sur-l-humain/",
      "title": "Repenser les réunions hybrides : vers une culture du travail plus intelligente et centrée sur l'humain",
      "summary": "Le travail hybride n'est plus une expérimentation, il s'impose désormais comme le modèle dominant dans les entreprises françaises.",
      "published_ts": 1762509355,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/emploi-cadres/1545811-5-competences-humaines-qui-te-protegeront-dans-un-monde-domine-par-l-ia/",
      "title": "5 compétences humaines qui te protégeront dans un monde dominé par l'IA",
      "summary": "L'IA est partout, menace nos emplois, nous force à nous adapter, à repenser nos méthodes. En observant ma propre carrière, je vous donne les 5 principes à suivre pour grandir avec l'IA.",
      "published_ts": 1762509197,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545807-la-france-ne-peut-plus-ignorer-la-supply-chain/",
      "title": "La France ne peut plus ignorer la Supply Chain",
      "summary": "La Supply Chain est au XXIᵉ siècle ce que fut l'énergie au XXᵉ : le nerf de la puissance.",
      "published_ts": 1762508408,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/cybersecurite/1545895-les-barrieres-numeriques-echouent-a-proteger-la-generation-connectee-d-aujourd-hui/",
      "title": "Les barrières numériques échouent à protéger la génération connectée d'aujourd'hui",
      "summary": "La loi française sur la majorité numérique et la lutte contre la haine en ligne imposent aux plateformes des responsabilités pour protéger les enfants contre les contenus nuisibles. Cela marque une étape décisive dans la protection numérique des jeunes internautes.",
      "published_ts": 1762508230,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/patrimoine/finances-personnelles/1545805-pacte-dutreil-reformer-sans-affaiblir-la-transmission-d-entreprise/",
      "title": "Pacte Dutreil : réformer sans affaiblir la transmission d'entreprise",
      "summary": "Pilier de la transmission d'entreprise depuis plus de vingt ans, le Pacte Dutreil est au cœur de discussions parlementaires. Réformer, oui, mais sans en faire un frein à la transmission familiale.",
      "published_ts": 1762507190,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/cybersecurite/1545859-cyber-resilience-proteger-les-voyages-aeriens-des-chaos-estivaux/",
      "title": "Cyber-résilience : protéger les voyages aériens des chaos estivaux",
      "summary": "Les cyberattaques menacent le secteur aérien, perturbant vols et opérations et faisant de la cybersécurité un enjeu majeur pour l'industrie.",
      "published_ts": 1762505982,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/business/1545929-budget-2026-une-trajectoire-d-endettement-sous-haute-tension/",
      "title": "Budget 2026 : une trajectoire d'endettement sous haute tension",
      "summary": "Le projet de loi de finances 2026 prévoit un déficit public maintenu à 4,4 % du PIB. Malgré des ajustements annoncés, la dynamique d'endettement français reste préoccupante.",
      "published_ts": 1762500420,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/spotify-introduit-des-statistiques-decoute-hebdomadaires-484610.htm#xtor=RSS-1",
      "title": "Spotify introduit des statistiques d’écoute hebdomadaires",
      "summary": "La nouvelle fonctionnalité de Spotify vous offre un mini « Wrapped » chaque semaine, avec une playlist personnalisée.",
      "published_ts": 1762499474,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/business/action-publique/1545925-le-gouvernement-ecarte-la-taxation-des-entrepots-des-geants-du-numerique/",
      "title": "Le gouvernement écarte la taxation des entrepôts des géants du numérique",
      "summary": "Face à la vacance croissante dans les centres-villes, le gouvernement a retenu neuf mesures issues d'un rapport sur le commerce de proximité. Mais la proposition visant à taxer les entrepôts des grandes plateformes a été abandonnée.",
      "published_ts": 1762496760,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zd-tech-les-ia-commencent-a-etre-capables-dintrospection-484653.htm#xtor=RSS-1",
      "title": "ZD Tech : Les IA commencent à être capables d'introspection",
      "summary": "Oui, vous avez bien lu. Selon une nouvelle étude signée Anthropic, le créateur du chatbot Claude, certaines IA seraient capables… de « regarder à l’intérieur d’elles-mêmes ».",
      "published_ts": 1762495905,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/pratique/ia-pratique-installer-le-seul-navigateur-web-agentique-grand-public-utilisant-lintelligence-artificielle-locale-484641.htm#xtor=RSS-1",
      "title": "IA pratique : installer le seul navigateur Web agentique grand public utilisant l'intelligence artificielle locale",
      "summary": "Si vous souhaitez profiter de l'engouement pour les navigateurs agentiques, mais que vous n'appréciez pas du tout l'idée d'envoyer vos données personnelles à une tierce partie, il vous reste une option : employer BrowserOS associé à Ollama.",
      "published_ts": 1762495891,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1545771-rv1-pic-des-leonides/",
      "title": "Une spectaculaire pluie d'étoiles filantes sera visible en France à 20 heures, voici la date à retenir",
      "summary": "Cette fois-ci, il ne sera pas nécessaire de veiller toute la nuit pour apprécier les étoiles filantes. Elles seront visibles en soirée.",
      "published_ts": 1762494601,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/patrimoine/finances-personnelles/1545829-hf1-eviter-hausse-pass-navigo/",
      "title": "Chaque année il évite la hausse du Pass Navigo : il est encore possible de faire comme lui mais il faut se dépêcher",
      "summary": "Pour la 4e année consécutive le prix du Pass Navigo va augmenter. Une astuce permet toutefois d'éviter de payer l'augmentation des tarifs, mais il faut agir vite.",
      "published_ts": 1762494302,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/ils-ont-manipule-des-agents-dia-concus-pour-les-transactions-automatisees-un-seul-a-totalement-resiste-484638.htm#xtor=RSS-1",
      "title": "Ils ont manipulé des agents d'IA conçus pour les transactions automatisées - un seul a totalement résisté",
      "summary": "Les agents de l'IA peuvent acheter et vendre en notre nom. Et voici pourquoi cela devrait nous inquiéter.",
      "published_ts": 1762488698,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/apple-va-desactiver-une-fonction-cle-entre-iphone-et-apple-watch-en-europe-484628.htm#xtor=RSS-1",
      "title": "Apple va désactiver une fonction clé entre iPhone et Apple Watch en Europe",
      "summary": "Apple confirme la suppression d’une fonction pratique de l’iPhone vers l’Apple Watch dans l’UE. Une décision liée au DMA qui va impacter l’usage quotidien, mais pas autant qu’on pourrait le craindre.",
      "published_ts": 1762477906,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/red-hat-aussi-se-met-a-la-mode-de-la-souverainete-des-donnees-numeriques-484630.htm#xtor=RSS-1",
      "title": "Red Hat aussi se met à la mode de la souveraineté des données numériques",
      "summary": "La nouvelle offre de Red Hat répond à une tendance en croissance en France et en Europe.",
      "published_ts": 1762477864,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-aws-capabilities-by-region-for-easier-regional-planning-and-faster-global-deployments/",
      "title": "Introducing AWS Capabilities by Region for easier Regional planning and faster global deployments",
      "summary": "AWS Capabilities by Region is a new planning tool that provides detailed visibility into AWS services, features, APIs, and CloudFormation resources across different AWS Regions, helping customers make informed decisions for global deployments and prevent costly rework through side-by-side regional comparisons and forward-looking roadmap information.",
      "published_ts": 1762464658,
      "source_name": "AWS Blog (global)"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/the-new-era-of-azure-ultra-disk-experience-the-next-generation-of-mission-critical-block-storage/",
      "title": "The new era of Azure Ultra Disk: Experience the next generation of mission-critical block storage",
      "summary": "Since its launch at Microsoft Ignite 2019, Azure Ultra Disk has powered some of the world's most demanding applications and workloads. The post The new era of Azure Ultra Disk: Experience the next generation of mission-critical block storage appeared first on Microsoft Azure Blog .",
      "published_ts": 1762448400,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://blog.cloudflare.com/extract-audio-from-your-videos-with-cloudflare-stream/",
      "title": "Extract audio from your videos with Cloudflare Stream",
      "summary": "Cloudflare Stream provides a unified platform for video storage, encoding, and delivery. We are now enabling developers to seamlessly extract audio from videos.",
      "published_ts": 1762437600,
      "source_name": "Cloudflare Engineering Blog"
    },
    {
      "url": "https://blog.dataiku.com/the-modern-analysts-path-from-question-to-insight",
      "title": "The Modern Analyst’s Simplified Path From Question to Insight",
      "summary": "It’s Monday morning, marketing just asked a seemingly simple question: “Which suppliers are driving the most customer complaints, and are there any patterns?”",
      "published_ts": 1762437600,
      "source_name": "Dataiku Blog"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634088/RPT-1-SAP-lance-un-modele-de-fondation-dedie-aux-donnees-relationnelles",
      "title": "RPT-1 : SAP lance un « modèle de fondation » dédié aux données relationnelles",
      "summary": "<p>Lors de son TechEd organisé à Berlin, SAP a présenté le fruit de deux ans de travail en matière d’IA. Dès 2023, Erik&nbsp;Marcadé, alors vice-président de l’analytique avancée chez SAP, avait évoqué que l’éditeur allemand envisageait l’entraînement d’un «&nbsp;modèle de fondation&nbsp;».</p> \n<p>Ce qu’il n’avait pas dit, c’est que ce dernier mêlerait <a href=\"https://www.lemagit.fr/definition/Machine-Learning\">machine learning</a> traditionnel et compréhension avancée du langage.</p> \n<p>SAP-RPT-1 (RPT, pour Relational Pre-trained Transformer) est dans les faits, un modèle Transformer modifié pour deux tâches de prédiction&nbsp;(régression et classification) à partir de tables. Pour rappel, le terme Transformer désigne une architecture de réseaux de neurones. C’est le socle des modèles NLP. Et des grands modèles de langage popularisés par l’application <a href=\"https://www.lemagit.fr/definition/ChatGPT\">ChatGPT.</a></p> \n<p>Techniquement, RPT-1 peut être perçu comme un <a href=\"https://www.lemagit.fr/conseil/Reseaux-de-neurones-RNN-et-CNN-comment-les-differencier\">réseau de neurones récurrent.</a></p> \n<p>Il est pensé pour optimiser des prédictions effectuées sur des données structurées en exploitant le contexte sémantique.</p> \n<p>«&nbsp;SAP-RPT-1 est conçu pour comprendre les relations dans les données structurées, telles que les bons de commande, les transactions financières, les tables de performance des fournisseurs ou les indicateurs de ressources humaines&nbsp;», indique l’éditeur dans sa documentation. Il suffit de lui confier un fichier CSV en entrée. Sa tâche est de remplir la valeur à prédire.</p> \n<p>La collection commerciale inclut deux modèles&nbsp;: SAP-RPT-1-Small et SAP-RPT-1-Large. Ils sont pour l’instant disponibles gratuitement depuis une interface «&nbsp;playground&nbsp;» dédiée, ou via API à travers le Generative AI Hub. La disponibilité générale est prévue plus tard au quatrième trimestre&nbsp;2025.</p> \n<p>Dans son bac à sable, l’éditeur décline différents scénarios utiles en entreprise. Maintenance prédictive, recommandation d’offres commerciales, prédiction de retard de paiements, priorisation de tickets de support client, estimation de l’empreinte carbone de matériaux… Tout y passe ou presque. D’ailleurs, SAP-RPT-1 peut prédire des valeurs (ex.&nbsp;: la quantité de CO2 généré par le sourcing) et des mots (ex.&nbsp;: le niveau de criticité d’un ticket).</p> \n<p>La promesse de SAP est de réduire drastiquement, voire de supprimer l’entraînement autrefois nécessaire des algorithmes d’analytique prédictive. RPT-1 présenterait des résultats&nbsp;2 à 3,5&nbsp;fois supérieurs comparativement aux modèles de sa catégorie et aux LLM (Large Language Model) pour les mêmes tâches.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Une famille de modèles qui se développe en parallèle des LLM\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une famille de modèles qui se développe en parallèle des LLM</h2>\n <p>L’équipe marketing de SAP ne perd pas ses vieilles habitudes. RPT-1 (à prononcer «&nbsp;rapide one&nbsp;») est le renommage de ContextTab, un modèle «&nbsp;open weight&nbsp;» (sous licence Apache&nbsp;2.0). Il est désormais accessible sous l’appellation&nbsp;sap-rpt1-oss.</p>\n <p>C’est le membre d’une nouvelle famille de modèles. Ceux-là exploitent «&nbsp;l’apprentissage en contexte&nbsp;» au sein de données tabulaires. L’un des premiers du genre, né en novembre&nbsp;2022 comme ChatGPT, se nomme TabPFN. Il a été entraîné par des chercheurs de l’université de Fribourg, l’Université de médecine Charité de Berlin et du centre d’intelligence artificielle de l’équipementier Bosch. &nbsp;</p>\n <p>Certains d’entre eux ont fondé la startup PriorLabs, en 2024. Ils ont ainsi présenté TabPFNv2. Un modèle qui a inspiré TableICL, un projet mené par une équipe interdisciplinaire au sein de l’INRIA.</p>\n <p>Une équipe de trois chercheurs des universités de Washington, d’Harvard et de Stanford ont présenté en 2024 Tabula-8B, un modèle de langage de prédiction de tables.</p>\n <p>Ce sont ces projets qui ont inspiré des chercheurs au sein de SAP SE (Allemagne) et SAP France pour entraîner ContextTab.</p>\n <p>L’article de recherche associé, paru en juin, et qui sera présenté lors du NeurIPS de San Diego, indique que SAP s’appuie sur l’architecture TabPFN. Ainsi, il exploite une version alternative du mécanisme d’attention hybride. Dans un LLM, il sert à interpréter la place d’un mot dans une phrase et dans un texte. Ici, il est exploité pour comprendre la relation entre les colonnes et la relation entre les lignes dans une table.</p>\n <p>«&nbsp;Conformément à TabPFN, l’attention entre les colonnes n’est pas masquée, tandis que l’attention entre les rangées est masquée de manière que chaque rangée ne puisse s’intéresser qu’au contexte fourni&nbsp;», écrivent les chercheurs de SAP. «&nbsp;Pour augmenter la modularité de notre code, le bloc MLP feedforward du Transformer est répété après chaque bloc d’auto-attention de sorte que les blocs “horizontaux” et “verticaux” ont la même structure&nbsp;».</p>\n <p>Du fait de cette architecture à deux dimensions (horizontale et verticale), ContextTab (RPT-1) est proportionnellement deux fois plus grand que le réseau de neurones BERT, imaginé par Google Research. Le modèle final contient 172&nbsp;millions de paramètres, dont 16&nbsp;millions entraînable. Il est doté d’une fenêtre de contexte de 8&nbsp;000 tokens.</p>\n <p>Une fonction d’entropie croisée (de perte) après un bloc de perceptron multiple est utilisée pour réaliser la classification. Pour l’exercice de régression, le modèle «&nbsp;prédit la valeur en virgule flottante de la cible, puis elle est écrêtée et normalisée&nbsp;».</p>\n</section>          \n<section class=\"section main-article-chapter\" data-menu-title=\"L’apport des « données du monde réel »\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’apport des «&nbsp;données du monde réel&nbsp;»</h2>\n <p>L’apport de ContextTab se joue davantage au niveau de la vectorisation et des données utilisées lors de l’entraînement.</p>\n <p>L’encodage des données est différent suivant leur nature. Trois techniques distinctes sont utilisées pour le texte, les dates, les nombres et l’en-tête des colonnes. Pour le texte, <a href=\"https://www.lemagit.fr/conseil/Lessentiel-sur-les-modeles-dembeddings\">un modèle d’embedding</a> de petite taille est utilisé. L’en-tête des colonnes subit le même traitement, couplé à une fonction de normalisation.</p>\n <p>Les dates, les jours, les mois et les années et leur signification (par exemple quand ce sont des périodes de vacances ou qu’ils sont fériés) sont encodés dans trois vecteurs distincts.</p>\n <p>Les nombres sont encodés à l’aide d’un vecteur à une dimension. Selon les chercheurs, les données numériques sont normalisées (écrêtage, centrage-réduction) pour éviter les problèmes d’explosion des gradients à l’entraînement. Puis, elles sont encodées par multiplication avec un vecteur appris. Les scientifiques ont incorporé un biais pour que les valeurs manquantes (NaN) soient remplacées par un 0.</p>\n <p>«&nbsp;Il convient de noter que tous les embeddings ci-dessus sont entièrement équivariants en cas de permutations des lignes ou des colonnes&nbsp;», précisent les chercheurs. Cette symétrie rend les prédictions «&nbsp;plus robustes et reproductibles&nbsp;».</p>\n <p>Lors de l’entraînement de ContextTab, l’équipe de SAP a utilisé 2,18&nbsp;millions de tables issues du jeu de données&nbsp;T4, à l’instar des chercheurs derrière Tabula-8B. Ces tables sont issues de différentes sources, dont les dépôts Git ouverts ou CommonCrawl (une extraction géante du Web).</p>\n <p>&nbsp;TabPFN et TabICL n’ont été entraînés qu’avec <a href=\"https://www.lemagit.fr/conseil/Donnees-synthetiques-ou-reelles-quel-choix-pour-lanalytique-predictive\">des données synthétiques.</a> «&nbsp;Si l’utilisation de données synthétiques présente de nombreux avantages, en particulier sa diversité à grande échelle, elle a pour conséquence que les données ne contiennent pas de valeurs sémantiquement significatives telles qu’on les trouve dans les applications du monde réel&nbsp;», distinguent les chercheurs de SAP.</p>\n <p>Résultat, ContextTab obtiendrait de meilleurs résultats que ses aînés sur les données sémantiques et proposerait des performances proches des modèles «&nbsp;non sémantiques&nbsp;» (XGBoost, par exemple). Il ne dépasse pas toutefois AutoGluon, un framework d’autoML imaginé par AWS en 2020.</p>\n</section>         \n<section class=\"section main-article-chapter\" data-menu-title=\"Industrialiser RPT-1\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Industrialiser RPT-1</h2>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;L’utilisation d’un LLM pour effectuer la même tâche de prédiction nécessite jusqu’à 100&nbsp;000&nbsp;fois plus d’opérations en virgule flottante (FLOP).&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Philip&nbsp;Herzig</strong>CTO et chief AI officer, SAP\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Avec les versions commerciales de RPT-1, SAP dit avoir amélioré ces résultats en s’appuyant sur des données réelles. Le modèle open weight réclame <a href=\"https://www.lemagit.fr/actualites/366538613/Dell-World-2023-le-PowerEdge-XE9680-premiere-machine-HGX-H100\">un seul GPU&nbsp;Nvidia&nbsp;H100</a> (80&nbsp;Go de VRAM) pour s’exécuter correctement. C’est à la fois peu et beaucoup au vu des tâches à accomplir. C’est en tout cas beaucoup mieux que la plupart des LLM.</p>\n <p>«&nbsp;L’utilisation d’un LLM pour effectuer la même tâche de prédiction nécessite jusqu’à 100&nbsp;000&nbsp;fois plus d’opérations en virgule flottante (FLOP)&nbsp;», assure Philip&nbsp;Herzig, CTO et chief AI officer chez SAP, dans un billet de blog. «&nbsp;Cela prend jusqu’à 50&nbsp;fois plus de temps (malgré des équipements nettement plus puissants)&nbsp;».</p>\n <p>Toutefois, comme les modèles de langage, il n’y a pas de magie. La documentation de SAP précise qu’il faut d’abord s’assurer de la bonne qualité des données au sein de tables. Cela veut dire supprimer au maximum les valeurs manquantes, de correctement nommer les colonnes, d’enregistrer un type de données par colonne et de n’appliquer ce traitement que sur les données nécessaires. Et au CTO de préciser qu’il est possible de fine-tuner la version open weight de RPT-1.</p>\n <p>La technologie est intéressante sur le papier. Notamment au vu des déploiements passés du <a href=\"https://www.lemagit.fr/definition/Machine-Learning\">machine learning</a> au sein de l’écosystème SAP. Reste à l’éditeur allemand de l’intégrer dans ses solutions. D’en simplifier le <a href=\"https://www.lemagit.fr/conseil/Prompt-engineering-et-fine-tuning-quelles-sont-les-differences\">fine-tuning</a>, au besoin. &nbsp;</p>\n <p>L’annonce permet surtout à SAP de tâter le terrain. La centaine de commentaires sous le post LinkedIn de Philip&nbsp;Herzig qui accompagne l’annonce reflète un engouement certain. Et pas seulement au sein des équipes SAP. Les partenaires semblent bien accueillir la solution.</p>\n</section>",
      "published_ts": 1762434360,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/cest-trop-injuste-ces-voix-dans-la-cyber-qui-defendent-la-securite-informatique-du-louvre-484550.htm#xtor=RSS-1",
      "title": "C’est trop « injuste »: ces voix dans la cyber qui défendent la sécurité informatique du Louvre",
      "summary": "Après le vol des bijoux, le célèbre musée parisien vient de faire la une de la presse informatique.",
      "published_ts": 1762423903,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://siecledigital.fr/2025/11/06/youtube-teste-des-pubs-impossibles-a-fermer-sur-mobile-les-utilisateurs-sagacent/",
      "title": "YouTube teste des pubs impossibles à fermer sur mobile : les utilisateurs s’agacent",
      "summary": "Alors que YouTube était déjà largement critiqué au début de l’année pour ses publicités jugées beaucoup trop longues, les utilisateurs de la plateforme ne devraient pas apprécier cette nouvelle mise à jour… En effet, YouTube serait en train de tester une nouvelle forme de publicité sur mobile qui ne passe pas inaperçue chez les premiers […]",
      "published_ts": 1762422867,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/06/spotify-depasse-les-700-millions-dutilisateurs-mais-fait-face-a-une-plainte-pour-ecoutes-frauduleuses/",
      "title": "Spotify dépasse les 700 millions d’utilisateurs, mais fait face à une plainte pour écoutes frauduleuses",
      "summary": "Le géant du streaming musical, qui vient de publier des résultats trimestriels au sommet, fait face au même à une plainte collective aux États-Unis pour fraude aux écoutes. Un contraste saisissant pour l’entreprise dirigée par Daniel Ek, à quelques semaines d’un changement de direction majeur… Spotify franchit les 700 millions d’utilisateurs Le troisième trimestre 2025 […]",
      "published_ts": 1762422789,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://www.zdnet.fr/actualites/openai-balaie-les-rumeurs-dune-introduction-en-bourse-a-1-000-milliards-le-moment-est-venu-de-se-concentrer-sur-la-croissance-484560.htm#xtor=RSS-1",
      "title": "OpenAI balaie les rumeurs d’une introduction en Bourse à 1 000 milliards : « Le moment est venu de se concentrer sur la croissance »",
      "summary": "Alors que la valorisation d’OpenAI alimente les spéculations, la direction freine les ardeurs des marchés : ni le PDG Sam Altman ni la directrice financière Sarah Prior n’envisagent une IPO à court terme.",
      "published_ts": 1762420273,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/pratique/linux-pratique-les-8-premieres-commandes-que-tout-nouvel-utilisateur-devrait-apprendre-484600.htm#xtor=RSS-1",
      "title": "Linux pratique : les 8 premières commandes que tout nouvel utilisateur devrait apprendre",
      "summary": "Certes, vous pouvez de nos jours manœuvrer votre ordinateur sous Linux en vous servant uniquement de l’interface graphique. Oui, la ligne de commande n’étant plus vraiment obligatoire. Mais celle-ci reste toujours la meilleure manière de faire.",
      "published_ts": 1762413060,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/business/1545871-shein-sous-pression-la-france-enclenche-une-procedure-de-suspension-du-site/",
      "title": "Shein sous pression : la France enclenche une procédure de suspension du site",
      "summary": "Accusée de proposer des contenus illicites sur sa plateforme, Shein est désormais visée par une procédure judiciaire et administrative. Le gouvernement demande le blocage du site en France.",
      "published_ts": 1762412340,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/business/1545881-fisc-les-contribuables-fortunes-de-plus-en-plus-tentes-par-l-exil/",
      "title": "Fisc : les contribuables fortunés de plus en plus tentés par l'exil",
      "summary": "Face au climat politique incertain et aux débats sur un possible durcissement fiscal, de plus en plus de contribuables fortunés envisagent de quitter la France.",
      "published_ts": 1762411500,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/business/action-publique/1545897-budget-2026-le-senat-veut-revoir-a-la-baisse-les-hausses-d-impots-votees-a-l-assemblee/",
      "title": "Budget 2026 : le Sénat veut revoir à la baisse les hausses d'impôts votées à l'Assemblée",
      "summary": "Le Sénat entame l'examen du projet de loi de finances 2026 avec l'objectif d'atténuer les hausses fiscales introduites par les députés. La droite sénatoriale privilégie les économies ciblées à une augmentation de la pression fiscale.",
      "published_ts": 1762411320,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/patrimoine/finances-personnelles/1545759-hf1-pension-retraite-entreprise/",
      "title": "Ces retraités touchent 3 000 euros par mois et leur entreprise embauche toujours des milliers de personnes en France",
      "summary": "En 2025, le montant moyen d'une pension de retraite s'élève à 1 541 euros net par mois. Plusieurs caisses de retraite, réservées aux salariés de certaines entreprises, versent des montants bien plus importants.",
      "published_ts": 1762408202,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/patrimoine/finances-personnelles/1545795-hf1-frais-parents-150-euros/",
      "title": "3 millions de parents d'élèves vont perdre 150 euros : une réforme qui fait mal",
      "summary": "Des millions de parents vont perdre un avantage fiscal auxquels ils étaient habitués depuis des années.",
      "published_ts": 1762407902,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/pratique/utiliser-lia-dans-une-tpe-10-lecons-tirees-de-la-pratique-de-terrain-484588.htm#xtor=RSS-1",
      "title": "Utiliser l'IA dans une TPE : 10 leçons tirées de la pratique de terrain",
      "summary": "Il ne s'agit pas de prouver que l'on peut utiliser l'IA, mais de l'utiliser à bon escient. Passons outre le battage médiatique. Voici des conseils pratiques sur la manière dont les petites entreprises peuvent obtenir des résultats concrets avec l'IA.",
      "published_ts": 1762405915,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/doctolib-condamne-pour-abus-de-position-dominante-484586.htm#xtor=RSS-1",
      "title": "Doctolib condamné pour abus de position dominante",
      "summary": "L'autorité de la Concurrence inflige une amende de 4,6 millions d'euros à la société française, accusée d'abus de position dominante dans le domaine de la prise de rendez-vous médicaux. La société entend faire appel.",
      "published_ts": 1762405904,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/collaboratif/1545843-yousign-devient-youtrust-et-se-positionne-comme-une-plateforme-complete-de-services-de-confiance/",
      "title": "Yousign devient Youtrust et se positionne comme une plateforme complète de services de confiance",
      "summary": "En partant de la signature électronique, son métier historique, l'éditeur français couvre désormais toute la chaîne de confiance digitale, de la vérification des identités et des documents au cachet électronique qui garantit leur authenticité.",
      "published_ts": 1762405205,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/resultats-bouygues-telecom-beneficie-a-fond-de-leffet-la-poste-mobile-484577.htm#xtor=RSS-1",
      "title": "Résultats : Bouygues Telecom bénéficie à fond de l’effet La Poste Mobile",
      "summary": "Au troisième trimestre, la filiale du groupe Bouygues voit son chiffre d’affaires bondir de 5 % grâce à l’intégration de l’opérateur virtuel. Elle engrange, par ailleurs, un grand nombre de nouveaux abonnés dans le fixe comme dans le mobile.",
      "published_ts": 1762402308,
      "source_name": "ZDNet France"
    }
  ],
  "news": [
    {
      "url": "https://seattledataguy.substack.com/p/5-things-in-data-engineering-that-d11",
      "title": "5 Things in Data Engineering That Have Changed In The Last 10 Years",
      "summary": "What Will Change Next?",
      "published_ts": 1762532413,
      "source_name": "Seattle Data Guy"
    },
    {
      "url": "https://blog.dataexpert.io/p/stop-using-slowly-changing-dimensions",
      "title": "SCD-2 considered harmful! Part 2",
      "summary": "Date stamp your data!",
      "published_ts": 1762289068,
      "source_name": "DataEngineer.io"
    },
    {
      "url": "https://www.dataengineeringweekly.com/p/data-engineering-weekly-244",
      "title": "Data Engineering Weekly #244",
      "summary": "The Weekly Data Engineering Newsletter",
      "published_ts": 1762161774,
      "source_name": "Data Engineering Weekly"
    }
  ],
  "news_general": [
    {
      "url": "https://www.zdnet.fr/pratique/video-ia-ou-reelle-les-6-indices-pour-demasquer-un-deepfake-484671.htm#xtor=RSS-1",
      "title": "Vidéo IA ou réelle ? Les 6 indices pour démasquer un deepfake",
      "summary": "Voici comment repérer les vidéos générées par IA.",
      "published_ts": 1762683071,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634228/Ingestion-transformation-streaming-Snowflake-accelere-le-rythme",
      "title": "Ingestion, transformation, streaming : Snowflake accélère le rythme",
      "summary": "<p>S’il concentre principalement ses efforts sur l’ajout de fonctionnalités d’IA, Snowflake n’en oublie pas ses fondamentaux.</p> \n<p>Lors de sa conférence Build cette semaine, il a présenté la disponibilité générale (ou imminente) de plusieurs fonctionnalités ciblant les ingénieurs de données. Son objectif demeure l’unification d’un maximum de charges de travail sur sa plateforme. Tout en bousculant, au passage, la concurrence.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Snowflake se concentre sur l’ingestion et la transformation de données…\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Snowflake se concentre sur l’ingestion et la transformation de données…</h2>\n <p>D’abord, l’éditeur poursuit le déploiement de son service d’intégration de données, Openflow. <a href=\"https://www.lemagit.fr/actualites/366625496/Openflow-Snowflake-veut-unifier-lingestion-des-donnees-structurees-et-non-structurees\">Basé sur Apache NiFi et le rachat de Datavolo</a>, l’outil aura « bientôt » le droit, en « GA » (General Availability), à l’option Snowflake Deployment. En clair, les clients n’ont plus déployé eux-mêmes l’outil sur AWS ou Azure. Une suite de commandes permet d’installer OpenFlow <a href=\"https://www.lemagit.fr/actualites/366542916/Snowflake-devient-une-Data-PaaS\">depuis Snowpark Container Services</a>, l’instrumentation de Kubernetes et de Docker au besoin de l’éditeur.</p>\n <p>Après l’ingestion, la transformation. Snowpark Connect for Apache Spark doit permettre d’exécuter des DataFrame et des requêtes Spark SQL directement sur le «&nbsp;Data Cloud&nbsp;».</p>\n <p>Les ingénieurs et les data scientists peuvent utiliser des notebooks Jupyter (au sein de Snowflake ou non), Apache Airflow, Snowpark, ou encore Visual Studio Code.</p>\n <p>Il s’agit «&nbsp;d’éliminer la gestion des clusters Spark&nbsp;» et les coûts de sortie des données. Une solution qui serait 3&nbsp;fois plus rapide qu’un cluster Spark self-managed. Elle offrirait une réduction de 30&nbsp;% du coût total de possession.</p>\n <p>Snowflake cherche là à supplanter <a href=\"https://www.lemagit.fr/actualites/366626094/Databricks-aiguise-ses-outils-de-migration-dingestion-et-de-transformation-de-donnees\">Databricks sur son terrain de jeu de prédilection</a>. Tout en sachant pertinemment qu’il ne couvre qu’une portion des fonctionnalités du moteur de traitement mis sur pied par les cofondateurs de Databricks.</p>\n <p>Dans la même veine, l’éditeur a annoncé la disponibilité générale de dbt on Snowflake. En clair, il est possible de gérer et exécuter les pipelines de transformation dbt à même la plateforme. Il n’est plus nécessaire de déployer des instances AWS ou Azure séparées. Là, il s’agit <a href=\"https://www.lemagit.fr/actualites/366632811/Avec-son-moteur-Fusion-dbt-Labs-fait-la-chasse-aux-couts\">d’une alternative à dbt Cloud</a>.</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"… si possible en temps réel\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>… si possible en temps réel</h2>\n <p>À cela s’ajoute un nouveau type de tables, bientôt en disponibilité générale. Les tables et les entrepôts «&nbsp;interactifs&nbsp;» sont optimisés pour l’ingestion et l’interrogation de données «&nbsp;sous la seconde&nbsp;». Ici, Snowflake s’appuie sur des flux de données Apache Kafka et le moteur Snowpipe Streaming.</p>\n <p>Il faut toutefois que les requêtes demeurent simples. Ensemble, les deux dispositifs permettraient d’alimenter des tableaux de bord en quasi temps réel, des API, ou les charges de travail hautement concurrentes. L’éditeur avait déjà <a href=\"https://www.lemagit.fr/actualites/366587992/Snowflake-embrasse-la-philosophie-data-as-code\">proposé les tables dynamiques</a>, servant à rafraîchir rapidement les données. Ici, il cherche principalement à fluidifier les projets de BI opérationnelle ou de machine learning en temps réel.</p>\n <p>Pour les développeurs,&nbsp;Snowflake met en place un espace de travail unifié, organisé en dossiers et en fichiers qui prend en charge les commandes SQL, les notebooks Python, les applications Streamlit et les pipelines de données. Il s’agit de centraliser les outils et les flux de travail à partir de ces workspaces rattachés à des dépôts Git (eux même potentiellement connecté à VS Code). En clair, les profils techniques peuvent pousser l’ensemble des actifs qu’ils conçoivent vers un seul environnement accessible aux métiers. Une initiative lancée en 2023.</p>\n <p>En préversion publique, une interface utilisateur doit permettre d’analyser les données à la recherche de problème de qualité, dont les biais, la fraîcheur, la précision, les valeurs manquantes, etc. Ici, la fonctionnalité est liée au système de lineage de la plateforme. L’objectif semble de proposer une fonctionnalité proche du Trust Score de Qlik Talend. «&nbsp;Nous avons introduit un certain nombre de fonctionnalités, à la fois dans le moteur de base et dans notre interface utilisateur, afin de permettre à nos clients de créer facilement des règles sur la qualité des données&nbsp;», précise Christian Kleinerman. «&nbsp;Il s’agit de savoir quand un jeu de données n’est pas conforme à certains critères&nbsp;».</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Le fail-over des tables Iceberg arrive\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Le fail-over des tables Iceberg arrive</h2>\n <p>Enfin, place aux administrateurs. Snowflake a annoncé la disponibilité générale d’une fonction de reprise après sinistre pour les tables Iceberg. Les objets et les bases de données sont copiés sur plusieurs régions cloud entre un compte Snowflake principal et un autre, secondaire. « Nous n’avons pas fait exprès, mais le moment est opportun », déclare Christian Kleinerman, vice-président directeur du produit chez Snowflake. « Beaucoup de nos clients ont été en mesure d’appliquer le fail-over lors de la panne [d’AWS] et faire de cet incident un non-événement. Ils veulent la même chose pour les tables Iceberg ».</p>\n <p>La prise en charge multirégion d’AWS PrivateLink et du trafic sortant pour Google Private Connect Service en disponibilité générale participe à cet effort. Les administrateurs peuvent d’ailleurs paramétrer des règles de gestion réseau depuis la console Snowflake.</p>\n <p>En outre, Performance Explorer permet d’acquérir des métriques plus précises sur la santé des environnements Snowflake, le volume de requêtes, les changements effectués sur les warehouses et les tables.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Un « rythme d’innovation effréné » ?\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Un «&nbsp;rythme d’innovation effréné&nbsp;» ?</h2>\n <p>Alors qu’il déclinait sa feuille de route sur deux ans (de la sortie d’une fonction en préversion privée à sa disponibilité générale), l’éditeur semble accélérer le mouvement.</p>\n <p>«&nbsp;Si vous considérez ce que nous avons fait au cours des six-douze derniers mois, le rythme de l’innovation chez Snowflake est effréné&nbsp;», affirme Christian Kleinerman en réponse à une question du MagIT. «&nbsp;Bon nombre des technologies en disponibilité générale cette semaine ont été introduites pour la première fois il y a six mois ou moins de six mois&nbsp;», assure-t-il. «&nbsp;Et ce qui est intéressant, c’est que nous avons une multitude d’innovations supplémentaires en cours que nous espérons présenter à nos clients dans le courant de l’année prochaine&nbsp;».</p>\n <p>Beaucoup d’entre elles concernent l’IA et l’IA agentique. Moins la gestion de données pure et dure. «&nbsp;Nous sommes en phase avec les priorités et tendances de l’industrie, et nous continuerons à les saisir pour servir nos clients&nbsp;».</p>\n <p>Il y a toutefois des fonctionnalités clés qui arrivent plus tardivement, du fait de cette course à l’échalote. Par exemple, l’accès unifié aux moteurs externes, dont Apache Spark, Flink, Python, Trino vient de passer en préversion privée. Cet ajout avait été présenté l’année dernière. Ces moteurs ne peuvent que lire les données des tables Iceberg managées à travers l’API REST d’Iceberg et Apache Polaris. La possibilité pour ces moteurs d’écrire des données sur les tables dans la plateforme est encore en cours de développement. C’est pourtant la clé d’une véritable ouverture de la plateforme.</p>\n <p>Enfin, certains clients et partenaires attendent encore des améliorations des tables hybrides.</p>\n</section>",
      "published_ts": 1762527900,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://blog.cloudflare.com/diy-byoip/",
      "title": "DIY BYOIP: a new way to Bring Your Own IP prefixes to Cloudflare",
      "summary": "Announcing a new self-serve API for Bring Your Own IP (BYOIP), giving customers unprecedented control and flexibility to onboard, manage, and use their own IP prefixes with Cloudflare's services.",
      "published_ts": 1762524000,
      "source_name": "Cloudflare Engineering Blog"
    },
    {
      "url": "https://www.zdnet.fr/actualites/accord-apple-google-pour-mettre-sur-pied-le-nouveau-siri-484625.htm#xtor=RSS-1",
      "title": "Accord Apple / Google pour mettre sur pied le nouveau Siri",
      "summary": "Apple se tourne vers Google pour propulser le nouvel Siri : un modèle d’IA à 1,2 trillion de paramètres, près d’un milliard de dollars par an, et un lancement prévu pour le printemps 2026. Un tournant majeur dans la stratégie d’assistant vocal d’Apple.",
      "published_ts": 1762517498,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-07-11-2025-lia-pour-les-tpe-doctolib-sous-pression-samsung-democratise-lia-avec-le-galaxy-a17-484622.htm#xtor=RSS-1",
      "title": "ZDNET Morning 07/11/2025 : L'IA pour les TPE, Doctolib sous pression, Samsung démocratise l’IA avec le Galaxy A17,...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1762513907,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/etude/France-Travail-met-lIA-au-boulot-avec-frugalite-et-souverainete",
      "title": "France Travail met l’IA au boulot (avec frugalité et souveraineté)",
      "summary": "<p>Les avancées de l’intelligence artificielle <a href=\"https://www.lemagit.fr/actualites/366619278/Comment-lIA-transforme-lorganisation-du-travail\">percutent le monde du travail</a>, dont les activités de France&nbsp;Travail, l’agence pour l’emploi. Pour son directeur général adjoint chargé de la technologie, Samir Amellal, l’IA rime néanmoins avec «&nbsp;opportunité&nbsp;» qui peut faciliter le travail des conseillers.</p> \n<p>Le cadre IT réfute toute déshumanisation. «&nbsp;Au contraire, je pense que l’IA participe à humaniser la relation en permettant de mettre l’ordinateur de côté&nbsp;», afin de «&nbsp;se concentrer sur les demandeurs d’emploi&nbsp;», justifie-t-il. Samir Amellal promet donc une accélération du développement en IA, mais tout en l’encadrant sur certains aspects.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Des débuts sur l’IA en 2018 et un nouveau programme en 2024\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des débuts sur l’IA en 2018 et un nouveau programme en 2024</h2>\n <p>Outre ses agents, France&nbsp;Travail destine l’IA aux chômeurs et à «&nbsp;ses publics&nbsp;», c’est-à-dire les entreprises et le réseau pour l’emploi (acteurs locaux et nationaux).</p>\n <p>Pour le directeur adjoint, l’opérateur public doit répondre à des enjeux de sécurité et de souveraineté. Il opère ainsi une transition de ses projets vers Mistral AI et des infrastructures OVH, en remplacement des solutions de fournisseurs non souverains.</p>\n <p>L’organisation a en effet démarré ses développements en intelligence artificielle en 2018, rappelle Sylvain&nbsp;Poirier, directeur des projets IA à France&nbsp;Travail. Cette étape a été «&nbsp;l’occasion de définir la manière dont nous voulions faire de l’IA&nbsp;», explique-t-il.</p>\n <p>Pour les encadrer, l’opérateur a formalisé <a href=\"https://www.francetravail.org/files/live/sites/peorg/files/documents/Publications/Charte%20france%20travail%20IA%202025_DCE-jan25.pdf\">une charte éthique</a> –&nbsp;accessible sur son site. En complément, France&nbsp;Travail s’est doté d’un comité éthique externe.</p>\n <p>Afin de déployer à l’échelle, l’organisation dispose également d’une plateforme Data &amp; IA «&nbsp;sécurisée au sein de France&nbsp;Travail&nbsp;» et des compétences en interne pour des développements «&nbsp;maîtrisés par les équipes&nbsp;».</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Chat FT, un GPT interne sécurisé utilisé par 40 000 agents\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Chat FT, un GPT interne sécurisé utilisé par 40&nbsp;000&nbsp;agents</h2>\n <p>Sur ces fondations, France&nbsp;Travail a initié en 2024 un nouveau programme pour tenir compte des évolutions permises par la <a href=\"https://www.lemagit.fr/definition/Intelligence-artificielle-generative\">GenAI</a>.</p>\n <p>Pour identifier des cas d’usage pertinents, Sylvain&nbsp;Poirier est parti «&nbsp;du terrain&nbsp;». De ce recueil des besoins et d’irritants, l’IT a détecté trois priorités&nbsp;: libérer du temps, faciliter l’accès aux données et aux applications via le langage naturel, et tirer profit de l’IA générative pour «&nbsp;repenser les services&nbsp;» aux conseillers et aux usagers.</p>\n <p>Après un peu plus d’un an, France&nbsp;Travail partage cette année un état des lieux de son programme, avec quelques «&nbsp;solutions&nbsp;».</p>\n <p>Parmi celles-ci Chat FT,&nbsp;le désormais traditionnel «&nbsp;ChatGPT sécurisé interne&nbsp;». L’outil conversationnel compte 40&nbsp;000&nbsp;agents, c’est-à-dire «&nbsp;plus de la moitié&nbsp;» des utilisateurs. Chat FT est considéré comme le moyen de fournir une «&nbsp;première expérience&nbsp;» de l’IA générative.</p>\n <p>La dimension «&nbsp;terrain&nbsp;» du projet se traduit par l’ajout progressif de fonctions comme des connexions aux bases documentaires et au système d’information. «&nbsp;Progressivement, l’outil s’intègre dans les processus métier pour permettre aux agents de gagner du temps&nbsp;», déclare Sylvain&nbsp;Poirier.</p>\n <p>Des indicateurs suggèrent des «&nbsp;résultats encourageants&nbsp;», selon le directeur IA.</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"Des KPI pour mesurer l’adoption et l’utilité de l’IA\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des KPI pour mesurer l’adoption et l’utilité de l’IA</h2>\n <p>Les agents peuvent recourir au chatbot pour organiser des événements, en ligne ou sur des salons. L’utilisation de Chat FT permettrait de diviser par trois ce temps de préparation, mais aussi d’améliorer l’attractivité (+25&nbsp;% d’inscriptions parmi les demandeurs d’emploi).</p>\n <p>Début juin, un baromètre interne mesurait que 56&nbsp;% des agents utilisaient l’IA dans leurs activités professionnelles, et 73&nbsp;% jugeaient son impact positif. «&nbsp;C’est un point de départ important&nbsp;», apprécie Sylvain&nbsp;Poirier. «&nbsp;Mais ce n’est surtout pas la finalité. Nous sommes dans une trajectoire d’acculturation&nbsp;», poursuit-il.</p>\n <p>Pour acculturer et former, des «&nbsp;dispositifs&nbsp;» sont en place. Ils doivent «&nbsp;accompagner cette transformation&nbsp;» auprès des conseillers (auxquels les outils IA sont «&nbsp;proposés&nbsp;» et non imposés) et des chômeurs.</p>\n <p>Pour cette dernière population, France&nbsp;Travail déclare avoir conçu un «&nbsp;calendrier de l’IA&nbsp;» avec Kokoroe et Microsoft. Le calendrier propose formation et acculturation à l’IA en e-learning. Avec Google, l’opérateur public réalise en outre des ateliers numériques.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Bascule sur des modèles Mistral AI\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Bascule sur des modèles Mistral AI</h2>\n <p>Chat FT a été conçu sur la base des modèles d’OpenAI, GPT&nbsp;3.5, au démarrage, migré par la suite vers d’autres LLM de l’Américain. La stratégie de France&nbsp;Travail prévoit cependant, grâce à un partenariat avec Mistral AI, de basculer sur les modèles de la startup.</p>\n <p>Ces travaux remontent à un an déjà. Les utilisateurs ont pu, dans Chat FT, tester l’alternative française. Les résultats étant jugés satisfaisants, le chatbot bascule entièrement sur le <a href=\"https://www.lemagit.fr/actualites/366553854/IA-generative-les-promesses-de-Mistral-AI-netaient-pas-que-du-vent\">modèle Mistral AI</a>.</p>\n <p>Cette politique de souveraineté numérique doit s’étendre aux autres produits IA de France&nbsp;Travail, dont Match FT –&nbsp;l’application de matching entre offres et demandeurs en test sur deux régions (Centre-Val de Loire et Pays de la Loire).</p>\n <p>À destination des conseillers, l’outil doit simplifier la présélection des candidats à travers «&nbsp;une conversation guidée gérée par SMS par une intelligence artificielle générative.&nbsp;» En 5&nbsp;heures, un conseiller peut interroger 90&nbsp;% des demandeurs et recueillir une information précise.</p>\n <p>France&nbsp;Travail espère généraliser le déploiement de Match FT fin&nbsp;2025. Sylvain&nbsp;Poirier signale qu’un demandeur d’emploi conserve la possibilité de revenir à un processus classique. Samir Amellal ajoute par ailleurs que les projets, dont Match FT, sont soumis à la fois au comité éthique externe et aux organisations du personnel dans le cadre de la procédure habituelle du dialogue social. «&nbsp;Ce sont des passages systématiques lorsqu’il s’agit d’IA.&nbsp;» De plus, l’utilisation de ces outils n’est pas obligatoire.</p>\n <p>La mesure du KPI peut s’en trouver complexifiée, reconnaît le directeur adjoint de la Tech. Les premiers résultats de Match FT s’avéreraient malgré tout encourageants, en particulier avec la diminution du délai de pourvoi de deux jours. «&nbsp;C’est significatif, alors même que le produit n’est pas généralisé et que des optimisations restent à faire&nbsp;», se félicite le directeur IA.</p>\n <p>Avec Match FT et Chat FT, France&nbsp;Travail estime être en bonne voie sur l’IA. De quoi motiver d’autres initiatives, présentées durant VivaTech en juin dernier.</p>\n</section>        \n<section class=\"section main-article-chapter\" data-menu-title=\"Neo pour interagir avec le SI et poser des bases de l’agentique\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Neo pour interagir avec le SI et poser des bases de l’agentique</h2>\n <p>Exemple avec Neo, un produit qui permet de dialoguer en langage naturel avec le SI. Plutôt que de se connecter aux différents applicatifs métiers pour collecter des informations, le conseiller peut obtenir la donnée via une requête.</p>\n <p>Neo fonctionne grâce à des connexions API. En fonction des besoins, de nouvelles connexions sont ajoutées, indique France&nbsp;Travail au MagIT. Samir Amellal y voit une forme de réponse à la dette technique –&nbsp;des applications et interfaces «&nbsp;parfois vieillissantes&nbsp;» et donc complexes d’usage.</p>\n <p>Autre exemple, «&nbsp;Chat FT Écoute&nbsp;» est un démonstrateur qui doit être testé en agence. Il permet donc de collecter les informations demandées par l’applicatif lors des entretiens. Cette fois, France&nbsp;Travail y voit une solution qui renforce la posture d’écoute et facilite ensuite la saisie des données dans le SI.</p>\n <p>Les équipes IA de l’opérateur poursuivent également le développement de Qualif FT. Le démonstrateur avait été présenté lors de VivaTech&nbsp;2024. Il a quitté cette phase pour être intégré au site «&nbsp;Mes événements Emploi&nbsp;».</p>\n <p>Qualif FT remplace le classique moteur de recherche et ses filtres avec «&nbsp;une conversation d’idées&nbsp;» pour identifier des événements personnalisés. «&nbsp;On s’engage vers une simplification des services proposés et réduire la fracture numérique&nbsp;», considère Sylvain&nbsp;Poirier. Cela vaut aussi pour la prise en charge de la voix dans l’application mobile pour les jeunes –&nbsp;en test depuis fin juin.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Une stratégie hybride sur les LLM\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une stratégie hybride sur les LLM</h2>\n <p>En ce qui concerne les LLM, France&nbsp;Travail revendique une politique hybride, avec des modèles déployés sur un cloud dédié et d’autres consommés à l’extérieur. Les grands modèles ne peuvent pas être hébergés en interne.</p>\n <p>L’opérateur est client Azure, mais prévoit «&nbsp;de progresser&nbsp;» dans sa «&nbsp;stratégie de souveraineté&nbsp;» en déployant les LLM chez OVH.</p>\n <p>Dans une volonté de frugalité, France&nbsp;Travail souhaite aussi «&nbsp;pouvoir mobiliser le plus petit modèle pour le juste besoin&nbsp;». Les grands modèles dans le cloud OVH doivent ainsi être consommés «&nbsp;seulement lorsque c’est nécessaire.&nbsp;» Pour Neo, par exemple, c’est Mistral Small qui est appelé via une instance exécutée dans le datacenter interne.</p>\n <p>Neo est aussi considéré comme une étape sur <a href=\"https://www.lemagit.fr/ehandbook/Agents-IA-et-IA-agentique-le-guide-pour-tout-comprendre\">le chemin de l’IA agentique</a>. L’outil fait appel à de la détection d’intention «&nbsp;pour ensuite mobiliser l’appel au bon service, ou au bon agent, pour enfin générer une synthèse, et peut-être demain proposer une saisie des différents éléments dans le système d’information. Nous sommes en construction sur le volet d’IA agentique&nbsp;», argumente-t-il...</p>\n</section>",
      "published_ts": 1762512900,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634276/Competition-sportive-la-F1-en-tete-des-infrastructures-de-pointe",
      "title": "Compétition sportive : la F1 en tête des infrastructures de pointe",
      "summary": "<p>Plus de 800&nbsp;millions. Tel est le nombre de fans qui suivent régulièrement le Championnat du monde de Formule&nbsp;1 tout au long des 24&nbsp;courses de la saison&nbsp;2025. La formule 1 est le sport <a href=\"https://www.lemagit.fr/etude/Infrastructures-Aston-Martin-F1-analyse-a-toute-allure-ses-courses\">le plus technologique au monde</a>. Dans ces conditions, il apparaît normal que les grandes entreprises de l’IT aient accaparé la discipline. Parmi eux, <a href=\"https://www.lemagit.fr/actualites/366622497/Datacenters-Lenovo-lance-des-solutions-dappoint-pour-lIA\">Lenovo</a> est devenu au début de l’année&nbsp;2025 «&nbsp;global Partner et Global Technology Partner&nbsp;» de l’organisateur Formula&nbsp;1 (filiale de Formula One Group), soit le plus haut niveau d’accréditation que délivre la société responsable de la compétition. Ajoutons que sa marque Motorola est également devenue partenaire de référence pour les smartphones déployés sur l’asphalte.</p> \n<p>Pour Chris&nbsp;Roberts, directeur informatique de Formula&nbsp;1 (en photo en haut de cet article), l’infrastructure IT de la compétition a ceci d’unique qu’elle est itinérante, critique et hyper connectée. «&nbsp;Je supervise un spectre très large&nbsp;: cybersécurité, systèmes d’entreprise, opérations de données clients, mais surtout l’environnement des opérations de course. C’est la partie la plus excitante&nbsp;: <a href=\"https://www.lemagit.fr/actualites/366613933/Avant-premiere-Lenovo-aura-des-serveurs-tres-performants-tres-denses\">l’infrastructure réseau et serveur</a> qui relie chaque circuit au centre de diffusion et soutient toutes les opérations en direct. En clair, tout ce qui permet aux voitures de tourner, aux données de circuler et aux images d’arriver chez les téléspectateurs&nbsp;», raconte-t-il.</p> \n<p>L’architecture se décompose en deux parties distinctes. Au sein de Formula&nbsp;1, deux acronymes structurent tout&nbsp;: ETC (Event Technical&nbsp;Centre), côté piste, et MnTC (Media &amp; Technology Centre), au Royaume-Uni.</p> \n<p>«&nbsp;L’ETC collecte les flux&nbsp;: caméras embarquées, statiques, drones, RF, données de télémétrie, chronométrage… Tout converge vers cette plateforme&nbsp;», détaille le directeur informatique en expliquant que les équipements IT de Lenovo jouent un rôle central. «&nbsp;Tout notre environnement virtualisé fonctionne sur du matériel Lenovo. Les systèmes de chronométrage, par exemple, tournent sur leurs serveurs, avec une redondance totale.&nbsp;».</p> \n<p>Le MnTC, lui, est le cœur de la diffusion&nbsp;: plus de 35&nbsp;stations de montage, 160&nbsp;territoires, 60&nbsp;diffuseurs, 1,6&nbsp;milliard d’audiences cumulées. «&nbsp;Nous avons des producteurs, des réalisateurs, des équipes de replay et de graphisme ici (à Biggin Hill), qui supervisent la course en temps réel grâce à ces systèmes&nbsp;», dit Chris&nbsp;Roberts. C’est justement dans cet arrondissement au sud du grand Londres que LeMagIT a pu le rencontrer.</p> \n<blockquote class=\"main-article-pullquote\">\n <div class=\"main-article-pullquote-inner\">\n  <figure>\n   «&nbsp;Nous avons besoin d’une marque qui soit capable d’assurer le même support sur tous les appareils, et ce, sur cinq continents.&nbsp;»\n  </figure>\n  <figcaption>\n   <strong>Chris Roberts</strong>Directeur informatique, Formula 1\n  </figcaption>\n  <i class=\"icon\" data-icon=\"z\"></i>\n </div>\n</blockquote> \n<p>Le partenariat avec Lenovo, initié il y a quatre ans, n’est pas un simple contrat de sponsor. «&nbsp;Ce n’est pas un parrainage, c’est un partenariat technologique&nbsp;», argumente Lara Rodini, directrice des partenariats mondiaux de Lenovo. «&nbsp;Nous accompagnons Formula&nbsp;1 du traitement des données à la livraison du contenu, dans toutes les conditions climatiques et sur tous les continents&nbsp;», ajoute-t-elle.</p> \n<p>Pour Chris&nbsp;Roberts, ce partenariat répond à un double impératif&nbsp;: fiabilité et agilité. «&nbsp;Nous avons besoin d’une marque qui soit capable d’assurer le même support sur tous les appareils, et ce, sur cinq continents. Et nous devons être capables de déployer du matériel au bout du monde en 36 à 48&nbsp;heures, le brancher, le faire fonctionner et garantir qu’il tiendra la distance&nbsp;», dit-il, en précisant que Lenovo fournit tout (des tablettes, PC, serveurs, <a href=\"https://www.lemagit.fr/essentialguide/Informatique-en-Edge-quelles-infrastructures-pour-les-sites-distants\">NUC</a>, des écrans et même les téléphones).</p> \n<p>«&nbsp;Lenovo n’est pas venu nous vendre du matériel, mais comprendre nos défis. Ils ont travaillé avec nous pour concevoir des solutions adaptées à la Formule 1&nbsp;: quelle résilience, quel modèle de support, quelle redondance. C’est un vrai travail coopératif.&nbsp;», ajoute le directeur informatique.</p> \n<blockquote class=\"main-article-pullquote\">\n <div class=\"main-article-pullquote-inner\">\n  <figure>\n   «&nbsp;la consommation énergétique a chuté, et nous utilisons aussi le service de récupération d’actifs de Lenovo&nbsp;: 95&nbsp;% de notre matériel obsolète est réemployé ou recyclé.&nbsp;»\n  </figure>\n  <figcaption>\n   <strong>Amy Smith</strong>Head of IT Systems and Support, Formula 1\n  </figcaption>\n  <i class=\"icon\" data-icon=\"z\"></i>\n </div>\n</blockquote> \n<p>L’un des grands bénéfices du partenariat a été la réduction massive du matériel physique. «&nbsp;Nous sommes passés de trois racks de serveurs à un demi-rack&nbsp;», détaille Chris&nbsp;Roberts. «&nbsp;Grâce à un vaste processus de virtualisation, nous avons réduit d’environ 70&nbsp;% le volume transporté sur les circuits.&nbsp;». À la clé&nbsp;: moins d’énergie, moins de climatisation, moins de carbone.</p> \n<p>Sa collègue Amy Smith complète&nbsp;: «&nbsp;la consommation énergétique a chuté, et nous utilisons aussi le service de récupération d’actifs de Lenovo&nbsp;: 95&nbsp;% de notre matériel obsolète est réemployé ou recyclé.&nbsp;» <a href=\"https://www.lemagit.fr/tribune/Linformatique-durable-releve-dune-transformation-globale-des-pratiques\">La durabilité</a> passe aussi par la polyvalence. «&nbsp;Les portables Lenovo sont désormais assez puissants pour exécuter de la CAO. Avant, il fallait un PC fixe au bureau&nbsp;», poursuit M.&nbsp;Roberts. «&nbsp;Résultat&nbsp;: moins de machines, moins de fret, plus de flexibilité.&nbsp;»</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"De la pandémie à l’innovation\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>De la pandémie à l’innovation</h2>\n <p>Quand la crise du Covid a frappé en 2020, l’organisateur de la compétition de Formule 1 a dû tout repenser. «&nbsp;Nous avons compressé un programme de transformation de quatre ans en huit semaines&nbsp;», se souvient Chris&nbsp;Roberts. Passer à la diffusion à distance, virtualiser les systèmes, déplacer les équipes… «&nbsp;Nous étions le premier sport majeur à repartir en tournée, parce que nous avons osé prendre le risque.&nbsp;»</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Chaque application critique existe en plusieurs versions&nbsp;: principale, secours&nbsp;1, secours&nbsp;2, secours&nbsp;3. Si un système tombe, le suivant prend immédiatement le relais.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Chris Roberts</strong>Directeur informatique, Formula 1\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Une quinzaine d’ingénieurs logiciels développent et maintiennent 180&nbsp;logiciels sur mesure pour un total de plus de 4&nbsp;millions de lignes de code. «&nbsp;Chaque application critique existe en plusieurs versions&nbsp;: principale, secours&nbsp;1, secours&nbsp;2, secours&nbsp;3. Si un système tombe, le suivant prend immédiatement le relais.&nbsp;». Cette approche «&nbsp;multi-à-multi&nbsp;» garantit la résilience totale. «&nbsp;Nous pouvons retirer un disque à chaud sans interrompre le service. Tout est redondé, du matériel jusqu’aux communications.&nbsp;»</p>\n <p>Côté matériel, la plateforme de virtualisation de Lenovo exécute environ 270&nbsp;machines virtuelles sur 640&nbsp;cœurs&nbsp;x86, 5,9&nbsp;To de RAM et 105&nbsp;To de stockage flash. Des centaines d’écrans sont utilisés dans la régie de diffusion du MnTC. L’ETC et le MnTC transfèrent environ 600&nbsp;To de données par week-end d’événement, avec une bande passante atteignant un pic d’environ 8,5&nbsp;Gbit/s au début de chaque événement. Le bâtiment abrite de nombreuses salles de contrôle aux murs nimbés d’écrans, de consoles. Il y a même une salle de contrôle des contrôleurs, afin de s’assurer que les conditions de course soient respectées.</p>\n <p>L’ETC est la plus grande et la plus complexe installation transportable de ce type au monde. Une fois assemblée, elle occupe une surface de 25&nbsp;m sur 15&nbsp;m et abrite 750&nbsp;équipements exécutant plus de 40&nbsp;systèmes logiciels sur mesure. Durant un week-end de course, elle traite entre 350&nbsp;000 et 400&nbsp;000&nbsp;passages de transpondeurs de chronométrage, produit de 750 à 800&nbsp;pages de documents officiels et génère environ 300 à 400&nbsp;Go de données. La plateforme de virtualisation fournit la puissance de calcul nécessaire à ces opérations&nbsp;: 512 cœurs, 8,2&nbsp;To de RAM et 100&nbsp;To de stockage flash.</p>\n <p>Le lien entre technologie et diffusion est désormais très étroit. «&nbsp;L’ordinateur ne fait pas que générer un graphique, il comprend les données&nbsp;», souligne Amy Smith. Les équipes de production les transforment ensuite en <a href=\"https://www.lemagit.fr/actualites/366571453/Avec-Pulse-Tableau-combine-suivi-de-metriques-GenAI-et-Data-Storytelling\">storytelling visuel</a>&nbsp;: vitesse, pneus, énergie, radio-pilote…<br>«&nbsp;Nous devons traiter et diffuser ces données en quelques secondes pour que les fans profitent de la course en direct, sans délai. Plus l’image et la donnée arrivent vite, plus l’émotion est forte.&nbsp;»</p>\n <p>Pour Chris&nbsp;Roberts, ces technologies accompagnent une mutation du public. «&nbsp;En cinq ans, la démographie a basculé&nbsp;: 40&nbsp;% de nos fans ont moins de 35&nbsp;ans, et la proportion de femmes a explosé.&nbsp;» Les nouveaux outils numériques permettent de leur offrir une expérience immersive, où la donnée brute devient un récit visuel et sonore.</p>\n</section>        \n<section class=\"section main-article-chapter\" data-menu-title=\"Sécurité : l’air gap comme règle d’or\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Sécurité&nbsp;: l’air gap comme règle d’or</h2>\n <p>La cybersécurité, dans un environnement aussi visible que la F1, est une obsession. «&nbsp;Notre règle est simple&nbsp;: les systèmes d’exploitation de course ne se connectent jamais à Internet. Il y a un <i><a href=\"https://www.lemagit.fr/conseil/Levitement-et-sa-place-dans-la-gestion-du-risque\">air gap</a></i> complet&nbsp;», assure Chris&nbsp;Roberts, qui parle d’un isolement total, renforcé par un gel des changements à partir du mercredi précédant une course. «&nbsp;Dès que nous passons en mode course, tout est figé. Seules les urgences peuvent déclencher une modification.&nbsp;»</p>\n <p>Même la sécurité physique a été renforcée&nbsp;: contrôle des badges, accès segmentés, vérifications de sécurité hebdomadaires. «&nbsp;Mon collègue qui dirige la diffusion ne peut pas entrer dans la salle de calcul, et je ne peux pas entrer dans la sienne. Tout le monde reste dans son périmètre&nbsp;», précise le directeur informatique.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;L’objectif est d’explorer les cas d’usage IA dans la production et la diffusion.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Amy Smith</strong>Head of IT Systems and Support, Formula 1 \n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Depuis peu, la F1 expérimente les PC dotés d’accélérateurs d’intelligence artificielle, soit des ThinkPad&nbsp;X9 chez Lenovo. «&nbsp;En traitement de données, je vois un gain de productivité d’environ 30&nbsp;% par rapport à mon ancien poste. Et surtout, je peux voler jusqu’en Amérique du Nord sans recharger la batterie&nbsp;», se réjouit Chris&nbsp;Roberts. Mais au-delà du confort, c’est la vision à moyen terme qui l’intéresse&nbsp;: «&nbsp;nous déployons progressivement ces appareils pour préparer l’avenir. Dans 12 à 24&nbsp;mois, le logiciel sera au niveau des capacités matérielles et nous aurons ainsi déjà un parc de machines personnelles prêt pour exploiter l’IA embarquée.&nbsp;» Amy Smith confirme&nbsp;: «&nbsp;Nous venons de commander 25&nbsp;unités pour nos ingénieurs logiciels. L’objectif est d’explorer les cas d’usage IA dans la production et la diffusion.&nbsp;»</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Une boucle d’innovation continue\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une boucle d’innovation continue</h2>\n <p>Lenovo, de son côté, nourrit cette collaboration de retours d’expérience. «&nbsp;Nous avons une personne dédiée qui sert de pont entre Formula&nbsp;1 et nos laboratoires. Chaque retour terrain est analysé par nos centres R&amp;D, et intégré dans la conception des futurs produits&nbsp;», témoigne Lara Rodini. Pour Chris&nbsp;Roberts, cette réactivité est décisive&nbsp;: «&nbsp;nous sommes un client exigeant. Ce qui était acceptable il y a deux ans ne l’est plus aujourd’hui. Nous voulons toujours pousser les systèmes plus loin.&nbsp;»</p>\n <p>Ce partenariat est aussi une vitrine pour Lenovo. La marque y gagne en notoriété&nbsp;: +14&nbsp;% selon les études internes de Formula&nbsp;1, et une reconnaissance accrue comme «&nbsp;marque portable préférée des fans&nbsp;». Toutefois, cela va bien au-delà du marketing ou de la notoriété. «&nbsp;La F1 est un environnement extrême. Si une technologie fonctionne ici, elle fonctionnera partout. C’est un banc d’essai idéal pour les innovations&nbsp;», assure Lara Rodini.</p>\n <p>Depuis la bascule vers les opérations à distance, la F1 vit dans une logique d’itération continue. Les mises à jour s’enchaînent, souvent testées directement en production. «&nbsp;Et quand un besoin surgit –&nbsp;d’un diffuseur ou de l’équipe graphique&nbsp;–, nous devons fournir plus de calcul, plus de flexibilité, plus vite. Le tout sans jamais retarder la course. Je ne suis pas la NASA, je ne peux pas décaler une course au dimanche suivant&nbsp;», glisse Chris&nbsp;Roberts malicieusement.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Le futur : IA, cloud hybride et ultra-résilience\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Le futur&nbsp;: IA, cloud hybride et ultra-résilience</h2>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Ce ballet n’est possible que grâce à une coordination extrême et à une confiance absolue dans la technologie. La fiabilité rend tout cela possible. Nous n’avons pas le droit à l’erreur.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong> Chris Roberts</strong>Directeur informatique, Formula 1 \n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>La prochaine étape est de proposer une meilleure orchestration entre le cloud (<a href=\"https://www.lemagit.fr/actualites/252485197/Machine-Learning-du-rugby-a-la-Formule-1\">opéré par AWS</a>) et le site. Pour l’instant, les environnements sont séparés&nbsp;: «&nbsp;nous tenons à pouvoir les faire fonctionner indépendamment&nbsp;», explique Chris&nbsp;Roberts. «&nbsp;Si un outil de gestion unique tombait, nous perdrions le contrôle des deux côtés.&nbsp;». Mais la réflexion sur le modèle de consommation –&nbsp;<i>as-a-service</i>, cloud hybride, calcul élastique&nbsp;– est en cours.</p>\n <p>Quant à l’IA, elle ouvrira <a href=\"https://www.lemagit.fr/actualites/252485197/Machine-Learning-du-rugby-a-la-Formule-1\">une nouvelle ère</a>&nbsp;: analyse en temps réel, diagnostic prédictif, optimisation des flux et de la diffusion. «&nbsp;Nous faisons déjà des choses intéressantes, même si je ne peux pas encore en parler. Mais le potentiel est immense&nbsp;», affirme Chris&nbsp;Roberts. Il y voit une extension naturelle de la philosophie&nbsp;F1&nbsp;: repousser les limites sans jamais perdre la fiabilité.</p>\n <p>En écoutant Chris&nbsp;Roberts, on comprend que la F1 n’est plus seulement un sport, ni même une organisation technologique&nbsp;: c’est une usine mobile d’innovation permanente. «&nbsp;Chaque week-end, nous déployons une infrastructure mondiale. Chaque lundi, nous la rapatrions et nous recommençons ailleurs. Ce ballet n’est possible que grâce à une coordination extrême et à une confiance absolue dans la technologie. La fiabilité rend tout cela possible. Nous n’avons pas le droit à l’erreur.&nbsp;»</p>\n</section>",
      "published_ts": 1762511460,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634275/Lopen-source-comme-vecteur-de-souverainete-un-argument-discute",
      "title": "L’open source comme vecteur de souveraineté, un argument discuté",
      "summary": "<p>Lors de son événement Connect Paris, le 6&nbsp;novembre, Red Hat a défendu le fait que l’ensemble des solutions qu’ils proposent sont de nature open source. Cela garantirait aux clients et utilisateurs un grand contrôle en matière de réversibilité et souveraineté.</p> \n<p>«&nbsp;Par définition, le code open source n’appartient à personne, donc les lois extraterritoriales n’ont pas de prise sur lui&nbsp;», affirme Rémy&nbsp;Mandon, directeur France chez Red Hat.</p> \n<p>«&nbsp;Le code de nos solutions est ouvert, visible, auditable, c’est transparent […]. Nous interdisons la moindre propriété intellectuelle, ça casserait le modèle. Et nous n’avons pas du tout l’intention de le briser&nbsp;», insiste-t-il. «&nbsp;Il fonctionne plutôt bien et répond justement à ces problématiques de souveraineté&nbsp;».</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Souveraineté : les limites de l’argument open source\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Souveraineté&nbsp;: les limites de l’argument open source</h2>\n <p>Cet argument est sujet à débat chez les spécialistes.</p>\n <p>Alice&nbsp;Pannier, ex-directrice du programme des géopolitiques de la technologie à l’Institut français des relations internationales (Ifri), <a href=\"https://www.lemagit.fr/actualites/366626149/IA-La-CNCF-entrevoit-une-alternative-ouverte-a-CUDA-de-Nvidia\">écrivait en 2022&nbsp;</a>: «&nbsp;l’écosystème open source, est de plus en plus modelé <a href=\"https://www.lemagit.fr/tribune/De-la-necessaire-cartographie-des-dependances-technologiques-Ophelie-Coelho\">par les intérêts privés des Big Tech&nbsp;</a>». Des Big Tech, d’origine américaine assujettie aux lois de leur pays.</p>\n <p>Olesia Shmarakova, ancienne directrice des pratiques de protection de la propriété intellectuelle chez Gazprom, désormais doctorante en droit européen à l’université de Turin, affirme que l’open source contribue à l’érosion de la souveraineté.</p>\n <p>Ici, la chercheuse renvoie à la définition de la souveraineté telle qu’on la trouve dans les dictionnaires. Selon le Larousse, c’est un «&nbsp;pouvoir suprême reconnu à l’État, qui implique l’exclusivité de sa compétence sur le territoire national (souveraineté interne) et son indépendance absolue dans l’ordre international où il n’est limité que par ses propres engagements (souveraineté externe)&nbsp;».</p>\n <p>«&nbsp;L’on ne peut nier que les logiciels libres contribuent à l’érosion de la souveraineté de l’État, car de facto des ensembles entiers de transactions liées au développement, à la distribution et à l’utilisation des logiciels libres échappent à la sphère de son contrôle&nbsp;», <a href=\"https://ojs.unito.it/index.php/JLMI/article/view/7438\">notait</a> Olesia Shmarakova en 2023.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Souveraineté numérique : des définitions variables selon les acteurs\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Souveraineté numérique&nbsp;: des définitions variables selon les acteurs</h2>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;La législation américaine introduit une exception à l’exception, définissant les conditions dans lesquelles les logiciels libres resteraient soumis au contrôle des exportations et aux sanctions.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Olesia Shmarakova</strong>Doctorante en droit européen à l’université de Turin\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Cela n’empêche pas des pays comme les États-Unis de tenter de légiférer sur l’open source. «&nbsp;Les législations européenne et américaine exemptent les logiciels libres de sanctions. Toutefois, la législation américaine introduit une exception à l’exception, définissant les conditions dans lesquelles les logiciels libres resteraient soumis au contrôle des exportations et aux sanctions. Il s’agit d’un modèle juridique complexe, basé en grande partie sur des détails techniques […]&nbsp;», écrit-elle.</p>\n <p>Et de rappeler que les sites Web permettant d’accéder au code source (ceux de la Linux Foundation, GitHub, Apache, etc.) tombent sous le coup de la législation américaine. Alors même que la Linux Foundation défend le fait que l’open source est un <a href=\"https://www.lemagit.fr/actualites/366630169/Lopen-source-un-levier-strategique-pour-la-souverainete-numerique-Linux-Foundation\">« levier stratégique pour la souveraineté numérique »</a>.</p>\n <p>Cette notion de souveraineté numérique, beaucoup plus floue, permet aux différents acteurs de distinguer des degrés de souveraineté. «&nbsp;Il est important de noter que la définition de la souveraineté varie selon les secteurs et les cas d’usage en Europe&nbsp;», indiquait un porte-parole d’AWS au moment du lancement de son offre AWS EU Sovereign Cloud.</p>\n <p>La direction générale des services numériques de la Commission européenne a apporté de l’eau à ce moulin en présentant un framework pour <a href=\"https://www.lemagit.fr/actualites/366633510/Cloud-souverain-la-Commission-europeenne-publie-une-grille-de-lecture-controversee\">guider la commande publique en matière de cloud souverain</a>.</p>\n <p>Il distingue huit objectifs de souveraineté numérique, de SOV-1 à SOV-8. Il les associe à un score obtenu par une moyenne pondérée. Un principe qui a crispé certains acteurs représentés par l’association CISPE.</p>\n <p>«&nbsp;Les deux principaux objectifs –&nbsp;SOV&nbsp;1 et SOV&nbsp;2&nbsp;– sont la souveraineté stratégique, ainsi que la souveraineté juridique&nbsp;», indique un porte-parole de SUSE à propos de son offre de support dite souveraine. «&nbsp;L’UE et de nombreux clients de SUSE accordent une importance majeure à ces deux éléments&nbsp;».</p>\n <p>Selon les propos de Rémy&nbsp;Mandon, Red Hat serait attentif à l’objectif de souveraineté technologique (SOV-6). Il «&nbsp;évalue le degré d’ouverture, de transparence et d’indépendance de la pile technologique sous-jacente, afin que les acteurs de l’UE puissent interopérer, auditer et faire évoluer les solutions sans être enfermés dans des systèmes propriétaires étrangers&nbsp;».</p>\n <p>Dans <a href=\"https://www.lemagit.fr/actualites/366634273/Red-Hat-presente-son-support-souverain-dedie-a-lUnion-europeenne\">le cas spécifique des solutions commerciales</a> de Red Hat, Remy&nbsp;Mandon signale que l’affiliation à la législation américaine est claire. Si le code est libre, l’entreprise et ses services restent américains.</p>\n</section>",
      "published_ts": 1762511400,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545903-pourquoi-confier-la-fonction-de-dpo-a-un-avocat/",
      "title": "Pourquoi confier la fonction de DPO à un avocat ?",
      "summary": "Le DPO avocat : expertise RGPD, indépendance, secret professionnel et vision 360° des nouveaux défis numériques, de l'IA à la cybersécurité.",
      "published_ts": 1762511127,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/doctolib-condamnee-a-46-millions-deuros-pour-abus-de-position-dominante/",
      "title": "Doctolib condamnée à 4,6 millions d’euros pour abus de position dominante",
      "summary": "C’est un véritable coup de tonnerre pour l’une des plus grandes réussites de la French Tech. En effet, Doctolib, qui a communiqué ces derniers jours sur ses projets autour de l’IA, a été reconnue coupable d’avoir verrouillé le marché des rendez-vous médicaux et de la téléconsultation, au détriment de ses concurrents. Une amende de 4,6 […]",
      "published_ts": 1762511112,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/souverainete-numerique-decouvrez-les-80-startups-selectionnees-par-la-french-tech-2030/",
      "title": "Souveraineté numérique : découvrez les 80 startups sélectionnées par la French Tech 2030",
      "summary": "La Mission French Tech vient de lever le voile sur la deuxième promotion de son programme French Tech 2030, et deux ans après une première édition marquée par l’émergence de startups comme Mistral AI ou Alice & Bob, 80 nouvelles jeunes pousses rejoignent cette initiative portée par l’État. Avec cette nouvelle génération de start-ups, que […]",
      "published_ts": 1762510879,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://siecledigital.fr/2025/11/07/yousign-devient-youtrust-pour-renforcer-la-confiance-face-a-la-fraude-numerique/",
      "title": "Yousign devient Youtrust pour renforcer la confiance face à la fraude numérique",
      "summary": "Après plus de dix ans passés à simplifier la signature électronique pour les entreprises européennes, Yousign s’apprête à tourner une nouvelle page de son histoire. Comme annoncé sur son site, dès 2026, la société fondée en 2013 adoptera un nouveau nom : Youtrust. Un changement symbolique qui accompagne une transformation bien plus profonde, celle du […]",
      "published_ts": 1762510848,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634273/Red-Hat-presente-son-support-souverain-dedie-a-lUnion-europeenne",
      "title": "Red Hat présente son support « souverain » dédié à l’Union européenne",
      "summary": "<p>En marge de son Red Hat Connect à Paris, la filiale d’IBM a annoncé Confirmed Sovereign Support. Une offre qui sera disponible au début de l’année&nbsp;2026.</p> \n<p>Comme le nom le laisse entendre, il s’agit pour Red Hat de constituer une équipe de support dédiée, composée exclusivement de citoyens de l’Union européenne. Ceux-là doivent être habilités pour traiter les demandes des clients se trouvant dans les 27&nbsp;états membres de l’UE.</p> \n<p>La filiale d’IBM n’a pas souhaité indiquer le nombre d’ingénieurs mobilisés dans le cadre de cette offre. «&nbsp;Nous n’indiquons jamais le nombre d’employés travaillant sur des produits spécifiques&nbsp;», souligne un porte-parole de Red Hat auprès du MagIT.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"En France, Red Hat cible les OIV\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>En France, Red Hat cible les OIV</h2>\n <p>De son côté, Rémy Mandon, directeur France chez Red Hat, imagine que l’entreprise composera d’abord une «&nbsp;équipe de taille moyenne&nbsp;le temps de voir si les clients sont intéressés&nbsp;». Et d’ajouter que l’éditeur dispose de personnels de support en République tchèque, mais aussi en France, en Allemagne et d’autres pays de l’UE.</p>\n <p>Confirmed Sovereign Support couvre l’ensemble des licences supportées par Red Hat. Il s’agit d’offrir un niveau de support équivalent à ce qu’il propose déjà aujourd’hui (24/7). Il sera à la fois un service disponible directement par les clients on premise, et à travers les quelques 500&nbsp;partenaires de la société en Europe, dont les fournisseurs de cloud locaux.</p>\n <p>Une solution qui intéressait déjà des entreprises et des organisations en France, selon Rémy Mandon, directeur France chez Red Hat. &nbsp;</p>\n <p>«&nbsp;Un certain nombre d’OIV avec lesquels j’ai discuté aujourd’hui [le 6&nbsp;novembre N.D.L.R] sont intéressés parce qu’ils gèrent des données sensibles&nbsp;: classifiées, secrètes, très secrètes, parfois avec la mention Spécial France&nbsp;», relate-t-il.</p>\n <p>«&nbsp;En Europe,&nbsp;je pense que les demandes viendront principalement des complexes militaro-industriels, des ministères régaliens et des OIV&nbsp;», ajoute-t-il.</p>\n <p>Sur le territoire qui concerne le dirigeant, l’offre s’arrête aux frontières de la mention «&nbsp;Spécial France&nbsp;».</p>\n <p>«&nbsp;La mention Spécial France (SF), adossée au niveau de classification des ISC, exclut du contrat toute entreprise de droit étranger ou toute personne physique étrangère (à l’exception des binationaux)&nbsp;», indique le ministère des Armées sur son site Web.</p>\n <p>Cette mention est habituellement appliquée pour certaines données secrets défense liées aux sujets militaires et nucléaires.</p>\n <p>Selon Remy Mandon, les intégrateurs comme Sopra Steria, Capgemini ou Atos disposent du personnel qualifié et habilité pour répondre aux requêtes impliquant les données les plus sensibles.</p>\n <p>«&nbsp;La plupart des clients concernés sont “on-premise” pour des raisons de localisation de données&nbsp;», ajoute-t-il. «&nbsp;En revanche, nous pouvons tout à fait proposer ce support à des fournisseurs de cloud régionaux, par exemple à Bleu, S3NS, <a href=\"https://www.lemagit.fr/actualites/366625701/SecNumCloud-32-Cloud-Temple-etend-le-perimetre-de-son-cloud-de-confiance\">Cloud Temple,</a> <a href=\"https://www.lemagit.fr/actualites/366622357/NumSpot-les-fondations-de-la-PaaS-souveraine-sont-disponibles\">NumSpot&nbsp;».</a></p>\n <p>Ici, les équipes européennes habilitées interviendraient sur le support de niveau&nbsp;2. Quand le problème dépasse les compétences des équipes des clouds souverains.</p>\n <p>Red Hat doit encore définir les contours de son offre, notamment le modèle tarifaire. «&nbsp;Ce sera une offre “premium”&nbsp;», indique Rémy Mandon. «&nbsp;Nous sommes en train de finaliser la tarification pour prendre en compte le fait que nous faisons intervenir du personnel 100&nbsp;% européen, payé en fonction des grilles de salaires européennes. L’objectif, c’est d’ouvrir le service au cours du mois de janvier&nbsp;».</p>\n <p>Red Hat doit aussi s’assurer que les données liées au support demeurent sur des infrastructures européennes. Pourtant, il serait plus juste de parler de localisation des données en Europe.</p>\n <p>«&nbsp;Les données téléchargées par les clients sont stockées sur des infrastructures et des instances en cloud basées dans l’UE&nbsp;», précise un porte-parole de Red Hat en réponse à une question du MagIT. «&nbsp;Les données relatives aux incidents (fichiers de log, rapports de sécurité, etc.) sont conservées dans un bucket AWS&nbsp;S3 fonctionnant sur <a href=\"https://www.lemagit.fr/actualites/366625514/European-Sovereign-Cloud-AWS-persiste-et-signe\">AWS European Sovereign Cloud,</a> ce qui permet à ces fichiers de résider dans l’UE&nbsp;».</p>\n <p>Le fournisseur assure qu’il sera possible de pousser ces données vers la landing zone dans AWS EU Sovereign Cloud depuis une passerelle de cloud hybride. De même, les données seront chiffrées si nécessaire. Et Red Hat de laisser entendre qu’elle peut appliquer des techniques d’informatique confidentielle pour assurer un contrôle supplémentaire lors du traitement de ces données. Elle n’explique toutefois pas les techniques qu’elles comptent utiliser. C’est toutefois un gage supplémentaire de protection puisque le root of trust sera probablement issu du contrôleur Nitro d’AWS installé spécifiquement pour EU Sovereign cloud. L’isolation est principalement technique, moins légale.</p>\n</section>                \n<section class=\"section main-article-chapter\" data-menu-title=\"Un type de support apprécié en Europe, selon SUSE\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Un type de support apprécié en Europe, selon SUSE</h2>\n <p>Red Hat n’est pas le premier offreur de solutions basées sur des projets open source à proposer un support dit souverain. SUSE a lancé en juillet Sovereign Premium Support pour couvrir ses distributions commerciales <a href=\"https://www.lemagit.fr/actualites/366626521/Suse-Notre-strategie-Ne-surtout-pas-chercher-a-remplacer-VMwarehttps:/www.lemagit.fr/actualites/366626521/Suse-Notre-strategie-Ne-surtout-pas-chercher-a-remplacer-VMware\">SUSE Linux Enterprise, Rancher, etc</a>. Là encore, le personnel est européen et les données sont chiffrées, transitées et stockées sur des serveurs situés en Europe.</p>\n <p>«&nbsp;Tous nos autres plateformes et systèmes associés, tels que Data Storage, Ziu, Solid Ground, Bugzilla et Jira, sont hébergés sur site dans nos centres de données européens, sans réplication ni sauvegarde vers des infrastructures basées aux États-Unis&nbsp;», précise un porte-parole de SUSE auprès du MagIT. «&nbsp;Le portail client de SUSE fonctionne sur Salesforce <a href=\"https://www.lemagit.fr/tribune/Salesforce-Hyperforce-et-la-residentialite-des-donnees-entretien\">Hyperforce European Union Operating Zone</a>, garantissant la conformité avec les exigences strictes de résidence des données de l’Union européenne&nbsp;».</p>\n <p>Et SUSE d’ajouter que le support de niveau&nbsp;3 peut requérir l’intervention d’ingénieurs hors UE. «&nbsp;Des protocoles stricts de masquage des données sont appliqués, avec l’accord préalable du client&nbsp;», indique-t-il.</p>\n <p>«&nbsp;L’accueil est extrêmement positif de la part de nos clients existants ainsi que de nos prospects et partenaires, car il répond à une demande forte du marché&nbsp;», explique Imran Khan, Chief Customer Officer de SUSE, dans un mail envoyé au MagIT. «&nbsp;Nous sommes en phase de finalisation sur les premiers contrats de ce type&nbsp;».</p>\n <p>Sur le papier, contrairement à Red Hat, SUSE n’est pas autant exposé aux lois extraterritoriales américaines. Le fournisseur d’origine allemande appartient à EQT Partners, un fonds d’investissement basé&nbsp;aux Pays-Bas.</p>\n <p>Pour mémoire, ces offres de support localisé ont d’abord vu le jour chez les fournisseurs de cloud, <a href=\"https://www.lemagit.fr/actualites/366623490/Ces-doutes-qui-planent-autour-des-engagements-europeens-de-Microsoft\">dont Microsoft Azure</a>, AWS, Oracle ou Google Cloud. D’autres ont suivi, comme Salesforce.</p>\n</section>",
      "published_ts": 1762507080,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/galaxy-a17-samsung-injecte-de-lia-dans-son-nouveau-smartphone-dentree-de-gamme-484613.htm#xtor=RSS-1",
      "title": "Galaxy A17 : Samsung injecte de l'IA dans son nouveau smartphone d'entrée de gamme",
      "summary": "Samsung a officialisé, ce 7 novembre, le lancement du Galaxy A17, un smartphone pensé pour offrir l’essentiel à prix accessible, sans renoncer aux dernières innovations de la marque, notamment en matière d’intelligence artificielle.",
      "published_ts": 1762506702,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/cybersecurite/1545879-l-essor-de-l-informatique-quantique-de-la-science-fiction-au-cauchemar/",
      "title": "L'essor de l'informatique quantique : de la science-fiction au cauchemar ?",
      "summary": "L'informatique quantique progresse et menace la cybersécurité. La France investit dans Lucy et la cryptographie post-quantique pour protéger données et systèmes.",
      "published_ts": 1762506167,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/business/action-publique/1545917-budget-secu-2026-les-deputes-modifient-en-profondeur-le-texte-a-l-assemblee/",
      "title": "Budget Sécu 2026 : les députés modifient en profondeur le texte à l'Assemblée",
      "summary": "CSG, mutuelles, C3S, tickets-restaurant… L'Assemblée nationale a adopté plusieurs amendements majeurs modifiant l'équilibre fiscal et social du budget 2026 de la Sécurité",
      "published_ts": 1762500240,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/google-repere-les-malware-qui-se-transforment-en-cours-dattaque-grace-a-lia-484646.htm#xtor=RSS-1",
      "title": "Google repère les malware qui se transforment en cours d'attaque, grâce à l'IA",
      "summary": "Les cyberattaquants ne se contentent plus d'utiliser l'IA pour peaufiner leurs courriels d'hameçonnage.",
      "published_ts": 1762492300,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/la-filiere-nucleaire-dispose-desormais-de-son-data-space-data4nuclearx-484634.htm#xtor=RSS-1",
      "title": "La filière nucléaire dispose désormais de son Data Space Data4NuclearX",
      "summary": "6 acteurs du nucléaire et du numérique (EDF, CEA, Dawex, GIFEN, l’Institut Mines-Télécom et Sopra Steria) créent un espace numérique d’échange de données, un Data Space intitulé Data4NuclearX. Le déploiement est prévu pour 2028.",
      "published_ts": 1762492280,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634217/Anthropic-ouvre-son-premier-bureau-francais-pour-mieux-cibler-lEurope-du-Sud",
      "title": "Anthropic ouvre son premier bureau français pour mieux cibler l’Europe du Sud",
      "summary": "<p><b>Anthropic ouvre un bureau à Paris</b>. Cette arrivée en France –&nbsp;simultanée avec l’inauguration d’un autre bureau en Allemagne&nbsp;– marque une étape dans son développement européen.</p> \n<p>Dans la région EMEA, la demande serait en effet particulièrement forte. L’éditeur de l’IA Claude affirme que son chiffre d’affaires y aurait été multiplié par neuf en un an. Une dynamique qui n’est pas sans rappeler <a href=\"https://www.lemagit.fr/actualites/366634067/OpenAI-depasse-la-barre-du-million-dentreprises-clientes\">celle de son grand concurrent</a>, OpenAI. D’où la décision d’être plus présents physiquement sur ces marchés locaux.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Une direction européenne à Paris\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une direction européenne à Paris</h2>\n <p>Le bureau parisien accueille d’ores et déjà plusieurs dirigeants.</p>\n <p>Guillaume Princen, ancien de Stripe et de Meta, y occupe désormais le poste de directeur des start-ups, ETI et acteurs du numérique pour la zone EMEA. Thomas&nbsp;Remy, ex-cadre de Google Cloud, a pour sa part été nommé directeur EMEA Sud, chargé de la France, de l’Italie, de la péninsule ibérique, du Moyen-Orient et de l’Afrique.</p>\n <p>L’Europe du Nord sera supervisée depuis Londres par une nouvelle responsable, Pip White, une ex de Google et de Salesforce. Un «&nbsp;head of DACH &amp; Central and Eastern Europe&nbsp;» sera également nommé et basé à Munich.</p>\n <p>Pour Anthropic, toutes ces nominations doivent accompagner la croissance de la région –&nbsp;«&nbsp;la plus dynamique&nbsp;»&nbsp;– où le nombre de grands comptes clients qui génèrent des revenus de plus de 100&nbsp;000&nbsp;dollars aurait été multiplié par dix en douze mois.</p>\n <p>La France ferait partie des vingt premiers pays utilisateurs de Claude par habitant. Des entreprises comme L’Oréal, Sanofi, Pigment, Dust ou Doctolib utiliseraient déjà l’assistant conversationnel Claude dans leurs activités.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Anthropic, l’IA générative à la réputation très sérieuse\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Anthropic, l’IA générative à la réputation très sérieuse</h2>\n <p>À l’occasion de cette arrivée en France, Emmanuel&nbsp;Frenehard, directeur du digital de Sanofi, a témoigné sur sa collaboration avec Anthropic. Pour lui, <a href=\"https://www.lemagit.fr/actualites/366632031/Claude-45-plus-quun-LLM-Anthropic-presente-un-arsenal-doutils-dedies-a-lIA-agentique\">Claude et ses outils connexes</a> permettent de «&nbsp;développer de manière responsable pour les patients&nbsp;».</p>\n <p>Sur le marché, Claude et Anthropic ont, de fait, une réputation de sérieux, de sécurité et de relative prudence (comparée à certains de ses concurrents). Sa priorité va à la robustesse de ses produits, quitte à prendre le temps de les sortir, plutôt qu’à l’innovation effrénée avec des solutions parfois «&nbsp;mi-cuites&nbsp;» –&nbsp;comme disent les anglo-saxons («&nbsp;à moitié prêtes&nbsp;»).</p>\n</section>   \n<section class=\"section main-article-chapter\" data-menu-title=\"Une offre localisée et des engagements de conformité\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une offre localisée et des engagements de conformité</h2>\n <p>Anthropic promet qu’il proposera une version de Claude «&nbsp;localisée&nbsp;» en français. Comprendre&nbsp;: un «&nbsp;Claude qui comprend les nuances culturelles, les exigences réglementaires et les styles de communication français&nbsp;».</p>\n <p>L’hébergement des données en local sera également possible, mais via ses partenariats AWS et Google Cloud.</p>\n <p>Autre promesse, Anthropic prévoit de recruter pour son bureau parisien, dans un contexte où ses effectifs EMEA (à Londres, Dublin et Zurich) auraient triplé. Le nombre de postes qui seront à pourvoir n’est en revanche pas précisé.</p>\n <p>Dans le monde, l’éditeur a également créé des bureaux à Tokyo, Séoul et Bangalore.</p>\n <p>Hasard du calendrier, il y a un an quasiment jour pour jour, c’est OpenAI qui <a href=\"https://www.lemagit.fr/actualites/366615974/Larrivee-dOpenAI-en-France-une-operation-dinfluence\">posait ses premières valises à Paris avec la bénédiction du gouvernement</a>.</p>\n <p></p>\n</section>",
      "published_ts": 1762491960,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634254/De-la-e-signature-a-la-confiance-digitale-Yousign-change-didentite-pour-marquer-sa-diversific",
      "title": "De la e-signature à la « confiance digitale », Yousign change de nom pour marquer sa diversification",
      "summary": "<p><b>C’était il y a dix ans, à Caen</b>. Une petite startup, Yousign, se lançait dans la signature électronique. Depuis, l’entreprise qui a grandi a réussi à se faire une place, face à DocuSign ou Adobe, et à trouver son segment de marché (les PME). <a href=\"https://www.lemagit.fr/actualites/252504319/e-signature-Yousign-a-la-conquete-de-lEurope-des-PME\">Elle s’est même prise à rêver d’international</a>,&nbsp;chose assez rare dans l’IT française comme <a href=\"https://numeum.fr/economie-marche/panorama-top-250-des-editeurs-de-logiciels-francais-15eme-edition-lia-entre-au-coeur-du-modele-des-editeurs-francais/\">le rappelle</a> régulièrement Numeum. Exception ou non, aujourd’hui, YouSign revendique plus de 30&nbsp;000&nbsp;entreprises clientes en Europe. Et l’entreprise voit, à nouveau, plus grand pour se développer.</p> \n<p>Finie la seule signature électronique. Yousign cible désormais plus largement la «&nbsp;confiance digitale&nbsp;». Pour bien marque cette évolution, l’entreprise a également décidé de changer de nom et de se rebaptiser «&nbsp;Youtrust&nbsp;».</p> \n<p>Youtrust, donc, se présente désormais comme, je cite, «&nbsp;une plateforme souveraine de confiance numérique, capable de couvrir l’ensemble des parcours digitaux critiques&nbsp;».</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Répondre à la montée des risques et aux exigences réglementaires\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Répondre à la montée des risques et aux exigences réglementaires</h2>\n <p>Ce repositionnement s’inscrit dans un contexte de digitalisation des processus métiers. Celle-ci a favorisé la productivité, certes, mais aussi les menaces.</p>\n <p>Selon une étude Ipsos menée pour Yousign, un salarié européen sur cinq aurait déjà été <a href=\"https://www.lemagit.fr/actualites/366626050/Avec-lIA-generative-la-falsification-de-documents-explose\">confronté à un document falsifié</a>, et 16&nbsp;% des entreprises auraient subi des pertes financières liées à ces falsifications.</p>\n <p>Dans le même temps, les régulations européennes se renforcent –&nbsp;notamment eIDAS&nbsp;2.0, les directives anti-blanchiment et le futur portefeuille d’identité numérique&nbsp;–, imposant des solutions à la fois souveraines, conformes et capables de sécuriser chaque étape des transactions électroniques.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"De la signature à la confiance numérique complète\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>De la signature à la confiance numérique complète</h2>\n <p>C’est pour coller à cette évolution que Yousign/Youtrust fait évoluer son offre.</p>\n <p>Concrètement, sa «&nbsp;plateforme unifiée de confiance digitale&nbsp;» réunit plusieurs composantes complémentaires. Aux côtés de la signature électronique –&nbsp;simple, avancée ou qualifiée&nbsp;– figurent désormais des services de vérification d’identité, de documents et de comptes bancaires regroupés sous l’appellation Verify, <a href=\"https://www.lemagit.fr/actualites/366619975/Facturation-electronique-Yousign-lance-des-solutions-pour-renforcer-la-securite-et-la-conformite\">ainsi qu’un cachet électronique</a> (eSeal) destiné à garantir l’authenticité et l’intégrité des documents.</p>\n <p>Ces différentes briques peuvent fonctionner de manière autonome ou être combinées dans des parcours sectoriels tout-en-un, adaptés aux spécificités de métiers comme les ressources humaines, la finance, l’immobilier, la santé ou le conseil juridique.</p>\n <p>Yousign souligne que ces parcours –&nbsp;qui seront de plus en plus renforcés par des capacités d’intelligence artificielle&nbsp;– visent à automatiser les contrôles, assurer la conformité réglementaire et fluidifier les échanges.</p>\n <p>Dans un second temps, l’éditeur caennais prévoit de verticaliser sa gamme de produits, en priorité pour les secteurs les plus réglementés (assurance, notariat, santé, finance).</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Une ambition européenne confirmée\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une ambition européenne confirmée</h2>\n <p>Ambitieuse, l’entreprise normande se fixe comme objectif de devenir le référent européen de la confiance digitale (tout en restant souveraine et indépendante).</p>\n <p>Elle est déjà implantée en Allemagne, en Espagne, en Italie, au Royaume-Uni et au Benelux.</p>\n <p>«&nbsp;Nous faisons évoluer Yousign d’un spécialiste de la signature électronique à une plateforme européenne de confiance digitale&nbsp;», confirme Alban&nbsp;Sayag, CEO de Yousign/Youtrust. «&nbsp;Notre vision est de bâtir un monde des affaires numériques où l’intégrité est automatique&nbsp;», ajoute-t-il.</p>\n <p>En 2028, l’éditeur prévoit de réaliser un tiers de son chiffre d’affaires à l’international.</p>\n</section>",
      "published_ts": 1762487700,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://blog.cloudflare.com/async-quic-and-http-3-made-easy-tokio-quiche-is-now-open-source/",
      "title": "Async QUIC and HTTP/3 made easy: tokio-quiche is now open-source",
      "summary": "We’re excited to announce the open sourcing of tokio-quiche, our async QUIC library built on quiche and tokio. Relied upon in our services such as iCloud Private Relay and our next-generation Oxy-based proxies, tokio-quiche handles millions of HTTP/3 requests per second with low latency and high throughput.",
      "published_ts": 1762437600,
      "source_name": "Cloudflare Engineering Blog"
    },
    {
      "url": "https://www.lemagit.fr/conseil/La-detection-et-la-reponse-dans-le-navigateur-comblent-de-relles-lacunes",
      "title": "La détection et la réponse aux menaces dans le navigateur comblent de réelles lacunes",
      "summary": "<p>Les logiciels de détection et de réponse ciblées sont devenus un élément essentiel de la sécurité des systèmes d’information. Ces derniers temps, il semble que pour chaque technologie utilisée par une organisation, il existe un outil de détection et de réponse dédié pour la sécuriser –&nbsp;comme la détection et la réponse du réseau (<a href=\"https://www.lemagit.fr/definition/Quest-ce-que-la-detection-et-reponse-dans-le-reseau-NDR\">NDR</a>), la détection et la réponse sur le terminal (<a href=\"https://www.lemagit.fr/definition/EDR-Endpoint-Detection-and-Response\">EDR</a>), la détection et la réponse des données, la détection et la réponse étendue (XDR) et bien d’autres encore.</p> \n<p>L’outil le plus récent à entrer en scène est la détection et la réponse dans le navigateur <em>(Browser Dectection and Response</em>, ou BDR).</p> \n<p>En bref, la BDR permet aux navigateurs de détecter, d’étudier et de répondre aux menaces qui proviennent d’eux, ou qui les traversent. La BDR s’attaque à un angle mort de plus en plus important. Les agents traditionnels pour les terminaux et les contrôles réseau passent souvent à côté des attaques sophistiquées basées sur le web, telles que le détournement de formulaires, les extensions malveillantes, le vol d’informations d’identification via des scripts injectés, le <a href=\"https://www.lemagit.fr/definition/Phishing\"><em>phishing</em></a> qui s’exécute dans le navigateur, les compromissions de la chaîne d’approvisionnement sur des JavaScript tiers et l’exfiltration de données orchestrée par des applications web ou des interfaces de discussion AI.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Comment fonctionne la BDR\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Comment fonctionne la BDR</h2>\n <p>La BDR place la logique de détection aussi près que possible du point d’interaction&nbsp;: le navigateur, qui tend aujourd’hui à servir de client principal pour les applications cloud, le webmail, le SaaS et les services tiers de la plupart des utilisateurs. La BDR capture la télémétrie et applique les contrôles là où les attaquants opèrent, réduisant ainsi le temps de détection et permettant un confinement plus rapide et plus précis.</p>\n <p>Le logiciel de BDR est généralement déployé de trois manières&nbsp;: en tant qu’extension de navigateur managée, en tant qu’agent de navigateur léger ou par l’intermédiaire d’une session de navigateur avec courtier, c’est-à-dire en isolant le navigateur à distance. Il recueille des données télémétriques, notamment les URL visitées, les modifications du modèle d’objet du document, les arbres d’exécution des scripts, les soumissions de formulaires, les opérations du presse-papiers, les téléchargements de fichiers et l’activité de l’extension. Ces données sont ensuite mises en corrélation avec l’identité de l’utilisateur, la localisation de l’appareil et le contexte de l’application cloud.</p>\n <p>Les profils de détection s’appuient sur des habitudes comportementales, des scores d’anomalie et des indicateurs de compromission, tels que des <em>iframes</em> injectés, des requêtes XMLHttp inattendues vers des domaines inhabituels et des modèles de collecte d’informations d’identification. Les réponses vont des avertissements dans le navigateur et du blocage des actions risquées –&nbsp;parmi lesquelles le téléchargement de fichiers et le collage de secrets&nbsp;–, à l’interruption automatique de la session, à la ré-authentification forcée ou au déclenchement de playbooks à partir de plateformes EDR et <a href=\"https://www.lemagit.fr/definition/SOAR\">SOAR</a> (Security Orchestration, Automation and Response).</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Ajouter la BDR pour un programme de sécurité complet\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Ajouter la BDR pour un programme de sécurité complet</h2>\n <p>La BDR complète les technologies EDR, <a href=\"https://www.lemagit.fr/definition/Passerelle-dacces-Cloud-securise\">CASB</a> (passerelle d’accès cloud sécurisé), les services d’accès sécurisé en périphérie et la protection contre la perte de données (<a href=\"https://www.lemagit.fr/definition/Prevention-des-fuites-de-donnees-DLP\">DLP</a>). Il améliore également la télémétrie <a href=\"https://www.lemagit.fr/definition/SIEM\">SIEM</a> et XDR avec des événements de navigation de haute fidélité, alimente les alertes dans SOAR pour l’orchestration et soutient les enquêtes forensiques en fournissant des données sources.</p>\n <p>Comme le navigateur se trouve à l’intersection de l’identité, des données et des applications, la BDR s’intègre souvent avec les fournisseurs d’identité pour le contexte de l’utilisateur, les CASB et la gestion de la posture de sécurité SaaS pour la posture de l’application, et les moteurs DLP pour la classification du contenu. Résultat&nbsp;: des réponses coordonnées et adaptées au contexte.</p>\n</section>   \n<section class=\"section main-article-chapter\" data-menu-title=\"Qui a besoin de BDR ?\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Qui a besoin de BDR&nbsp;?</h2>\n <p>Les organisations qui devraient évaluer la BDR sont celles qui ont une importante main-d’œuvre distante ou hybride, qui dépendent fortement des SaaS et des portails web, qui ont des exigences réglementaires élevées ou qui ont des applications web importantes en contact avec les clients qui traitent des données sensibles.</p>\n <p>L’adoption est motivée par plusieurs tendances, parmi lesquelles l’accélération de l’adoption des workflows cloud-native où tout se passe dans le navigateur, l’augmentation des attaques ciblées de la chaîne logistique web, le phishing sophistiqué qui échappe aux passerelles de sécurité des courriels, la prolifération des scripts tiers et des extensions de navigateur, et l’essor des outils d’IA non recensés qui exfiltrent des données en remplissant des formulaires et en participant à des sessions de discussion.</p>\n</section>   \n<section class=\"section main-article-chapter\" data-menu-title=\"Combler les lacunes\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Combler les lacunes</h2>\n <p>Il convient de noter que la BDR ne remplace pas l’EDR, le CASB ou les contrôles de réseau. Il les complète plutôt en fournissant un contexte et un contrôle plus complets au niveau du navigateur, que les autres outils ne peuvent pas capturer de manière fiable. Combinée, cette pile de détection et de réponse permet une visibilité et un contrôle à plusieurs niveaux sur les couches d’identité, d’extrémité, de réseau et d’application.</p>\n <p>La BDR comble une lacune critique dans les architectures de sécurité modernes en instrumentant l’environnement dans lequel la majorité des travaux et des attaques se produisent aujourd’hui. D’une certaine manière, le navigateur est vraiment le champ de bataille le plus répandu aujourd’hui.</p>\n <p>Un projet pilote de BDR soigneusement conçu, intégré aux workflows d’identité, de SIEM et de XDR et conçu en tenant compte de la protection de la vie privée, aide les entreprises à minimiser les risques liés au SaaS, au phishing ciblé et aux menaces de la chaîne d’approvisionnement en ligne. Cette approche peut mettre en évidence des risques précédemment non détectés et raccourcir les délais de détection et de réponse.</p>\n</section>",
      "published_ts": 1762433700,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-05-11-2025-bug-pour-les-utilisateurs-payants-w10-google-maps-ia-cybersecurite-du-louvre-484569.htm#xtor=RSS-1",
      "title": "ZDNET Morning 06/11/2025 : Bug pour les utilisateurs payants W10, Google Maps & IA, Cybersécurité du Louvre,...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1762423875,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634067/OpenAI-depasse-la-barre-du-million-dentreprises-clientes",
      "title": "OpenAI dépasse la barre du million d’entreprises clientes",
      "summary": "<p><b>Un million d’entreprises payantes</b>. C’est la barre symbolique qu’OpenAI vient de passer.</p> \n<p>Ce résultat – impressionnant si on se rappelle <a href=\"https://www.lemagit.fr/ezine/Applications-Donnees/Applications-et-donnees-19-ChatGPT-super-ambassadeur-de-lIA\">que ChatGPT s’est fait connaître du grand public en décembre 2021</a> – est le fruit d’une croissance et de la multiplication de ses offres dédiées aux grandes entreprises, à commencer par ChatGPT Enterprise qui progresse de 900&nbsp;% en un an.</p> \n<p>Mais c’est bien toute sa gamme (API, ChatGPT for Work, Sora, etc.) qui se développerait.</p> \n<p>Codex par exemple (l’outil de génération de code) aurait vu son utilisation multipliée par 10 depuis le mois d’août.</p> \n<p>«&nbsp;L’IA crée une vraie valeur pour les métiers&nbsp;», assure OpenAI, dans un contexte où pourtant <a href=\"https://www.lemagit.fr/actualites/366631756/IA-90-des-projets-terminent-a-la-poubelle-et-comment-faire-pour-que-ce-ne-soit-pas-le-cas\">90&nbsp;% des projets d’IA (générative ou non) sont abandonnés</a> avant 3&nbsp;ans.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Un ROI oui, mais uniquement avec de bons cas d’usage\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Un ROI oui, mais uniquement avec de bons cas d’usage</h2>\n <p>«&nbsp;D’après une récente étude de Wharton⁠, 75&nbsp;% des entreprises disent qu’elles ont un ROI positif, et moins de 5&nbsp;% un retour négatif&nbsp;», répond l’éditeur. «&nbsp;Cela reflète ce que nous observons sur le terrain&nbsp;: lorsque l’IA est déployée avec le bon cas d’usage et la bonne infrastructure, les équipes obtiennent de bons résultats&nbsp;».</p>\n <p>Parmi ses clients d’accord avec cette affirmation, OpenAI cite beaucoup d’acteurs du numérique comme Oracle, Salesforce, Indeed, Databricks, Spotify, Adobe ou Canva.</p>\n <p>Mais force est de constater que l’adoption de ses outils dépasse de loin ce seul secteur «&nbsp;naturel&nbsp;». Santander, Morgan Stanley et BBVA, Estée Lauder, Philips, LG, Moderna, Singapore Airlines ou encore le ministère de la Justice britannique font partie des «&nbsp;logos&nbsp;» affichés par l’éditeur sur son site officiel.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"La différence entre la bonne IA et la mauvaise IA\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La différence entre la bonne IA et la mauvaise IA</h2>\n <p>Pour le futur, <a href=\"https://www.lemagit.fr/actualites/366627935/OpenAI-devoile-un-agent-qui-travaille-pour-vous-a-vos-cotes\">OpenAI regarde vers l’agentique</a> (et éventuellement vers l’équilibre financier).</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Si une entreprise réduit ses effectifs de moitié, et une autre utilise l’IA pour doubler ses capacités, selon vous, qui prospérera&nbsp;?&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Fidji Simo</strong>Directrice des applications chez OpenAI\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Reste que pour Fidji Simo, sa directrice générale des applications, originaire de Sète, «&nbsp;trop d’entreprises perçoivent encore l’IA uniquement comme un outil de réduction des coûts, plutôt que comme un moteur de croissance&nbsp;».</p>\n <p>Les actualités récentes lui donnent raison avec des groupes comme Amazon, Accenture, IBM ou Onclusive – pour ne citer que quelques exemples – qui <a href=\"https://www.lefigaro.fr/societes/n-importe-quel-outil-fait-le-travail-en-trente-secondes-ces-entreprises-qui-reduisent-leurs-effectifs-a-cause-de-l-ia-20251008\">ont licencié</a> massivement.</p>\n <p>Ce qui ne manque pas de créer une forme d’inquiétude, et de <a href=\"https://fidjisimo.substack.com/p/why-the-best-companies-will-use-ai\">faire réagir</a> Fidji Simo. «&nbsp;Le potentiel de l’IA est bien plus vaste. Si une entreprise s’efforce de réduire ses effectifs de moitié, tandis qu’une autre utilise l’IA pour doubler sa capacité, laquelle, selon vous, prospérera&nbsp;?&nbsp;», questionne-t-elle.</p>\n <p>Si toutes les entreprises adoptaient cette approche, qui consiste à utiliser l’IA pour en faire plus au lieu de simplement dépenser moins, l’impact sur l’économie serait beaucoup plus profond et intéressant, martèle-t-elle.</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"L’aube d’une révolution du travail\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’aube d’une révolution du travail</h2>\n <p>En attendant, OpenAI se développe et ne licencie donc pas.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    « Il est de plus en plus clair que nous sommes à l’aube d’une révolution bien plus importante que de simples gains d’efficacité.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Fidji Simo</strong>Directrice des applications chez OpenAI\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Mais les forts gains de productivité qu’il revendique en interne (+70&nbsp;% de demandes d’extractions qui sont fusionnées, +20&nbsp;% de productivité de ses commerciaux) font qu’il ne recrute pas non plus à tour de bras.</p>\n <p>«&nbsp;On me demande souvent comment OpenAI parvient à croître si vite et à accomplir autant de choses avec seulement 3&nbsp;500&nbsp;employés&nbsp;», concède Fidji Simo. Signe que même l’IA bien appliquée – pour transformer et pas pour licencier – <a href=\"https://www.lefigaro.fr/societes/n-importe-quel-outil-fait-le-travail-en-trente-secondes-ces-entreprises-qui-reduisent-leurs-effectifs-a-cause-de-l-ia-20251008\">transforme en profondeur</a> le besoin de compétences.</p>\n <p>«&nbsp;Nous n’entrevoyons pas encore toutes les nouvelles catégories de travail qui émergeront&nbsp;», conclut la responsable. «&nbsp;[Mais] <a href=\"https://www.lemagit.fr/actualites/366634056/DSI-Forrester-prevoit-lexplosion-de-la-bulle-IA-en-2026\">à mesure que les obstacles s’effondrent</a>, il est de plus en plus clair que nous sommes à l’aube d’une révolution bien plus importante que de simples gains d’efficacité.&nbsp;»</p>\n</section>",
      "published_ts": 1762423800,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://blog.ovhcloud.com/partnership-at-human-scale-stories-from-canada/",
      "title": "Partnership at Human Scale: Stories from Canada",
      "summary": "As the Partner Program Manager for Canada, I’ve had the chance to work with some amazing partners in the fast-changing world of cloud technology. Throughout my experience, I’ve come to realize that while growth and innovation are important, what truly makes a difference in this space is the strength of the partnership we build together. […]",
      "published_ts": 1762421285,
      "source_name": "OVHcloud Blog"
    },
    {
      "url": "https://www.zdnet.fr/actualites/mise-a-jour-majeure-de-google-maps-lia-permet-desormais-de-discuter-avec-lapplication-484555.htm#xtor=RSS-1",
      "title": "Mise à jour majeure de Google Maps : l'IA permet désormais de « discuter » avec l'application",
      "summary": "Google Maps reçoit quatre mises à jour majeures basées sur la technologie Gemini.",
      "published_ts": 1762413110,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://blog.cloudflare.com/workers-vpc-open-beta/",
      "title": "How Workers VPC Services connects to your regional private networks from anywhere in the world",
      "summary": "Workers VPC Services enter open beta today. We look under the hood to see how Workers VPC connects your globally-deployed Workers to your regional private networks by using Cloudflare's global network, while abstracting cross-cloud networking complexity.",
      "published_ts": 1762351200,
      "source_name": "Cloudflare Engineering Blog"
    },
    {
      "url": "https://powerbi.microsoft.com/en-us/blog/power-bi-semantic-models-as-accelerators-for-ai-enabled-consumption/",
      "title": "Power BI semantic models as accelerators for AI-enabled consumption",
      "summary": "As data volumes grow exponentially, Power BI customers demand AI-driven analytical solutions that scale to petabytes, are secure, governed, and easy to manage. Power BI semantic models, backed by Microsoft Fabric, are the foundation for user-friendly BI solutions, bridging the gap between business users and IT by enabling trusted ad-hoc analysis. Consequently, Power BI semantic … Continue reading “Power BI semantic models as accelerators for AI-enabled consumption”",
      "published_ts": 1762333200,
      "source_name": "Power BI Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/microsoft-strengthens-sovereign-cloud-capabilities-with-new-services/",
      "title": "Microsoft strengthens sovereign cloud capabilities with new services",
      "summary": "We continue to adapt our sovereignty approach—innovating to meet customer needs and regulatory requirements within our Sovereign Public Cloud and Sovereign Private Cloud. We are announcing a new wave of capabilities, building upon our digital sovereignty controls, to deliver advanced AI and scale, strengthened by our ecosystem of specialized in-country partner experts. The post Microsoft strengthens sovereign cloud capabilities with new services appeared first on Microsoft Azure Blog .",
      "published_ts": 1762326000,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://blog.cloudflare.com/better-testing-for-workflows/",
      "title": "Building a better testing experience for Workflows, our durable execution engine for multi-step applications",
      "summary": "End-to-end testing for Cloudflare Workflows was challenging. We're introducing first-class support for Workflows in cloudflare:test, enabling full introspection, mocking, and isolated, reliable tests for your most complex applications.",
      "published_ts": 1762264800,
      "source_name": "Cloudflare Engineering Blog"
    },
    {
      "url": "https://blog.cloudflare.com/fresh-insights-from-old-data-corroborating-reports-of-turkmenistan-ip/",
      "title": "Fresh insights from old data: corroborating reports of Turkmenistan IP unblocking and firewall testing",
      "summary": "Cloudflare used historical data to investigate reports of potential new firewall tests in Turkmenistan. Shifts in TCP resets/timeouts across ASNs corroborate large-scale network control system changes.",
      "published_ts": 1762174800,
      "source_name": "Cloudflare Engineering Blog"
    }
  ],
  "python_polars_duckdb": [],
  "viz_bi": [
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545875-l-excellence-decisionnelle-le-nouvel-imperatif-strategique-pour-toute-entreprise-qui-veut-perenniser-son-activite/",
      "title": "L'excellence décisionnelle : le nouvel impératif stratégique pour toute entreprise qui veut pérenniser son activité",
      "summary": "Dans le fonctionnement de toute entreprise, la prise de décision est une compétence essentielle que chaque dirigeant, manager et collaborateur doit maîtriser.",
      "published_ts": 1762527374,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/guide-achat/test-chipolo-loop-ce-traceur-bluetooth-avec-boucle-est-une-alternative-interessante-a-lairtag-484547.htm#xtor=RSS-1",
      "title": "Test Chipolo Loop : ce traceur Bluetooth avec boucle est une alternative intéressante à l’AirTag",
      "summary": "Le traqueur d'Apple est excellent, mais il a ses limites. Celui-ci peut être attaché aux objets et son signal sonore est bien plus fort.",
      "published_ts": 1762402299,
      "source_name": "ZDNet France"
    }
  ]
}