{
  "cloud": [
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-lambda-enhances-sqs-processing-with-new-provisioned-mode-3x-faster-scaling-16x-higher-capacity/",
      "title": "AWS Lambda enhances event processing with provisioned mode for SQS event-source mapping",
      "summary": "AWS Lambda's new provisioned mode for Amazon SQS event source mapping offers dedicated polling resources that provide 3x faster scaling and 10x higher concurrency, enabling lower latency processing, better handling of traffic spikes, and greater control over event processing resources.",
      "published_ts": 1763142304,
      "source_name": "AWS Blog (global)"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634500/IA-sur-Kubernetes-les-analystes-epinglent-la-CNCF-face-a-lhegemonie-de-Nvidia",
      "title": "IA sur Kubernetes : les analystes épinglent la CNCF face à l’hégémonie de Nvidia",
      "summary": "<p>Le nouveau programme de conformité certifié <a href=\"https://www.lemagit.fr/definition/Kubernetes\">Kubernetes</a> AI de la Cloud Native Computing Foundation (CNCF) préconise un ensemble de normes pour garantir la portabilité, l’interopérabilité et la fiabilité des charges de travail d’IA. Toutefois, les responsables reconnaissent que le marché doit encore mûrir avant que cette vision ne se concrétise.</p> \n<p>Le programme, qui s’inspire du Certified Kubernetes Conformance Program existant, a été lancé en version bêta il y a six mois lors de la KubeCon + CloudNativeCon Japan. Il atteint la version&nbsp;1.0. Un premier groupe de fournisseurs certifiés participaient cette semaine à la KubeCon North America. Une diapositive diffusée lors du keynote principal liste Akamai, Alibaba Cloud, AWS, Broadcom, CoreWeave, DaoCloud, Google Cloud, Kubermatic, Microsoft Azure, Nvidia, Oracle, Red Hat et SUSE.</p> \n<p>Les représentants de la CNCF vantent le succès du Certified Kubernetes Conformance Program. Ce dernier a débuté avec 10&nbsp;membres et s’est étendu à plus de 100. Ils font part d’ambitions similaires pour le Kubernetes AI Conformance Program.</p> \n<p>«&nbsp;Aucun grand service de cloud ou option de cloud privé ne peut se passer de la conformité, de la stabilité et de la compatibilité de Kubernetes dans tous ces domaines. […] Cela a fondamentalement rassemblé toute l’industrie&nbsp;», lance Chris Aniszczyk, directeur de la technologie de la CNCF, lors de la conférence nord-américaine. «&nbsp;Que pouvons-nous faire pour garantir que la stabilité et la coopération mondiale que les communautés ont apportées à [d’autres] charges de travail soient valables pour l’IA, en plein essor ?&nbsp;»</p> \n<p>Les principaux objectifs du projet, selon sa documentation publique, sont de «&nbsp;simplifier l’IA/ML sur Kubernetes et d’accélérer l’adoption ; garantir l’interopérabilité et la portabilité des charges de travail d’IA [et] permettre la croissance de l’écosystème pour les outils d’IA sur une base standard de l’industrie&nbsp;».&nbsp;</p> \n<p>Les dirigeants de la CNCF et de la Fondation Linux entrevoient la convergence entre l’infrastructure cloud-native et la fourniture de charges de travail d’IA générative. Une occasion rêvée.</p> \n<p>«&nbsp;Ce n’est pas seulement une opportunité pour la CNCF, mais pour l’ensemble de la Fondation Linux, de nous amener au prochain “moment Linux” dans l’IA&nbsp;», anticipe Jim Zemlin, directeur exécutif de la Fondation Linux, en préambule d’un point presse. «&nbsp;Nous pourrions bénéficier d’une pile complète de logiciels open source hébergés dans des fondations neutres qui aident au préentraînement, à l’entraînement, au post-entraînement [des modèles], à l’inférence et aux agents&nbsp;».</p> \n<p>Et de citer des projets open source qui ont émergé pour orchestrer les charges de travail d’IA, <a href=\"https://www.lemagit.fr/actualites/366615700/Red-Hat-acquiert-Neural-Magic-pour-mieux-apprehender-le-LLMOps\">tels que vLLM</a>, AIBrix et la pile émergente «&nbsp;PARK&nbsp;» (PyTorch, AI, Ray et Kubernetes). Ainsi, Jim Zemlin prédit qu’au cours des trois à cinq prochaines années, un framework open source standard émergera pour les agents d’IA.</p> \n<p>Par ailleurs, le dirigeant s’attend à ce qu’un consensus se dégage au sein de la communauté open source sur les protocoles de communication pour les agents IA, tels que Agent2Agent. L’exemple n’est pas donné au hasard. Le projet a été confié à la Fondation Linux en juin. Les éditeurs préfèrent pour l’instant exposer des outils aux grands modèles de langage, à travers MCP (Model Context Protocol).</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"KubeCon : « Où est Jensen Huang ? »\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>KubeCon&nbsp;: «&nbsp;Où est Jensen&nbsp;Huang ?&nbsp;»</h2>\n <p>Lors de la conférence de presse, les dirigeants de la CNCF et de la Linux Foundation ont dû répondre à des questions pointues. Plusieurs participants se sont demandé pourquoi le géant de l’IA Nvidia n’était pas plus présent lors du lancement du nouveau programme de conformité.</p>\n <p>«&nbsp;Évidemment, Nvidia est le centre de gravité de tout cela&nbsp;», constate Steven Dickens, PDG de HyperFrame Research, un cabinet d’analystes. «&nbsp;Quel est votre plan pour les attirer dans le Programme de Conformité ? Comment vous assurer que les points d’interface technologique, comme Google, soient présents ?&nbsp;».</p>\n <p>Selon Chris Aniszczyk, les représentants de Nvidia ont participé aux réunions du Programme de Conformité IA. Mais l’entreprise n’a pas de produit Kubernetes-as-a-Service similaire à ceux certifiés par le programme. Nvidia est membre de la CNCF depuis 2018. Elle a contribué à des projets comme l’allocation dynamique de ressources Kubernetes. Ce support fait partie des premières exigences obligatoires du Programme de Conformité IA Kubernetes Certifié.</p>\n <p>Néanmoins, les projets mentionnés par les dirigeants de la CNCF posent problème. Ces exemples de standards open source émergent pour les charges de travail d’inférence IA, notamment vLLM et AIBrix, doivent s’intégrer avec CUDA. Ce framework de calcul parallèle propriétaire de Nvidia est nécessaire pour faire fonctionner ces systèmes avec&nbsp;les puces du concepteur. La même question peut se poser pour les puces AMD, Google ou AWS qui exigent l’usage d’un framework spécifique (parfois open source).</p>\n <p>Lors de la KubeCon China, en juin dernier, Chris Aniszczyk assurait croire en la capacité de la communauté open source <a href=\"https://www.lemagit.fr/actualites/366626149/IA-La-CNCF-entrevoit-une-alternative-ouverte-a-CUDA-de-Nvidia\">à trouver une alternative à CUDA.</a></p>\n <p>Toutefois, l’entreprise au caméléon domine ce marché.</p>\n <p>Les alternatives aux GPU comme les TPU de Google ont pris de l’ampleur l’année dernière. En la matière, Google a présenté récemment une intégration avec vLLM. Cette semaine, GCP s’est rapproché de Vast Data qui prend en charge les TPU en lien avec ses services managés de stockage. Or, Nvidia est investisseur dans Vast Data et il a atteint une valorisation boursière de 5 000&nbsp;milliards de dollars. Le géant a sécurisé des contrats valant des dizaines de milliards pour fournir ses GPU aux principaux fournisseurs cloud et entreprises d’IA, notamment AWS et OpenAI.</p>\n <p>Chris Lamb, vice-président du logiciel de calcul GPU chez Nvidia, a fait une apparition lors du keynote de la KubeCon + CloudNativeCon&nbsp;2024. Bob Wise, maintenant vice-président de l’ingénierie et des opérations chez Nvidia DGX Cloud, a représenté AWS au conseil d’administration de la CNCF de 2020 à 2022.</p>\n <p>Mais Jensen Huang, PDG de Nvidia, ne s’est jamais rendu à un événement majeur de la CNCF. Steven Dickens l’a fait remarquer. Jensen Huang est pourtant le visage public de l’entreprise. Il est devenu incontournable dans <a href=\"https://www.lemagit.fr/actualites/366625798/Avec-Mistral-AI-Nvidia-saffiche-en-fer-de-lance-de-lIA-souveraine\">le circuit des conférences technologiques ces dernières années.</a></p>\n <p>«&nbsp;Assister aux réunions, quelques ingénieurs qui contribuent un peu de code, tout ça c’est formidable&nbsp;», rétorque l’analyste. «&nbsp;Nvidia, c’est LE meneur de jeu [en IA]. Va-t-il être un acteur de premier plan de ce programme ? Jensen [Huang] va-t-il monter sur scène en veste de cuir à KubeCon ?&nbsp;»</p>\n <p>La situation se complique encore. Nvidia a été plus explicite publiquement sur les composants qu’elle a récemment donnés à des projets open source adjacents à Kubernetes. Ces projets ne sont pas gouvernés par la CNCF. L’exemple notable est <a href=\"https://www.lemagit.fr/actualites/366628166/Linference-distribuee-lavenir-de-Red-Hat-AI\">llm-d de Red Hat, lancé en mai.</a></p>\n <p>Nvidia a également fait la publicité de sa propre API Kubernetes open source, Grove, cette semaine pendant KubeCon. Le fabricant «&nbsp;fabless&nbsp;» ne l’a pas donné à la CNCF. Le projet «&nbsp;définit la structure et le cycle de vie des charges de travail d’inférence IA mono et multinœuds&nbsp;», selon un article de blog de l’entreprise. Ces charges incluent celles déployées avec NVIDIA Dynamo. Elles peuvent s’adapter efficacement dans des environnements basés sur Kubernetes.</p>\n</section>             \n<section class=\"section main-article-chapter\" data-menu-title=\"Les risques de « l’économie Nvidia »\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les risques de «&nbsp;l’économie Nvidia&nbsp;»</h2>\n <p>D’autres analystes du secteur présents à la conférence de presse ont demandé si la Linux Foundation et la CNCF allaient s’attaquer à «&nbsp;l’étau&nbsp;» de Nvidia sur le marché de l’IA. Ils font le parallèle avec la façon dont <a href=\"https://www.lemagit.fr/conseil/Comment-passer-de-Windows-a-Linux\">Linux a défié Windows de Microsoft</a>. Ou comment la CNCF a offert une alternative open source solide aux middlewares propriétaires.</p>\n <p>« Je ne vois pas beaucoup de soutien pour des alternatives open source à CUDA », souligne Stephen O’Grady, analyste principal et co-fondateur de RedMonk, lors de la séance de questions réponses de la conférence de presse. « Que faites-vous pour que les primitives fondamentales du calcul IA <a href=\"https://www.lemagit.fr/actualites/366579472/Accelerateurs-une-fondation-se-mobilise-contre-Nvidia\">n’appartiennent pas à une seule entreprise ?</a> ».</p>\n <p>Jim Zemlin a répondu par une autre analogie avec les premiers jours de domination du cloud public par AWS.</p>\n <p>« Si vous regardez les parts de marché maintenant, c'est assez équilibré », considère-t-il. « Vous avez Amazon, Microsoft, Alibaba, Oracle, Google. Chaque fois qu'il y a une révolution technique comme l'IA, c'est le chaos au début. Puis les choses se diversifient naturellement avec le temps ».</p>\n <p>Dans un entretien séparé, un autre analyste participant à la conférence de presse espère qu'une alternative open source solide à CUDA émergera.</p>\n <p>« Si Nvidia continue de dominer comme elle le fait, il faut qu'il y ait une alternative », déclare Larry Carvalho, consultant principal chez RobustCloud. « J'ai lu que les États-Unis sont devenus l'économie Nvidia. Une capitalisation boursière de 5 000 milliards de dollars pour une seule entreprise, c'est une gravité énorme sur une seule société. Les gens parlent de gravité des données. Là, c'est la gravité du calcul ».</p>\n</section>",
      "published_ts": 1763122500,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-aws-iot-core-device-location-integration-with-amazon-sidewalk/",
      "title": "Introducing AWS IoT Core Device Location integration with Amazon Sidewalk",
      "summary": "AWS IoT Core Device Location service enables Amazon Sidewalk devices to resolve location data without GPS modules, allowing cost-effective asset tracking solutions using Sidewalk's network infrastructure.",
      "published_ts": 1763060997,
      "source_name": "AWS Blog (global)"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/secure-eks-clusters-with-the-new-support-for-amazon-eks-in-aws-backup/",
      "title": "Secure EKS clusters with the new support for Amazon EKS in AWS Backup",
      "summary": "AWS Backup now supports Amazon EKS, providing a fully managed, centralized solution to back up and restore Kubernetes clusters and application data without requiring custom scripts or third-party tools.",
      "published_ts": 1762810229,
      "source_name": "AWS Blog (global)"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-amazon-ec2-and-more-november-10-2025/",
      "title": "AWS Weekly Roundup: Amazon S3, Amazon EC2, and more (November 10, 2025)",
      "summary": "AWS re:Invent 2025 is only 3 weeks away and I’m already looking forward to the new launches and announcements at the conference. Last year brought 60,000 attendees from across the globe to Las Vegas, Nevada, and the atmosphere was amazing. Registration is still open for AWS re:Invent 2025. We hope you’ll join us in Las Vegas […]",
      "published_ts": 1762792718,
      "source_name": "AWS Blog (global)"
    }
  ],
  "dataprep_orchestration_etl": [
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1546051-la-croissance-sans-pilotage-c-est-le-crash-assure/",
      "title": "La croissance sans pilotage, c'est le crash assuré",
      "summary": "Trop souvent cantonné à un rôle de contrôle, le reporting financier est pourtant un outil de transformation et de croissance.",
      "published_ts": 1763154291,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/solutions/dsi/1545845-carve-out-carve-in-data-enjeux-et-strategies-pour-les-dsi/",
      "title": "Carve-Out / Carve-In Data : enjeux et stratégies pour les DSI",
      "summary": "Les opérations de fusion, d'acquisition ou de cession se multiplient, entraînant à chaque fois un chantier majeur : la transformation des systèmes d'information.",
      "published_ts": 1762964219,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://dagster.io/blog/what-dagster-believes-about-data-platforms",
      "title": "What Dagster Believes About Data Platforms",
      "summary": "The beliefs that organizations adopt about the way their data platforms should function influence their outcomes. Here are ours.",
      "published_ts": 1762799248,
      "source_name": "Dagster Blog"
    }
  ],
  "db_sql_olap": [
    {
      "url": "https://www.lemagit.fr/actualites/366634593/Ransomware-des-affides-dAkira-se-tournent-vers-les-VM-Nutanix",
      "title": "Ransomware : des affidés d’Akira se tournent vers les VM Nutanix",
      "summary": "<p>Les autorités helvètes avaient récemment alerté&nbsp;: l’enseigne de rançongiciel Akira «&nbsp;a intensifié ses actions en Suisse ces derniers mois&nbsp;». Et de&nbsp;lâcher&nbsp;un chiffre&nbsp;: «&nbsp;environ 200&nbsp;entreprises&nbsp;» de la confrérie ont été victimes de cyberattaque impliquant Akira «&nbsp;entre mai&nbsp;2023 et septembre&nbsp;2025&nbsp;».</p> \n<p>Un phénomène récent&nbsp;: «&nbsp;ces attaques sont toujours en cours et se sont intensifiées ces derniers mois. Les autorités ont en effet constaté une augmentation du nombre de cas liés au même ransomware (entre 4 et 5 par semaine, un chiffre record en Suisse), ce qui prouve que le groupe en question est très actif&nbsp;».</p> \n<p>C’est aujourd’hui au tour de l’agence américaine de cyberdéfense, la Cisa, de tirer la sonnette d’alarme.</p> \n<p>L’enseigne Akira compte parmi <a href=\"https://www.lemagit.fr/actualites/366632861/Ransomware-comment-Akira-cache-son-niveau-dactivite-reel\">les plus visiblement actives en 2025</a>, depuis l’accélération de ses activités&nbsp;<a href=\"https://www.lemagit.fr/actualites/366623297/Ransomware-Akira-continue-sur-sa-lancee\">à l’automne dernier</a>. Et elle a manifestement su attirer des recrues capables de faire évoluer leurs modes opératoires.</p> \n<p>Ainsi, <a href=\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-109a\">indique</a> la Cisa, «&nbsp;lors d'un incident survenu en juin 2025, des acteurs malveillants associés à Akira ont chiffré pour la première fois les fichiers disque VM Nutanix AHV, étendant ainsi leurs capacités au-delà de VMware ESXi et Hyper-V en exploitant la vulnérabilité CVE-2024-40766, une vulnérabilité SonicWall&nbsp;».</p> \n<p>Toujours selon l’agence américaine, à «&nbsp;fin septembre 2025, le ransomware Akira avait rapporté environ 244,17 millions de dollars (USD) en rançons&nbsp;».</p> \n<p>Les cibles préférées des acteurs associés à Akira&nbsp;? Les petites et moyennes entreprises, indique la Cisa, tout en précisant qu’ils «&nbsp;ont également touché des organisations plus importantes dans divers secteurs, avec une préférence notable pour les organisations des secteurs de la fabrication, de l'éducation, des technologies de l'information, des soins de santé et de la santé publique, des services financiers, ainsi que de l'alimentation et de l'agriculture&nbsp;».</p>",
      "published_ts": 1763122380,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.numerama.com/vroom/2117993-les-industriels-europeens-de-la-batterie-supplient-bruxelles-dagir.html",
      "title": "Les industriels européens de la batterie supplient Bruxelles d’agir",
      "summary": "L’Europe parle beaucoup de souveraineté industrielle, mais sa filière batterie s’effondre sous ses yeux. Les fabricants préviennent : sans cadre clair le 10 décembre prochain, il n’y aura bientôt plus rien à sauver.",
      "published_ts": 1763119893,
      "source_name": "Numerama"
    },
    {
      "url": "https://dagster.io/blog/compass-now-available",
      "title": "Compass: AI Data Analysis for Your Warehouse, in Slack",
      "summary": "Connect your Snowflake, BigQuery, Redshift, or Databricks warehouse to Compass and get AI-powered answers in Slack. Your data stays where it is. Your governance stays intact. Available now.",
      "published_ts": 1763054436,
      "source_name": "Dagster Blog"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2114047-funko-createur-des-figurines-pop-pourrait-mettre-la-cle-sous-la-porte-dici-un-an.html",
      "title": "Funko, créateur des figurines Pop!, pourrait mettre la clé sous la porte d’ici un an",
      "summary": "Les ventes de Funko, le fabricant américain des figurines Pop!,  ont chuté de 14,3 % en un an et sa dette dépasse désormais les 240 millions de dollars. L’entreprise reconnaît avoir de « sérieux doutes » quant à sa capacité à poursuivre ses activités au-delà des douze prochains mois.",
      "published_ts": 1762785561,
      "source_name": "Numerama"
    },
    {
      "url": "https://siecledigital.fr/2025/11/10/apres-leuphorie-la-chute-lintelligence-artificielle-declenche-une-onde-de-choc-boursiere/",
      "title": "Après l’euphorie, la chute : l’intelligence artificielle déclenche une onde de choc boursière",
      "summary": "Depuis le 31 octobre, la fièvre de l’intelligence artificielle s’est transformée en une crise de confiance sur les marchés financiers. En une semaine à peine, près de 1 000 milliards de dollars de valorisation se sont évaporés chez les grands noms de la tech américaine, de Nvidia à Meta, en passant par Oracle et Amazon. […]",
      "published_ts": 1762780458,
      "source_name": "Siècle Digital"
    },
    {
      "url": "https://www.numerama.com/tech/2113985-lun-des-meilleurs-tv-oled-perd-plus-de-la-moitie-de-son-prix-pour-le-pre-black-friday.html",
      "title": "L’un des meilleurs TV OLED perd plus de la moitié de son prix pour le pré-Black Friday",
      "summary": "[Deal du jour] Plusieurs références de téléviseurs LG sont en promotion pendant le pré-Black Friday, dont la série C5. Avec son modèle OLED55C5, le fabricant propose un téléviseur aux belles performances. Il est en promotion pour le pré-Black Friday.",
      "published_ts": 1762771774,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634267/Snowflake-veut-lui-aussi-faire-de-PostgreSQL-un-lakehouse-ouvert",
      "title": "Snowflake veut lui aussi faire de PostgreSQL un lakehouse ouvert",
      "summary": "<p>Dans sa course contre Databricks pour offrir la plateforme de gestion de données la plus complète du marché, l’éditeur lancera «&nbsp;bientôt&nbsp;» sa version managée de PostgreSQL en préversion publique. Pour mémoire, il avait annoncé en juin dernier <a href=\"https://www.lemagit.fr/actualites/366625313/Comme-Databricks-Snowflake-acquiert-un-specialiste-de-PostgreSQL\">l’acquisition de Crunchy Data.</a> Databricks, lui, a racheté, peu de temps avant<a href=\"https://www.lemagit.fr/actualites/366623965/PostgreSQL-serverless-Databricks-sapprete-a-acquerir-Neon\">, Neon, un autre spécialiste</a> de la base de données relationnelle open source.</p> \n<p>Snowflake a surtout profité de son événement Build de la semaine dernière pour libérer pg_lake, une suite d’extensions ouverte pour le SGBDR le plus populaire du marché. Elles permettent de gérer des tables Apache Iceberg dans <a href=\"https://www.lemagit.fr/definition/PostgreSQL\">PostgreSQL</a>. Il est également possible d’interroger des tables étrangères sur S3 ou Azure Blob Storage, qu’elles soient au format CSV, JSON, Parquet et Iceberg. Pg_lake dispose de fonctions pour charger des données depuis des buckets&nbsp;S3 ou d’une URL dans des tables Iceberg ou PostgreSQL. Enfin, les résultats des requêtes peuvent être sauvegardés dans des buckets&nbsp;S3, afin de poursuivre les traitements. À noter que pg_lake lit des fichiers les formats géospatiaux, dont GeoJSON.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Combiner les capacités de Postgres, de DuckDB et d’Iceberg\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Combiner les capacités de Postgres, de DuckDB et d’Iceberg</h2>\n <p>Les extensions pg_lake s’intègrent à PostgreSQL pour gérer «&nbsp;la planification des requêtes, les périmètres des transactions et l’orchestration générale des exécutions&nbsp;».</p>\n <p>Sous le capot, un serveur DuckDB (nommé pgduck_server) est utilisé pour externaliser les scans et les traitements parallèles. DuckDB est un moteur analytique orienté colonnes (OLAP) open source. Il est réputé pour gérer des requêtes complexes à partir de grandes bases de données.</p>\n <p>Le projet s’appuie sur le protocole TCP de PostgreSQL pour interconnecter PostgreSQL et DuckDB.</p>\n <p>&nbsp;«&nbsp;Toute personne disposant de Postgres et souhaitant la transformer en interface pour gérer un lac ouvert avec des tables Iceberg pourra le faire à sa guise&nbsp;», promet Christian Kleinerman, vice-président directeur du produit chez Snowflake, lors d’une conférence de presse en ligne.</p>\n <p>C’était une des fonctionnalités au cœur de Crunchy Bridge for Analytics, dont le développement a commencé au début de l’année 2024. Un moyen de simplifier la jonction entre les données opérationnelles et analytiques. Ces fonctionnalités sont ensuite devenues le cœur de l’offre Crunchy Data Warehouse, avant que Snowflake acquière la société.</p>\n <p>Pour rappel, ce n’est pas dans la nature de PostgreSQL que de traiter des charges de travail analytiques. C’est, à l’origine, une base de données transactionnelle.</p>\n <p>«&nbsp;L’industrie des bases de données est divisée en deux grandes factions&nbsp;: les systèmes OLTP et OLAP. Elles ne se parlent pas trop, mais elles sont d’accord sur la gestion de transactions et l’usage de SQL&nbsp;», <a href=\"https://www.youtube.com/watch?v=tpq4nfEoioE\">résume</a> Marco Slot, ingénieur logiciel principal chez Snowflake (ex-Crunchy Data) lors d’un événement Microsoft Developer. «&nbsp;Les systèmes OLTP comme PostgreSQL prennent en charge de grande quantité de transactions telles des petites mises à jour, des changements ligne à ligne, de petites sélections, etc., à une faible latence et à haut débit&nbsp;», poursuit-il. «&nbsp;Les systèmes OLAP se concentrent sur le scan à haute vitesse d’un grand volume de données en une seule requête. C’est un autre problème d’optimisation&nbsp;».</p>\n <p>Outre la différence d’orientation du format de stockage (en ligne pour les systèmes OLTP, en colonne pour les systèmes OLAP), les systèmes analytiques modernes, dont Databricks, Snowflake et DuckDB s’appuient sur des moteurs d’exécution vectorisée. Ceux-là permettent de traiter des données en lot plutôt que ligne par ligne. «&nbsp;Le moteur de requêtes prend un vecteur de valeurs – un lot de valeurs – et les expressions sont implémentées comme des boucles&nbsp;», explique Marco Slot. «&nbsp;Ils font la même comparaison sur toutes les valeurs du vecteur. Et le résultat peut être un nouveau vecteur avec, par exemple, les index des lignes qui correspondent aux filtres de la requête&nbsp;».</p>\n <p>Au lieu de changer d’expression constamment, ici le traitement en batch abaisse le nombre d’appels de fonctions, le processeur peut mieux prédire la suite de l’exécution, le cache CPU est utilisé à bon escient, tandis que les instructions SIMD des processeurs permettent de traiter plusieurs valeurs en une seule requête.</p>\n <p>«&nbsp;En couplant cela à la parallélisation, les bases de données OLAP dotées d’un tel moteur peuvent être 10, voire plus de 100&nbsp;fois plus rapides que PostgreSQL pour des requêtes analytiques&nbsp;», estime l’ingénieur principal.</p>\n <p>Or, il n’est pas simple de bâtir <a href=\"https://www.lemagit.fr/actualites/252522169/Databricks-cimente-les-briques-de-son-data-lakehouse\">un moteur à exécution vectorisée</a>. De plus,&nbsp;«&nbsp;d’autres composants de Postgres ne sont pas optimisés pour l’analytique&nbsp;», ajoute Marco Slot.</p>\n <p>D’où l’usage du «&nbsp;superpouvoir&nbsp;» de PostgreSQL&nbsp;: les extensions. «&nbsp;Il&nbsp;y a quelques années, ce n’était pas une base de données vectorielle, mais maintenant nous avons pg_vector. Ce n’était pas une base de données distribuée, mais le projet <a href=\"https://www.lemagit.fr/actualites/252456460/Microsoft-renforce-les-capacites-de-dimensionnement-de-Postgresql-sur-Azure\">Citus a changé la donne&nbsp;</a>», illustre l’ingénieur principal. «&nbsp;De la même manière, nous pouvons faire de Postgres une bonne base de données analytique à travers les extensions&nbsp;».</p>\n <p>En tant que <a href=\"https://www.lemagit.fr/actualites/366627790/Apptio-affine-sa-gestion-des-couts-de-lIA-et-du-cloud-hybride\">moteur d’exécution vectorisée embarquée, DuckDB</a> était considéré comme le plus adapté à cette tâche. «&nbsp;La licence est similaire, il cible une seule machine, son dialecte SQL est dérivé de PostgreSQL&nbsp;et il a aussi des extensions&nbsp;», justifie Marco Slot.</p>\n</section>              \n<section class=\"section main-article-chapter\" data-menu-title=\"Rapprocher PostgreSQL des lakehouse, une initiative commune à l’écosystème Data\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Rapprocher PostgreSQL des lakehouse, une initiative commune à l’écosystème Data</h2>\n <p>Christian Kleinerman envisage que les développeurs utilisent cette extension dans le cadre de développement d’applications. «&nbsp;Je pense que l’un des cas d’usage le plus courant consiste pour les développeurs à créer des applications avec Postgres, puis à effectuer un ETL ou à copier les données à des fins d’analyse dans une plateforme de données telle que Snowflake ou, de plus en plus, dans un lac de données ouvert, avec S3 Table sur AWS ou avec Iceberg, <a href=\"https://www.lemagit.fr/actualites/366631554/Fabric-face-a-Snowflake-et-Databricks-Microsoft-met-les-bouchees-doubles\">sur Microsoft OneLake&nbsp;</a>», indique-t-il, dans un briefing avec la presse. «&nbsp;C’est ce que permet PG Lake. […] Nous avons pensé que c’était plus important que Snowflake et que Snowflake Postgres. D’où la libération du projet&nbsp;».</p>\n <p>Ce n’est pas le premier projet du genre. À travers MotherDuck, l’éditeur DuckDB propose une implémentation différente. Il embarque directement une instance de son moteur dans PostgreSQL. Il faut également noter que Databricks a mis la main au début du mois d’octobre sur Mooncake Labs, une startup basée à San Francisco. Celle-ci a développé pg_mooncake, une extension open source permettant de créer un miroir inversé de tables Postgres dans un format orienté colonne Apache Iceberg. Les données sont ingérées avec sa technologie moonlink et traitées avec… DuckDB.</p>\n</section>   \n<section class=\"section main-article-chapter\" data-menu-title=\"À la croisée des changements de paradigme\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>À la croisée des changements de paradigme</h2>\n <p>Il y a quelques limitations. La première étant qu’il n’est pas encore possible d’utiliser de catalogue externe à PostgreSQL pour Iceberg dans le cas de pg_lake. Databricks, Cloudera, Dremio, Snowflake et d’autres utilisent désormais des catalogues de métadonnées externes comme Hive, <a href=\"https://www.lemagit.fr/actualites/366599652/Apache-Iceberg-Snowflake-libere-Polaris-et-sallie-a-Dremio\">Polaris ou Unity</a>. Cette gestion de la gouvernance des tables Iceberg (et leur contrôle) n’est pas encore standard.&nbsp;</p>\n <p>Néanmoins, les experts du milieu décrivent deux phénomènes qui convergent. Après la naissance des lakehouse – qui combinent les capacités des entrepôts et des lacs de données – la frontière entre la base et le lac de données s’effacerait, selon Manish K., architecte Big Data chez Accenture.</p>\n <p>«&nbsp;DuckDB a prouvé que nous pouvons exécuter des analyses sérieuses directement sur des fichiers&nbsp;», <a href=\"https://www.linkedin.com/posts/activity-7393243881011798016-YogO?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAABfZ9MABbYoGamxFbwWKF3lQzOgcuryCmSk\">écrit</a> Manish K. sur LinkedIn. «&nbsp;pg_lake et pg_mooncake ont prouvé que Postgres peut parler [le langage] des tables de style Iceberg dans un espace de stockage objet. Les services Postgres cloud-first (calcul/stockage découplé, branchable, élastique) ressemble désormais à un lakehouse sur le plan architectural&nbsp;», ajoute-t-il. «&nbsp;Le schéma est donc clair&nbsp;: la base de données se déplace là où se trouve déjà le lac&nbsp;». Et d’utiliser l’expression «&nbsp;lakebase&nbsp;».</p>\n <p>Bhairav Metha, directeur data science chez JPMorganChase,&nbsp;voit un autre changement. Alors que les systèmes <a href=\"https://www.lemagit.fr/actualites/252473646/Selon-Forrester-les-bases-de-donnees-translytiques-ont-le-vent-en-poupe\">translytiques</a> sont jusqu’à présent majoritairement propriétaires, ils pourraient demain s’appuyer sur un projet open source&nbsp;: PostgreSQL.</p>\n <p>«&nbsp;Nous n’y sommes peut-être pas encore tout à fait – l’OLAP et l’OLTP répondent encore à des objectifs d’optimisation distincts – mais la trajectoire est claire&nbsp;», <a href=\"https://www.linkedin.com/posts/activity-7393518197771182080-E9o3?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAABfZ9MABbYoGamxFbwWKF3lQzOgcuryCmSk\">avance</a>-t-il. «&nbsp;Postgres pourrait bientôt gérer 90&nbsp;% des charges de travail modernes sans avoir besoin d’un entrepôt ou d’un Lakehouse séparé&nbsp;».</p>\n</section>",
      "published_ts": 1762757220,
      "source_name": "LeMagIT"
    }
  ],
  "ml_ai": [
    {
      "url": "https://www.numerama.com/vroom/2107679-3-ans-apres-est-ce-le-moment-de-changer-de-tesla-model-y.html",
      "title": "3 ans après, est-ce le moment de changer de Tesla Model Y ?",
      "summary": "On changerait de voiture comme on change de smartphone : pour avoir la même, mais en mieux. Cette comparaison, bien qu'inexacte, est peut-être au fond criante de vérité. Après quelques années après, et quelques évolutions majeures comme mineures, on pourrait être tenté par la nouvelle Model Y pour remplacer l'ancienne. Est-ce le bon moment ? Qu'est-ce qu'on y gagne, mais surtout, qu'est-ce qu'on y perd ?",
      "published_ts": 1763320500,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/business/2113557-mark-zuckerberg-kim-kardashian-mrbeast-pourquoi-les-ultra-riches-senferment-dans-des-bunkers-a-5-millions-de-dollars.html",
      "title": "Mark Zuckerberg, Kim Kardashian, MrBeast… Pourquoi les ultra-riches s’enferment dans des bunkers à 5 millions de dollars",
      "summary": "Alors que les tensions nucléaires refont surface, les milliardaires se tournent vers un nouveau symbole de sécurité : le bunker de luxe. Porté par la peur d’une nouvelle guerre froide, le marché des abris souterrains explose, dominé par l’Américain Ron Hubbard et son entreprise Atlas Survival Shelters. Numerama a pu l’interviewer.",
      "published_ts": 1763313900,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/vroom/2114029-apres-avoir-essaye-lalpine-a290-jai-presque-envie-dappeler-mon-banquier-pour-en-acheter-une.html",
      "title": "Après avoir essayé l’Alpine A290, j’ai presque envie d’appeler mon banquier pour en acheter une",
      "summary": "J'ai pu rouler pendant quelques jours en Alpine A290 pour enfin savoir ce que vaut la toute première voiture électrique de la marque sportive tricolore. Mieux que la Mini John Cooper Works électrique ? C'est ce que nous allons voir.",
      "published_ts": 1763310620,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2115913-pluribus-sur-apple-tv-une-saison-2-est-elle-prevue-pour-la-serie-de-vince-gilligan.html",
      "title": "Pluribus sur Apple TV : une saison 2 est-elle prévue pour la série de Vince Gilligan ?",
      "summary": "Trois ans après la fin de Better Call Saul, Vince Gilligan nous offre une nouvelle série, aux accents de SF : Pluribus, dont la diffusion a débuté le 7 novembre 2025, sur Apple TV. Mais une suite est-elle déjà prévue pour cette ambitieuse production de SF ?",
      "published_ts": 1763305320,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/2118167-250-e-de-moins-pour-ce-pack-avec-le-xiaomi-15t-pro-des-ecouteurs-et-un-bracelet-connecte.html",
      "title": "250 € de moins pour ce pack avec le Xiaomi 15T Pro, des écouteurs et un bracelet connecté",
      "summary": "[Deal du jour] Rien ne vaut un pack complet pour changer son smartphone et ses accessoires d'un coup. Et quand le Black Friday s'en mêle pour baisser le prix du pack idéal, c'est encore mieux.",
      "published_ts": 1763304720,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117941-attention-le-match-entre-la-france-et-lazerbaidjan-nest-pas-diffuse-a-un-horaire-habituel.html",
      "title": "Attention, le match entre la France et l’Azerbaïdjan n’est pas diffusé à un horaire habituel",
      "summary": "La France est déjà qualifiée pour la Coupe du monde 2026, mais il reste encore un match à disputer dans les éliminatoires. Ce sera ce dimanche 16 novembre, à 18h, face à l'Azerbaïdjan.",
      "published_ts": 1763299860,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.zdnet.fr/pratique/comment-mettre-a-niveau-votre-pc-windows-10-incompatible-vers-windows-11-gratuitement-484943.htm#xtor=RSS-1",
      "title": "Comment mettre à niveau votre PC Windows 10 \"incompatible\" vers Windows 11 - gratuitement",
      "summary": "Microsoft ne souhaite vraiment pas que ses clients mettent à jour leurs anciens PC vers Windows 11. Mais il existe des solutions de contournement pour tous les appareils, à l'exception des plus anciens. Maintenant que la prise en charge de Windows 10 est officiellement terminée, voici tout ce que vous devez savoir.",
      "published_ts": 1763295111,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/sciences/2118267-mission-chinoise-shenzhou-robot-russe-qui-se-casse-la-figure-et-aurores-boreales-le-recap-de-la-semaine.html",
      "title": "Mission chinoise Shenzhou, robot russe qui se casse la figure, et aurores boréales — le récap’ de la semaine",
      "summary": "Cette semaine a été riche en actualités spatiales : la réussite du test de Blue Origin consistant à faire revenir le booster de New Glenn sur Terre, la forte tempête solaire qui a atteint la Terre ou encore les péripéties de l'équipage Shenzhou 20.",
      "published_ts": 1763294520,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.zdnet.fr/guide-achat/jai-assemble-ce-pc-portable-windows-puissant-en-quelques-minutes-decouvrez-ce-modele-meconnu-484986.htm#xtor=RSS-1",
      "title": "J'ai assemblé ce PC portable Windows en quelques minutes : découvrez ce modèle méconnu !",
      "summary": "Le Laptop 16 de Framework, récemment mis à jour, est doté de nouveaux composants performants et d’une prise en charge de Linux intégrée d’origine.",
      "published_ts": 1763287905,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117473-si-vous-aimez-lespace-ces-lego-en-promo-pour-le-black-friday-devraient-vous-plaire.html",
      "title": "Si vous aimez l’espace, ces Lego en promo pour le Black Friday devraient vous plaire",
      "summary": "[Deal du Jour] Lego propose de nombreux sets dans tous les domaines, du cinéma aux jeux vidéo, en passant par l'architecture et l'astronomie. Voici une petite sélection de Lego en promotion sur ce dernier thème pendant le pré-Black Friday.",
      "published_ts": 1763280660,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/vroom/2116761-renault-recidive-non-la-prise-de-charge-rapide-ne-doit-plus-etre-optionnelle-en-2025.html",
      "title": "Nouvelle Twingo, vieux problème : Renault persiste et signe avec la charge rapide en option",
      "summary": "Chez Renault, la charge rapide reste une option sur la Twingo fraîchement lancée. En 2025. Oui, vous avez bien lu, une décision qui a de quoi nous titiller assez pour en faire l'édito de la newsletter Watt Else du 13 novembre.",
      "published_ts": 1763277720,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1546027-cd1-detail-telephone-pirate/",
      "title": "Si ce détail s'affiche sur votre téléphone, il est infecté par un virus : voici comment le supprimer",
      "summary": "En 2024, des millions de téléphones ont été infectés par des virus, parfois il ne faut qu'un détail pour les repérer.",
      "published_ts": 1763272201,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1545995-rv1-fruits-et-legumes-frais-novembre/",
      "title": "Un ancien employé de supermarché révèle comment choisir les fruits et légumes les plus frais",
      "summary": "Avec plus de 30 ans d'expérience dans les rayons fruits et légumes, cet expert sait comment choisir les produits les plus frais.",
      "published_ts": 1763271902,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/pratique/virus-pc-les-12-techniques-gratuites-et-efficaces-pour-les-detecter-et-les-supprimer-485005.htm#xtor=RSS-1",
      "title": "Virus PC : Les 12 techniques gratuites et efficaces pour les détecter et les supprimer",
      "summary": "Les virus agissent désormais discrètement en arrière-plan, mais heureusement, des outils existent pour les stopper.",
      "published_ts": 1763266301,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/blogs/green-si/a-marseille-lia-europeenne-a-compte-ses-munitions-dans-cette-bataille-mondiale-484995.htm#xtor=RSS-1",
      "title": "A Marseille, l'IA européenne a compté ses munitions, dans cette bataille mondiale",
      "summary": "L'AIM 2025 à Marseille nous a rappelé que le combat était loin d'être perdu. Mais il ne sera gagné que si nous passons collectivement de la lucidité à l'action.",
      "published_ts": 1763255474,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118261-les-images-de-la-saison-4-de-bridgerton-intriguent-avec-un-choix-de-couleur-mysterieux-la-theorie-des-fans.html",
      "title": "Les images de la saison 4 de Bridgerton intriguent avec un choix de couleur mystérieux : voici la théorie des fans",
      "summary": "En attendant la prochaine saison de La Chronique des Bridgerton, les fans impatients se raccrochent aux rares images de Benedict et de Sophie déjà diffusées par Netflix. Une théorie émerge même sur un choix particulier de couleur.",
      "published_ts": 1763226000,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117171-test-de-winter-burrow-sur-xbox-series-x.html",
      "title": "Le jeu de survie Winter Burrow sent bon le chocolat chaud",
      "summary": "Avec son habillage adorable comme tout, Winter Burrow se définit comme un jeu de survie cosy. Son gameplay, effectivement, implique des mécaniques de survie, mais douces. Le jeu ne manque pas de charme. En revanche, on aurait aimé avoir une carte pour se repérer. Notre test.",
      "published_ts": 1763222460,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/sciences/2117391-luterus-artificiel-releve-de-la-s-f-aujourdhui-mais-des-recherches-existent-les-enjeux-sont-vertigineux.html",
      "title": "L’utérus artificiel relève de la S-F aujourd’hui, mais des recherches existent : les enjeux sont vertigineux",
      "summary": "Et si la gestation ou, du moins, une partie du processus, pouvait être externalisée au moyen de dispositifs extra-utérins, que ce soit pour poursuivre le développement de nouveau-nés prématurés ou pour des visées plus politiques, comme lutter contre la baisse des naissances ? Une telle technologie est encore très loin d’être réalisable, mais des recherches sont bel et bien menées dans ce domaine.",
      "published_ts": 1763217120,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lebigdata.fr/metroid-prime-4-le-trailer-gameplay-choque-tout-le-monde-le-vrai-banger-switch-2",
      "title": "Metroid Prime 4 : le trailer gameplay choque tout le monde ! Le vrai banger Switch 2 ?",
      "summary": "Personne ne s’attendait à ça. Le trailer de Metroid Prime 4 débarque avec une puissance inattendue et fait transpirer la … Cet article Metroid Prime 4 : le trailer gameplay choque tout le monde ! Le vrai banger Switch 2 ? a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763213691,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117807-4-series-a-voir-apres-last-samurai-standing-sur-netflix.html",
      "title": "4 séries à voir après Last Samurai Standing sur Netflix",
      "summary": "La dernière série japonaise de Netflix, qui met en scène une compétition mortelle avec option katanas, s'est directement hissée au sommet du top 10 dès sa sortie, le 13 novembre 2025. Pour continuer sur cette lancée sanglante, voici 4 séries comme Last Samurai Standing à voir en streaming.",
      "published_ts": 1763211660,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lemagit.fr/dessin/IA-sur-Kubernetes-les-analystes-epinglent-la-CNCF-face-a-lhegemonie-de-Nvidia",
      "title": "IA sur Kubernetes : les analystes épinglent la CNCF face à l’hégémonie de Nvidia",
      "summary": "<p>La CNCF positionne Kubernetes comme une infrastructure standard pour l’IA, mais les analystes s’interrogent sur le niveau de participation d’un acteur majeur de l’IA à son nouveau programme de conformité : Nvidia.</p> \n<p>&nbsp;&gt; Lire <a href=\"https://www.lemagit.fr/actualites/366634500/IA-sur-Kubernetes-les-analystes-epinglent-la-CNCF-face-a-lhegemonie-de-Nvidia\">l’article de Beth Pariseau et Gaétan Raoul</a><br><br></p>",
      "published_ts": 1763208180,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118943-la-peluche-la-plus-terrifiante-de-la-planete-va-debarquer-au-cinema.html",
      "title": "La peluche la plus terrifiante de la planète va débarquer au cinéma",
      "summary": "Après avoir conquis les cœurs de millions de fans à travers le monde, les jouets Labubu vont désormais envahir les salles de cinéma. Un film est ainsi actuellement sur les rails.",
      "published_ts": 1763207702,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/1949629-4-series-a-voir-apres-ghosts-fantomes-en-heritage-sur-tf1.html",
      "title": "4 séries à voir après Ghosts : Fantômes en héritage sur TF1",
      "summary": "Après une première diffusion en avril dernier, sur Disney+, l'adaptation française de Ghosts vient de débarquer sur TF1. Si vous avez déjà englouti les 6 épisodes de cette comédie avec Camille Chamoux et Bruno Sanches, voici 4 séries similaires à dévorer en streaming.",
      "published_ts": 1763206057,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118901-pluribus-sur-apple-tv-vous-pouvez-desormais-lire-le-vrai-roman-de-carol.html",
      "title": "Pluribus sur Apple TV : vous pouvez désormais lire le vrai roman de Carol",
      "summary": "L'anti-héroïne de la série Pluribus, Carol Sturka, était une autrice de romances de fantasy, avant d'assister à la fin du monde tel qu'elle le connaissait. Et bonne nouvelle : Apple a enfin mis en ligne un extrait de son livre fictif, Bloodsong of Wycaro.",
      "published_ts": 1763202310,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118881-gta-6-vient-de-battre-un-record-totalement-inattendu.html",
      "title": "GTA 6 vient de battre un record totalement inattendu",
      "summary": "Le jeu de Rockstar Games, dont la sortie a été maintes fois repoussée, a créé un immense engouement pour les fans. À tel point que le trailer de Grand Theft Auto VI a dépassé toutes les attentes.",
      "published_ts": 1763198016,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/2118465-fini-le-casse-tete-les-cartes-ticket-restaurant-conecs-edenred-sodexo-bimpli-arrivent-enfin-dans-apple-wallet.html",
      "title": "Fini le casse-tête : les cartes Ticket Restaurant Conecs (Edenred, Sodexo, Bimpli) arrivent enfin dans Apple Wallet",
      "summary": "Le réseau qui équipe la majorité des cartes titres-restaurant françaises pourrait devenir compatible nativement avec Apple Wallet. Une avancée attendue, qui mettrait fin à des années de bricolage technique et alignerait enfin les paiements TR sur les standards du mobile.",
      "published_ts": 1763188260,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.journaldunet.com/management/ressources-humaines/1546043-rv1-repos-hebdomadaire-travail/",
      "title": "Il travaille 12 jours de suite et dénonce une violation du Code du travail, la Cour de cassation donne raison à son employeur",
      "summary": "Ce salarié estimait que le temps de repos hebdomadaire n'était pas respecté. La Cour de cassation a donné une autre interprétation de la loi.",
      "published_ts": 1763185801,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/magazine/1546021-rv1-comment-regler-ses-phares-de-voiture/",
      "title": "Est-ce que vos phares éclairent correctement ? Vous pouvez le vérifier simplement sans aller au garage",
      "summary": "Ces simples vérifications permettent d'améliorer sa visibilité et de limiter les risques liés à l'obscurité hivernale.",
      "published_ts": 1763185502,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/guide-achat/est-ce-que-chatgpt-plus-vaut-toujours-ses-20-comparaison-avec-les-plans-free-et-pro-484938.htm#xtor=RSS-1",
      "title": "Est-ce que ChatGPT Plus vaut toujours ses 20$ ? Comparaison avec les abonnements Free et Pro",
      "summary": "Examinons tous les abonnements de ChatGPT pour voir si cela vaut la peine de payer, surtout quand l'abonnement gratuit offre tant de choses.",
      "published_ts": 1763176305,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1546047-mecenat-de-competences-les-3-erreurs-qui-tuent-l-engagement-collaborateur/",
      "title": "Mécénat de compétences : les 3 erreurs qui tuent l'engagement collaborateur",
      "summary": "Le mécénat de compétences explose en France. Selon le baromètre Admical 2024, 172 000 entreprises sont désormais mécènes, et 20% placent le mécénat de compétences dans leurs deux priorités pour les années à venir.",
      "published_ts": 1763154163,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1546041-les-fondateurs-qui-explosent-ne-se-contentent-plus-de-vendre-ils-deviennent-leur-propre-media/",
      "title": "Les fondateurs qui explosent ne se contentent plus de vendre, ils deviennent leur propre média",
      "summary": "Les entrepreneurs les plus visibles ne se distinguent plus seulement par leurs produits, mais par leur capacité à incarner leur vision et à créer une audience autour d'eux.",
      "published_ts": 1763154013,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/vie-personnelle/1546001-fetes-de-fin-d-annee-quand-la-solitude-s-invite-sous-le-sapin/",
      "title": "Fêtes de fin d'année :  quand la solitude s'invite sous le sapin",
      "summary": "Les fêtes de fin d'année sont censées rimer avec chaleur, retrouvailles, joie partagée. Pourtant, derrière les repas conviviaux, une autre réalité persiste : celle des solitudes.",
      "published_ts": 1763153946,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545989-quand-la-course-a-la-croissance-defie-le-climat-le-cas-revelateur-des-voyages-d-affaires/",
      "title": "Quand la course à la croissance défie le climat : le cas révélateur des voyages d'affaires",
      "summary": "Croissance économique et responsabilité environnementale peuvent-elles vraiment coexister ?",
      "published_ts": 1763153818,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545981-pourquoi-les-entreprises-se-tournent-elles-vers-le-temps-partage/",
      "title": "Pourquoi les entreprises se tournent-elles vers le temps partagé ?",
      "summary": "Dans une économie où l'incertitude freine les recrutements mais pas les besoins, le temps partagé s'impose comme une alternative à l'embauche classique.",
      "published_ts": 1763153565,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/commercial/1545955-gagnez-la-confiance-de-vos-prospects-grace-aux-relations-presse/",
      "title": "Gagnez la confiance de vos prospects grâce aux relations presse",
      "summary": "Etre visible n'est plus le nerf de la guerre, mais la confiance, oui. Vos prospects ne s'engagent plus à la légère et ont besoin de le faire en étant persuadés que vous êtes la bonne entreprise.",
      "published_ts": 1763153491,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/management/direction-generale/1545915-competitivite-la-bataille-se-gagne-desormais-dans-la-logistique/",
      "title": "Compétitivité : la bataille se gagne désormais dans la logistique",
      "summary": "Longtemps considérée comme un simple centre de coûts, la logistique s'impose aujourd'hui comme un facteur clé de compétitivité. Elle est devenue l'un des rares terrains où la promesse faite au client se joue concrètement.",
      "published_ts": 1763152767,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/cybersecurite/1546029-cyber-attaques-quand-investir-ne-protege-pas/",
      "title": "Cyberattaques : quand investir ne protège pas",
      "summary": "Les petites et moyennes entreprises (PME), les entreprises de taille intermédiaire (ETI) et les collectivités locales sont les premières cibles des cybercriminels. Pourtant, certaines se pensaient bien protégées. Comment expliquer ce phénomène ?",
      "published_ts": 1763144888,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.numerama.com/tech/2116911-on-a-vu-la-balance-connectee-de-mcdonalds-pour-ne-plus-jamais-oublier-vos-potatoes-reportage-video.html",
      "title": "On a vu la balance connectée de McDonald’s pour ne plus jamais oublier vos potatoes (reportage vidéo)",
      "summary": "VIDÉO - Pour réduire la quantité de burgers et frites oubliés dans les sacs, McDonald's va déployer en France dès 2026 une balance « intelligente » au bout de ses lignes de préparation. Numerama est allé à la rencontre de ses concepteurs pour voir, en vrai, comment ça marche.",
      "published_ts": 1763141964,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/1872550-lodyssee-tout-savoir-sur-le-film-de-christopher-nolan.html",
      "title": "L’Odyssée : date de sortie, casting… Tout savoir sur le film de Christopher Nolan",
      "summary": "Le réalisateur des films cultes Interstellar et Oppenheimer est lancé dans un nouveau projet de grande ampleur : une adaptation de L'Odyssée, du poète Homère. Date de sortie, casting, intrigue... Voici tout ce que l'on sait déjà sur ce long-métrage forcément épique.",
      "published_ts": 1763138975,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/vroom/1048900-quelles-sont-les-meilleures-voitures-electriques-a-louer-a-partir-de-100-e-par-mois.html",
      "title": "LOA et LLD voiture électrique : les meilleures offres de leasing à saisir avant la fin de l’année",
      "summary": "Les Locations Longue Durée (LLD) ou Locations avec Option d'Achat (LOA) sont de bonnes alternatives pour acquérir une nouvelle voiture électrique. Beaucoup de constructeurs intègrent des offres de leasing attractives pour leurs modèles 100 % électrique. Profitez des meilleures offres des deux derniers mois de l'année.",
      "published_ts": 1763135832,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/2118057-uber-lance-uber-ski-pour-simplifier-lacces-aux-stations-cet-hiver.html",
      "title": "Uber lance « Uber Ski » pour simplifier l’accès aux stations cet hiver",
      "summary": "Uber a annoncé déployer « Uber Ski », un service qui permet de rejoindre 40 stations de ski avec un véhicule adapté au matériel. Un partenariat avec Vail Resorts permet même de réserver trajets et forfaits directement depuis l’application. En France, le service est en cours de déploiement.",
      "published_ts": 1763134372,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/cyberguerre/2117929-nombre-de-victimes-ignoraient-linfection-de-leur-systeme-la-france-et-10-autres-pays-neutralisent-un-immense-reseau-cybercriminel.html",
      "title": "« Nombre de victimes ignoraient l’infection de leur système » : la France et 10 autres pays  neutralisent un immense réseau cybercriminel",
      "summary": "Du 10 au 13 novembre 2025, Europol a mené la dernière phase de l'opération Endgame. Les cibles de cet ultime coup de filet ? Le logiciel espion Rhadamanthys, le botnet Elysium et le cheval de Troie VenomRAT. Ce démantèlement est le fruit d'une collaboration entre 11 pays.",
      "published_ts": 1763133543,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118149-netflix-lance-des-jeux-sur-tv-pour-les-soirees-entre-amis-comment-y-acceder.html",
      "title": "Netflix lance des jeux sur TV pour les soirées entre amis, comment y accéder ?",
      "summary": "Netflix officialise Game Night, un service pour jouer sur son téléviseur avec ses amis ou sa famille. Le concept : des jeux en multijoueur apparaissent sur le grand écran et chaque joueur utilise son smartphone pour interagir avec la TV ou recevoir des informations privées. Une approche originale qui pourrait trouver son public.",
      "published_ts": 1763133054,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.journaldunet.com/cloud/1546039-20-terrains-de-football-les-coulisses-du-data-center-geant-de-ntt-dans-l-essonne/",
      "title": "20 terrains de football : les coulisses du data center géant de NTT dans l'Essonne",
      "summary": "Le centre de données devrait sortir de terre d'ici 2030. Il s'étendra sur une surface de 14,6 hectares.",
      "published_ts": 1763131827,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.numerama.com/vroom/2118175-ce-constructeur-chinois-lancera-bientot-une-voiture-electrique-avec-1-000-km-dautonomie-grace-a-une-batterie-solide.html",
      "title": "Ce constructeur chinois lancera bientôt une voiture électrique avec 1 000 km d’autonomie grâce à une batterie solide",
      "summary": "Le groupe chinois Dongfeng s'apprête à intégrer une batterie solide dans ses voitures électriques dès septembre 2026. L'autonomie promise dépasserait les 1 000 km.",
      "published_ts": 1763131465,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/sciences/2117995-cette-photo-dun-parachutiste-tombant-devant-le-soleil-est-a-peine-croyable.html",
      "title": "Cette photo d’un parachutiste tombant devant le Soleil est à peine croyable",
      "summary": "Un spectaculaire cliché du Soleil a été partagé par l'astrophotographe Andrew McCarthy. Ce passionné d'espace a immortalisé le saut en parachute d'un ami, avec pour arrière-plan la surface détaillée de l'étoile.",
      "published_ts": 1763129652,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/vroom/2117883-xiaomi-preparerait-une-version-restylee-de-la-berline-su7-et-il-y-aurait-une-mauvaise-surprise.html",
      "title": "Xiaomi préparerait une version restylée de la berline SU7 et il y aurait une mauvaise surprise",
      "summary": "Des photos espion ont fait surface, suggérant une version restylée de la Xiaomi SU7. En plus de quelques changements esthétiques, la marque chinoise prévoirait des évolutions techniques, mais également une hausse de prix.",
      "published_ts": 1763126733,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117919-le-potentiel-goty-clair-obscur-expedition-33-passe-sous-les-35-e-pour-le-pre-black-friday.html",
      "title": "Le potentiel GOTY Clair Obscur : Expedition 33 passe sous les 35 € pour le pré-Black Friday",
      "summary": "[Deal du jour] Vous n'avez pas encore touché au RPG de l'année ? C'est peut-être le bon moment avec cette réduction de 15 € pour le Black Friday.",
      "published_ts": 1763123640,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/sciences/2117951-la-capsule-shenzhou-20-est-trop-dangereuse-que-va-t-il-lui-arriver.html",
      "title": "La capsule Shenzhou 20 est trop dangereuse, que va-t-il lui arriver ?",
      "summary": "L'équipage de Shenzhou 20 est rentré avec la capsule Shenzhou 21. La capsule Shenzhou 20, elle, n'est plus jugée sûre. Que va-t-il advenir de ce vaisseau spatial ? Et quid pour l'équipage de Shenzhou 21 ?",
      "published_ts": 1763122500,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.zdnet.fr/actualites/je-suis-un-inconditionnel-de-photoshop-mais-les-nouveaux-outils-gratuits-de-canva-mont-conquis-et-mont-permis-deconomiser-35-dollars-par-mois-484891.htm#xtor=RSS-1",
      "title": "Je suis un inconditionnel de Photoshop, mais les nouveaux outils gratuits de Canva m'ont conquis - et m'ont permis d'économiser 35 dollars par mois",
      "summary": "Les limites de l'abonnement à Adobe et l'avarice de son IA m'ont poussé à laisser tomber. Canva offre liberté, flexibilité et de sérieuses économies à la clé. Voyez si vous avez intérêt à changer pour vous aussi.",
      "published_ts": 1763122260,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/vous-pouvez-desormais-transformer-des-enormes-pdf-en-syntheses-audio-plutot-digestes-dans-google-drive-voici-comment-484888.htm#xtor=RSS-1",
      "title": "Vous pouvez désormais transformer des énormes PDF en synthèses audio plutôt digestes dans Google Drive - voici comment",
      "summary": "De quoi écouter deux animateurs dynamiques discuter d'une sujet que vous pourriez trouver ennuyeux. Merci l'IA.",
      "published_ts": 1763118717,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/vous-travaillez-dans-lindustrie-ce-que-lia-difs-et-anthropic-peut-vraiment-changer-dans-vos-usines-484900.htm#xtor=RSS-1",
      "title": "Vous travaillez dans l’industrie ? Ce que l’IA d’IFS et Anthropic peut vraiment changer dans vos usines",
      "summary": "Pour la société suédoise, l'IA Générative \"grand public\", voire celle des \"cols blancs\" (résumés d'email, rédaction de dosuments d'étape,...) n'est pas faite pour le monde de l'industrie.",
      "published_ts": 1763118685,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/tech/2117783-amazon-leo-est-le-nouveau-nom-du-plus-grand-concurrent-de-starlink-amazon-mise-sur-les-satellites-basse-orbite.html",
      "title": "Amazon Leo est le nouveau nom du plus grand concurrent de Starlink : Amazon mise sur les satellites basse orbite",
      "summary": "Amazon Kuiper, le concurrent du Starkink d'Elon Musk, change de nom. Amazon s'apprête à lancer la phase commerciale et le renomme « Amazon Leo », avec désormais 150 satellites en orbite (contre 10 000 pour Starlink).",
      "published_ts": 1763118544,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/politique/2117827-litalian-brainrot-tung-tung-sahur-est-au-coeur-dune-bataille-juridique-sur-le-droit-dauteur.html",
      "title": "L’italian brainrot Tung Tung Sahur est au cœur d’une bataille juridique sur le droit d’auteur",
      "summary": "Personnage d’IA devenu viral depuis février 2025, Tung Tung Sahur est à la fois l’objet d’une exposition parisienne et au centre d’un bras de fer juridique. Mementum Lab, représentant le tiktokeur Noxaasht, réclame des droits sur ce mème massivement réutilisé, relançant la question de la propriété intellectuelle appliquée aux contenus générés.",
      "published_ts": 1763116688,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/2104829-black-friday-les-meilleures-promotions-du-14-novembre.html",
      "title": "Black Friday : suivez en direct les offres qui méritent vraiment votre argent chez Amazon, Boulanger…",
      "summary": "Chaque année, les promos du Black Friday arrivent un peu plus tôt… et 2025 ne déroge pas à la règle. Depuis le début du mois (et même un peu avant), les enseignes multiplient les réductions. Dans cette masse de prix barrés, on trouve déjà de belles offres sur des produits très recherchés. Voici celles que l’on a repérées.",
      "published_ts": 1763116503,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.journaldunet.com/adtech/1546031-marche-publicitaire-francais-le-ralentissement-s-accentue-sur-les-neuf-mois-de-2025/",
      "title": "Marché publicitaire français : le ralentissement s'accentue sur les neuf mois de 2025",
      "summary": "Les recettes nettes sur la période sont en hausse de 2,1% comparé à 2024, selon le Bump dévoilé ce 14 novembre. La presse, la TV et l'affichage extérieur enregistrent des baisses importantes.",
      "published_ts": 1763114592,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.zdnet.fr/actualites/avec-endgame-europol-poursuit-son-travail-de-sape-contre-les-cybercriminels-484881.htm#xtor=RSS-1",
      "title": "Avec Endgame, Europol poursuit son travail de sape contre les cybercriminels",
      "summary": "La coalition policière menée par Europol vient de s’attaquer à un infostealer, un cheval de Troie et un botnet.",
      "published_ts": 1763111502,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/comment-les-centres-de-donnees-diy-danthropic-pourraient-accelerer-la-frenesie-des-infrastructures-dia-484915.htm#xtor=RSS-1",
      "title": "Comment les centres de données DIY d'Anthropic pourraient accélérer la frénésie des infrastructures d'IA",
      "summary": "Un expert estime que cette approche deviendra le prochain facteur déterminant dans la course à l'IA, du moins pour les entreprises qui peuvent se le permettre.",
      "published_ts": 1763111488,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/orano-teste-hoxo-un-robot-augmente-par-lia-pour-les-installations-nucleaires-484855.htm#xtor=RSS-1",
      "title": "Orano teste Hoxo, un robot augmenté par l'IA pour les installations nucléaires",
      "summary": "En collaboration avec Capgemini, l’industriel du nucléaire Orano mène sur 4 mois une phase d’essais du “robot humanoïde intelligent” Hoxo. L’ambition : contribuer par l’assistance robotique à l’amélioration de la performance industrielle et au soutien des opérateurs.",
      "published_ts": 1763111469,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/pourquoi-windows-est-un-systeme-dexploitation-mediocre-et-comment-y-remedier-selon-cet-ancien-ingenieur-de-microsoft-484912.htm#xtor=RSS-1",
      "title": "Pourquoi Windows est un système d'exploitation médiocre et comment y remédier, selon cet ancien ingénieur de Microsoft",
      "summary": "Le développeur du Gestionnaire des tâches estime que Windows est devenu un outil marketing, alors même que le président de Microsoft se vante d’en faire un système d'exploitation plus interactif.",
      "published_ts": 1763107895,
      "source_name": "ZDNet France"
    }
  ],
  "news_general": [
    {
      "url": "https://www.lebigdata.fr/darwin-monkey-le-cerveau-dun-macaque-dans-un-superordinateur",
      "title": "Darwin Monkey, le cerveau d’un macaque dans un superordinateur",
      "summary": "Imaginez un cerveau de primate transposé dans une machine. En Chine, une équipe de chercheurs a conçu un superordinateur qui … Cet article Darwin Monkey, le cerveau d’un macaque dans un superordinateur a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763301600,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/xchat",
      "title": "XChat, la nouvelle arme de X (anciennement Twitter) pour concurrencer WhatsApp et Telegram",
      "summary": "Depuis juin 2025, XChat remplace les messages privés de X. Le service propose des appels vidéo, l’envoi de gros fichiers … Cet article XChat, la nouvelle arme de X (anciennement Twitter) pour concurrencer WhatsApp et Telegram a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763219640,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/positron-ai-atlas-le-game-changer-tant-attendu",
      "title": "Positron AI Atlas : le game changer tant attendu ?",
      "summary": "Et si un serveur IA consommait trois fois moins d’énergie qu’un DGX H200 de NVIDIA ? C’est la promesse de … Cet article Positron AI Atlas : le game changer tant attendu ? a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763215200,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/nordvpn-black-friday",
      "title": "NordVPN Black Friday : l’excellence de la cybersécurité à prix choc",
      "summary": "La promo NordVPN Black Friday est enfin là ! Une période courte, mais explosive : l’occasion parfaite de sécuriser votre … Cet article NordVPN Black Friday : l’excellence de la cybersécurité à prix choc a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763215200,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.zdnet.fr/pratique/comment-les-tpe-peuvent-survivre-a-larrivee-des-achats-en-ligne-par-lia-7-etapes-essentielles-484935.htm#xtor=RSS-1",
      "title": "Comment les TPE peuvent survivre à l'arrivée des achats en ligne par l'IA ? 7 étapes essentielles",
      "summary": "Avec les agents d'achat IA qui changent tranquillement notre façon d'acheter, les PME et les TPE doivent s'adapter rapidement sous peine de devenir invisibles en ligne.",
      "published_ts": 1763208695,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lebigdata.fr/rapport-crowdstrike-2025-autopsie-dune-europe-assiegee-par-le-cybercrime",
      "title": "Rapport CrowdStrike 2025 : autopsie d’une Europe assiégée par le cybercrime",
      "summary": "L’Europe vit une période d’hyper-tension numérique. Le rapport 2025 de CrowdStrike dresse un constat limpide : jamais les cybermenaces n’ont … Cet article Rapport CrowdStrike 2025 : autopsie d’une Europe assiégée par le cybercrime a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763147172,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.journaldunet.com/economie/sante/1546053-la-tech-et-les-investisseurs-se-ruent-sur-le-marche-de-la-fertilite-par-l-ia/",
      "title": "La tech et les investisseurs se ruent sur le marché de la fertilité par l'IA",
      "summary": "Face à la crainte d'un hiver démographique, un nombre croissant d'entrepreneurs misent sur les nouvelles technologies, et en particulier l'IA, pour aider les couples qui veulent des enfants.",
      "published_ts": 1763138500,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.lebigdata.fr/vous-ne-croirez-pas-ces-nouvelles-fonctions-ia-sur-google-photos",
      "title": "Vous ne croirez pas ces nouvelles fonctions IA sur Google Photos !",
      "summary": "Grâce à Nano Banana, Google Photos déploie six nouvelles fonctions IA. Avec elles, on peut éditer, transformer et explorer vos … Cet article Vous ne croirez pas ces nouvelles fonctions IA sur Google Photos ! a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763137800,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/elle-achete-un-jouet-ia-a-son-fils-de-5-ans-il-lui-apprend-a-craquer-des-allumettes",
      "title": "Elle achète un jouet IA à son fils de 5 ans : il lui apprend à craquer des allumettes",
      "summary": "Un jouet IA destiné à un enfant de 5 ans lui apprend à manipuler des allumettes et des objets dangereux … Cet article Elle achète un jouet IA à son fils de 5 ans : il lui apprend à craquer des allumettes a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763135136,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.journaldunet.com/publishers/1546045-les-editeurs-de-la-presse-magazine-reclament-l-adoption-urgente-d-un-mecanisme-de-presomption-d-utilisation-massive-des-donnees-par-les-ia/",
      "title": "Julie Lorimy (SEPM) : \"Les éditeurs de la presse magazine réclament l'adoption urgente d'un mécanisme de présomption d'utilisation massive des données par les IA\"",
      "summary": "La directive sur les droits voisins seule ne suffit pas pour sauver le modèle économique des éditeurs de presse face aux LLM, selon Julie Lorimy, directrice générale du Syndicat des éditeurs de la presse magazine (SEPM).",
      "published_ts": 1763131398,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2118155-il-y-a-un-nouveau-pikachu-et-il-est-beaucoup-trop-mignon.html",
      "title": "Il y a un nouveau Pikachu, et il est beaucoup trop mignon",
      "summary": "Nintendo a partagé une nouvelle bande-annonce pour Pokémon Pokopia, sa simulation de vie « détente » basée sur l'univers des créatures à capturer. Il s'agit d'une longue présentation qui se termine sur l'apparition d'un nouveau Pikachu, encore plus mignon que le Pikachu original.",
      "published_ts": 1763131152,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lebigdata.fr/13-milliards-voles-a-la-chine-par-les-usa-le-bitcoin-de-la-discorde",
      "title": "13 milliards $ volés à la Chine par les USA ? Le Bitcoin de la discorde",
      "summary": "La Chine accuse les USA d’avoir dérobé 127 000 bitcoins, issus d’un hack en 2020 contre un pool de minage … Cet article 13 milliards $ volés à la Chine par les USA ? Le Bitcoin de la discorde a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763130921,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/seedance-de-bytedance-reinvente-la-generation-video-par-ia",
      "title": "Seedance de ByteDance réinvente la génération vidéo par IA",
      "summary": "Le text-to-video 1080p fluide n’est plus un privilège pour l’élite. ByteDance impose Seedance comme une réponse directe aux modèles dominants … Cet article Seedance de ByteDance réinvente la génération vidéo par IA a été publié sur LEBIGDATA.FR .",
      "published_ts": 1763128800,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://blog.octo.com/du-dataset-jetable-au-data-product-perenne--comment-le-data-mesh-transforme-notre-rapport-a-la-donnee",
      "title": "Du dataset jetable au data product pérenne : comment le data mesh transforme notre rapport à la donnée",
      "summary": "Dans les organisations où les données sont nombreuses, hétérogènes et stratégiques, leur mise à disposition efficace devient un levier clé de performance. L’approche data mesh, en décentralisant la gouvernance et en traitant la donnée comme un produit, promet une meilleure agilité et une appropriation renforcée par les équipes métier.",
      "published_ts": 1763126418,
      "source_name": "OCTO Talks!"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634576/Cyberhebdo-du-14-novembre-2025-deux-radio-diffuseurs-touches",
      "title": "Cyberhebdo du 14 novembre 2025 : deux radio-diffuseurs touchés",
      "summary": "<p>La semaine écoulée a une nouvelle fois été marquée par une activité soutenue sur le front des cybermenaces, avec 8 cyberattaques rapportées dans les médias internationaux.</p> \n<p>Les incidents recensés concernent un large éventail de pays, parmi lesquels le Pérou (PER), l’Allemagne (DEU), l’Autriche (AUT), les Pays-Bas (NLD), le Brésil (BRA), le Royaume-Uni (GBR), le Mexique (MEX) et les États-Unis (USA).</p> \n<p>Cette revue de presse revient en détail sur chacun de ces événements marquants, afin de mieux comprendre les tendances et les enjeux actuels en matière de cybersécurité à l’échelle mondiale.</p> \n<p>Nous vous rappelons que notre revue de presse se concentre sur les cyberattaques significatives et ne traite pas des attaques DDoS ni des défigurations de sites Web.</p> \n<p>07/11/2025 - <b>woom GmbH</b> (AUT)<br>Le fabricant de cycles woom GmbH a été victime d'une attaque cybernétique le 7 novembre 2025, mais a pu rapidement réagir et limiter les dégâts avec l'aide d'un expert en cybersécurité. Les informations des clients pourraient avoir été compromises, mais pas les données sensibles. L'entreprise continue d'investir dans les normes de sécurité les plus modernes pour protéger ses systèmes et données. (<a href=\"https://www.presseportal.de/pm/136027/6158820\">source</a>)</p> \n<p>07/11/2025 - <b>Checkout.com</b> (GBR)<br>Checkout.com a été ciblée par une tentative d'extorsion criminelle, les attaquants ont accédé à un système de stockage de fichiers cloud tiers patrimonial, mais le traitement des paiements en direct n'a pas été impacté. Aucun fonds de marchand ni numéro de carte n'a été accédé. L'entreprise fait don du montant du ransom à des universités pour financer la recherche sur la cybercriminalité. (<a href=\"https://www.checkout.com/blog/protecting-our-merchants-standing-up-to-extortion\">source</a>)</p> \n<p>08/11/2025 - <strong>Procureur général de l'État de Guanajuato</strong>&nbsp;(MEX)<br>Le procureur général de l'État de Guanajuato&nbsp;a été victime d'une attaque de ransomware attribuée au groupe de hackers Tekir APT, qui a compromis ses systèmes informatiques et exposé des informations confidentielles. Les attaquants ont exigé un paiement en échange de la non-divulgation des données volées. L'institution a confirmé l'incident et a pris des mesures pour contenir les dégâts. (<a href=\"https://www.infobae.com/mexico/2025/11/11/fiscalia-de-guanajuato-sufre-ciberataque-vulneran-expedientes-y-datos-confidenciales-en-250-gb-robados-por-hackers/\">source</a>)</p> \n<p>09/11/2025 - <b>Radio Nordseewelle</b> (DEU)<br>Radio Nordseewelle a été victime d'une attaque de piratage informatique qui a endommagé une grande partie de son infrastructure technique, mais le service a pu être rétabli grâce à l'engagement de l'équipe et à l'aide de partenaires régionaux. Les enquêtes techniques ont révélé qu'il s'agissait d'une attaque ciblée et professionnelle. Le service a été rétabli et les systèmes ont été réaménagés pour améliorer la sécurité. (<a href=\"https://www.radioszene.de/207744/radio-nordseewelle-hackerangriff.html\">source</a>)</p> \n<p>10/11/2025 - <b>Arabella</b> (DEU)<br>Les radios Arabella München et Arabella Bayern ont subi un cyberattaque ciblée, mais grâce à leur équipe, le service de diffusion a pu être maintenu. Les systèmes ont été restaurés après trois jours de travail. Les experts ont sécurisé les traces numériques de l'intrusion. (<a href=\"https://www.new-business.de/_rubric/detail.php?rubric=MEDIEN&amp;nr=829799\">source</a>)</p> \n<p>10/11/2025 - <b>Valley View ISD</b> (USA)<br>Le district scolaire Valley View ISD à Pharr, au Texas, a signalé une incident de cybersécurité qui a perturbé les systèmes informatiques et les lignes téléphoniques, mais les cours se poursuivent et les élèves et le personnel sont en sécurité. Le district n'a pas précisé la nature de l'incident ou si des données ont été compromises. Les parents sont invités à surveiller les canaux officiels pour obtenir des mises à jour pendant les travaux de réparation. (<a href=\"https://dysruptionhub.com/valley-view-isd-cyber-incident-texas/\">source</a>)</p> \n<p>12/11/2025 - <b>Sunafil</b> (PER)<br>La Superintendence Nacional de Fiscalisation Laboral (Sunafil) a confirmé un incident de cybersécurité et a activé un plan de contingence pour protéger les informations institutionnelles. Les systèmes internes ont été désactivés et les employés ont été invités à ne pas utiliser les systèmes informatiques jusqu'à nouvel ordre. Les opérations de l'entité se poursuivent via des canaux alternatifs. (<a href=\"https://www.expreso.com.pe/actualidad/sunafil-confirma-ataque-cibernetico-y-activa-plan-de-contingencia-que-paso-y-que-medidas-se-tomaron-mtpe-mtc-jnj-noticia/1239213/\">source</a>)</p> \n<p>12/11/2025 - <b>Cabedelo</b> (BRA)<br>La mairie de Cabedelo a subi un attaque cibernétique, mais a pris des mesures pour assurer la sécurité et la continuité des services publics. Les autorités ont renforcé la sécurité dans toutes les secretarias et les organes municipaux. Aucun service essentiel n'a été interrompu et les actions sont menées de manière transparente et responsable. (<a href=\"https://cabedelo.pb.gov.br/nota-ataque-cibernetico-aos-computadores-da-semas/\">source</a>)</p> \n<p><i>Revue de presse réalisée en partie avec ChatGPT. <a href=\"https://www.lemagit.fr/actualites/365535799/Cyberhebdo-LeMagIT-met-lIA-au-service-de-linformation-de-ses-lecteurs\">Les explications sont à lire ici</a>.</i></p>",
      "published_ts": 1763122500,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-14-11-2025-un-robot-humanoide-pour-le-nucleaire-europol-contre-les-cybercriminels-un-ex-microsoft-leve-le-voile-484919.htm#xtor=RSS-1",
      "title": "ZDNET Morning 14/11/2025 : Un robot humanoïde pour le nucléaire, Europol contre les cybercriminels, Un ex-Microsoft lève le voile,...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1763122302,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/pop-culture/2117667-les-joueurs-revent-de-red-dead-redemption-2-sur-ps5-donc-rockstar-ressort-le-1.html",
      "title": "Les joueurs rêvent de Red Dead Redemption 2 sur PS5, donc Rockstar ressort le 1",
      "summary": "Rockstar Games a officialisé l'arrivée du premier Red Dead Redemption sur PS5, Xbox Series S, Xbox Series X, Nintendo Switch 2, Android, iOS et Netflix.",
      "published_ts": 1763115972,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634440/ERP-Cloud-le-groupe-Leonhart-partage-son-bilan-apres-trois-ans-en-production",
      "title": "ERP cloud : le groupe Leonhart partage son bilan après trois ans en production",
      "summary": "<p>Né en 1920 à Sélestat en Alsace, le groupe Les Sablières J.&nbsp;Leonhart s’est d’abord spécialisé dans l’extraction du sable, des concassés et des granulats. Puis, il s’est lancé, à partir des années&nbsp;1960, dans la fabrication de béton. En 2000, il ajoute à ses deux activités la vente de pierres naturelles. L’année suivante, le groupe crée Transports Leonhart, une filiale consacrée au déplacement de ses propres matériaux et ceux des autres. Une cinquantaine de véhicules parcourent majoritairement le grand Est, l’Allemagne et la Suisse. Enrobés, pavés autobloquants pour l’aménagement extérieur, le groupe Les Sablières J.&nbsp;Leonhart a ainsi décliné son activité autour du béton.</p> \n<p>Le groupe compte aujourd’hui près de 600&nbsp;salariés rattachés à 17&nbsp;sites. Il a extrait plus de 980&nbsp;000&nbsp;tonnes de granulats, livré plus de 100&nbsp;000&nbsp;mètres cubes de béton. Il réalise un chiffre d’affaires annuel proche des 140&nbsp;millions d’euros.</p> \n<p>Cette évolution, à travers des cycles de croissance externe, a un revers. Il y a six ans, l’entreprise sent qu’elle est dépassée par l’hétérogénéité de son système d’information, composé de nombreux outils spécifiques.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Un gros grain de sable dans l’activité : l’ERP legacy\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Un gros grain de sable dans l’activité&nbsp;: l’ERP legacy</h2>\n <p>Il faut unifier et standardiser les processus métier cœurs. Mettre en place une plateforme commune aux entités du groupe. D’autant plus que son ERP était devenu un gros grain de sable dans les rouages de son activité.</p>\n <p>Le DSI a défini un cahier des charges avant de démarcher les intégrateurs.</p>\n <p>«&nbsp;Nous avons décidé d’harmoniser notre système d’information au travers d’un nouvel ERP autour duquel nous pourrions structurer nos processus, tout en améliorant la qualité de nos données&nbsp;», <a href=\"https://www.youtube.com/watch?v=mH6tEF1vB4o\">expliquait</a> Nicolas Battesti, directeur administratif et financier du groupe Leonhart en 2023. «&nbsp;Nous cherchions une solution pérenne, capable de nous accompagner dans le temps. Une offre qui soit accessible sur tous nos sites en sécurité et pour un coût connu à l’avance&nbsp;».</p>\n <p>Différentes solutions disponibles sur le marché sont étudiées à travers un appel d’offres lancé à la fin de l’année&nbsp;2020.</p>\n <p>Le groupe Leonhart arrête son choix <a href=\"https://www.lemagit.fr/conseil/SAP-bien-comprendre-les-differences-entre-les-5-versions-de-S-4HANA\">sur S/4HANA Public Cloud</a>. La promesse d’une plus grande simplicité de mise à jour en mode <a href=\"https://www.lemagit.fr/definition/SaaS\">SaaS</a> et la possibilité de s’appuyer sur des processus standards séduisent les parties prenantes du projet.</p>\n <p>Pour la mise en place, il fait appel à Nagarro, un intégrateur allemand doté d’une entité française, basée à Entzheim, une ville située à un peu moins de 40&nbsp;km de Sélestat. «&nbsp;La présence du prestataire en Alsace était un critère de choix&nbsp;», souligne Nicolas Battesti lors d’une présentation se déroulant dans le cadre <a href=\"https://www.lemagit.fr/actualites/366633559/ERP-Cloud-la-necessaire-transformation-des-centres-de-competence-SAP\">de la convention USF 2025, à Lyon</a>.</p>\n <p>Les premiers ateliers sont lancés en février 2021. Il s’agit d’analyser avec les équipes de l’intégrateur et des «&nbsp;utilisateurs clés&nbsp;» le degré de pertinence des processus standards proposés par SAP. Une démarche «&nbsp;fit to standard&nbsp;» est lancée. Les processus liés à l’extraction, le négoce, la finance, aux achats, le contrôle de gestion, la logistique, la relation client doivent être couverts par l’ERP cloud.</p>\n <p>En revanche, pour la gestion de ses ponts-bascules, Leonhart demande à Nagarro de lui développer une application spécifique. Elle est hébergée sur la <a href=\"https://www.lemagit.fr/conseil/Le-sort-des-specifiques-dans-SAP-Business-Technology-Platform-BTP\">plateforme SAP BTP</a>. Il s’agit d’automatiser la pesée des camions à l’aide de l<a href=\"https://www.lemagit.fr/definition/Internet-des-objets-IoT\">’IoT</a> de la <a href=\"https://www.lemagit.fr/definition/Vision-par-ordinateur-machine-vision-computer-vision\">vision par ordinateur</a>. Un autre spécifique permet de gérer la création des bons de livraison et la facturation automatique.</p>\n <p>«&nbsp;L’ancien ERP ne donnait plus satisfaction aux utilisateurs finaux. C’est ce qui a permis une adoption rapide du projet&nbsp;», affirme Nicolas Battesti. «&nbsp;De ce fait, nous n’avons pas eu de grande difficulté sur la conduite du changement&nbsp;». Environ 80&nbsp;employés ont accès à S/4HANA Public Cloud. Une campagne de formation a été menée lors des derniers mois du déploiement.</p>\n <p>Deuxième facteur de réussite, le soutien de la direction. «&nbsp;Le fait que la direction soit impliquée et motrice a vraiment aidé&nbsp;», assure le DAF. «&nbsp;De plus, nous avons eu beaucoup de soutien de la part de SAP et de notre prestataire Nagarro&nbsp;».</p>\n</section>           \n<section class=\"section main-article-chapter\" data-menu-title=\"Le nécessaire redressement des données\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Le nécessaire redressement des données</h2>\n <p>Néanmoins, il a fallu faire face à quelques difficultés. «&nbsp;L’implémentation a duré quatorze mois. Nous devions normalement en mettre dix&nbsp;», indique Nicolas Battesti. Le go live a été réalisé&nbsp;le 2&nbsp;mai 2022. L’ancien ERP a été maintenu jusqu’en avril. Seules les balances comptables ont été transférées vers S/4HANA Public Cloud.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Nous avons beaucoup travaillé sur la mise à jour de nos bases de données. C’est l’un des points les plus difficiles sur le projet&nbsp;».\n   </figure>\n   <figcaption>\n    <strong>Nicolas Battesti</strong>Directeur administratif et financier, groupe Leonhart\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Parmi les points qui ont freiné le déploiement, les données. «&nbsp;Nous nous sommes rendu compte aux premiers UAT [tests de validation utilisateurs, N.D.L.R.] que la qualité des données à notre disposition n’était pas au rendez-vous&nbsp;», constate Nicolas Battesti. «&nbsp;Nous avons beaucoup travaillé sur la mise à jour de nos bases de données. C’est l’un des points les plus difficiles sur le projet&nbsp;».</p>\n <p>Le déploiement en mode projet de <a href=\"https://www.lemagit.fr/definition/ERP-cloud\">l’ERP cloud</a>, par nature interdisciplinaire, était également une grande première pour l’ETI familiale. «&nbsp;Ce n’était pas habituel pour le groupe. Malgré la volonté de la direction, cela a pris un peu de temps à se mettre en place, à décloisonner les équipes afin de provoquer une émulsion&nbsp;», note le DAF.</p>\n <p>Enfin, les utilisateurs clés, la plupart étant des experts métier, ont été remplacés tardivement quand ils étaient mobilisés sur l’adoption de l’ERP cloud.</p>\n <p>«&nbsp;Pour l’avoir fait avec ECC par le passé, je craignais que nous n’y arrivions pas en dix mois. Finalement, quatorze mois, c’est tout à fait honorable&nbsp;», se félicite Nicolas Battesti. «&nbsp;Nous avons tout de même réalisé un big bang sur tous nos métiers, dans tous nos processus&nbsp;».</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"Des processus standards qui ont fait leurs preuves\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des processus standards qui ont fait leurs preuves</h2>\n <p>Le jour J, un lundi, le directeur administratif et financier s’attendait à être submergé d’appels. «&nbsp;Le go live s’est plutôt bien passé. Les processus de base ont fonctionné. Nous avons utilisé quelques bons papiers pour des opérations que nous n’avions pas imaginées ou qui bloquaient un peu&nbsp;», raconte-t-il. «&nbsp;Je suis rentré chez moi en me disant&nbsp;: “ce n’est pas grave, ça cassera demain”. Le lendemain, rien. Et ce fut comme cela le reste de la semaine&nbsp;».</p>\n <p>Les processus standards éprouvés par SAP et ses clients ont globalement tenu.</p>\n <p>«&nbsp;Nous avons tout de même vécu une période de stabilisation d’environ neuf mois&nbsp;», signale Nicolas Battesti. «&nbsp;Des petites choses ici ou là ne fonctionnaient pas comme prévu. Après cette période, nous avons diminué nos appels à Nagarro&nbsp;».</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Nous avons beaucoup de discussions très intéressantes avec les opérationnels, depuis que nous récoltons les données plus rapidement dans notre système&nbsp;».\n   </figure>\n   <figcaption>\n    <strong>Nicolas Battesti</strong>Directeur administratif et financier, groupe Leonhart\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>La quantité de tickets relative au déploiement «&nbsp;commençait à décroître de manière importante&nbsp;». L’intégrateur d’origine allemande est resté le prestataire des Sablières après la fin du projet. «&nbsp;Cela se passe bien avec Nagarro, nous n’avons pas de raison de changer&nbsp;».</p>\n <p>Et trois ans plus tard&nbsp;? «&nbsp;Aujourd’hui, nos processus sont stables&nbsp;», note le DAF. «&nbsp;Cela a apporté une forme de rigueur dans nos équipes. Les données sont plutôt fiables et comme nous avons eu du mal à les mettre à jour, nous nous assurons de les maintenir en cohérence&nbsp;», poursuit-il.</p>\n <p>En sus d’êtres plus fiables, elles sont plus accessibles. «&nbsp;Nous avons beaucoup de discussions très intéressantes avec les opérationnels, depuis que nous récoltons les données plus rapidement dans notre système&nbsp;».</p>\n <p>En 2024, le groupe Leonhart s’est conformé à une écotaxe affectant son secteur. «&nbsp;Comme les équipes étaient encore en mode projet, nous nous sommes mis en ordre de marche pour ajuster nos processus. Nous avons réussi à le faire en quelques semaines&nbsp;». Nagarro l’a aidé à modifier sa facturation et sa compta en conséquence.</p>\n <p>Pour autant, il n’a pas eu besoin de développer davantage de spécifiques au cours des trois dernières années. Son périmètre d’activité n’a pas foncièrement évolué.</p>\n</section>          \n<section class=\"section main-article-chapter\" data-menu-title=\"Des montées de version moins anxiogènes, mais pas sans accroc\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des montées de version moins anxiogènes, mais pas sans accroc</h2>\n <p>Concernant les montées de version bisannuelles – l’une des grandes questions pour les entreprises intéressées par S/4HANA Public Cloud –, le DAF observe qu’elles sont bien moins complexes qu’avec un ERP on premise.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Le plus pénible, c’est que la deuxième montée de version de l’année se fait en août, quand il n’y a personne.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Nicolas Battesti</strong>Directeur administratif et financier, groupe Leonhart\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>«&nbsp;Une montée de version sur deux, nous avons de petits accrocs dans un processus ou dans un autre, mais pour l’instant, ça n’a jamais été véritablement problématique&nbsp;», témoigne Nicolas Battesti.</p>\n <p>«&nbsp;Le plus pénible, c’est que la deuxième montée de version de l’année se fait en août, quand il n’y a personne. SAP nous donne quinze jours à quatre semaines pour que nous nous organisions&nbsp;». Les tests de non-régression sont effectués à l’aide des utilisateurs clés, manuellement.</p>\n <p>Le groupe avait, dans un premier temps, fait le choix de mettre à jour la BTP en même temps que S/4HANA Cloud. «&nbsp;Nous sommes revenus sur ce point. Quand régression il y avait, il était plus difficile d’identifier son origine&nbsp;», remarque le DAF.</p>\n <p>En trois ans, le directeur administratif et financier évoque deux indisponibilités résolues en moins d’une heure lors des horaires d’activité du groupe (7&nbsp;h&nbsp;30 – 17&nbsp;h). Dans le cas présent, les instances&nbsp;S/4HANA Public Cloud sont déployées dans un data center SAP à Waldorf, soit un peu plus de 330&nbsp;km de Sélestat.</p>\n <p>La suite pour Les Sablières J.&nbsp;Leonhart consiste à réduire son empreinte carbone. «&nbsp;Nous avons développé des produits innovants. Nous avons investi dans des usines pour remplacer le granulat par des copeaux de bois. Nous avons des installations de granulats recyclés qui sont plus performants que ce qu’ils pouvaient être auparavant&nbsp;», liste le DAF. «&nbsp;Le groupe met tous ses investissements sur sa réduction de l’empreinte carbone. Et nous espérons pouvoir tirer profit des logiciels SAP pour travailler sur cette trajectoire&nbsp;».</p>\n <p>L’entreprise arrive au terme de son contrat de trois ans en fin d’année. Elle prépare le renouvellement (et la négociation) auprès de l’éditeur allemand.</p>\n</section>",
      "published_ts": 1763114100,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/tribune/IA-et-service-client-remplacer-lhumain-dans-vos-relations-cest-deshumaniser-votre-marque",
      "title": "IA et CX : n’oubliez pas que remplacer l’humain dans le service client déshumanise la marque",
      "summary": "<p>Si les responsables du CX sont impatients d’adopter l’IA,&nbsp;<a href=\"https://www.customerexperiencedive.com/news/customers-dislike-ai-customer-service/757711/\">les clients, eux, ne sont pas aussi convaincus</a>. Loin de là.</p> \n<p>Les études sur le sujet se suivent et se ressemblent.</p> \n<p>Nous avions évoqué celles de Qualtrics et d’OpinionWay qui montrent que <a href=\"https://www.lemagit.fr/actualites/366633597/CX-avec-de-lIA-ou-pas-les-chatbots-ne-seduisent-pas\">les chatbots ne sont pas appréciés</a> – quoi qu’en disent les partisans de l’automatisation et du «&nbsp;libre-service&nbsp;». D’autres rapports le confirment.</p> \n<p>Huit clients sur dix déclarent par exemple préférer un support humain, même si les temps d’attente et le temps passé sont identiques, explique un rapport de HubSpot et de SurveyMonkey. Et selon cette étude, la moitié des consommateurs (53&nbsp;%) désapprouveraient l’utilisation de l’IA dans les interactions avec les services.</p> \n<p>«&nbsp;Cette aversion généralisée suggère que les applications de l’IA peinent souvent à répondre aux attentes des clients en matière d’empathie, de nuance et d’authenticité&nbsp;», analyse Zoe Padgett, chercheuse chez SurveyMonkey, <a href=\"https://www.customerexperiencedive.com/news/customers-dislike-ai-customer-service/757711/\">dans un échange avec nos collègues de CX Dive</a> (groupe Informa Techtarget dont fait partie LeMagIT).</p> \n<p>«&nbsp;Au lieu de considérer l’IA comme utile, de nombreux clients la perçoivent plutôt comme un obstacle&nbsp;», tacle-t-elle. «&nbsp;Cela engendre de la frustration et le sentiment que leurs préoccupations ne sont pas réellement comprises.&nbsp;»</p> \n<blockquote class=\"main-article-pullquote\">\n <div class=\"main-article-pullquote-inner\">\n  <figure>\n   «&nbsp;Au lieu de considérer l’IA comme utile, de nombreux clients la perçoivent plutôt comme un obstacle.&nbsp;»\n  </figure>\n  <figcaption>\n   <strong>Zoe Padgett</strong>SurveyMonkey\n  </figcaption>\n  <i class=\"icon\" data-icon=\"z\"></i>\n </div>\n</blockquote> \n<p>Un <a href=\"https://www.verint.com/fr/resources/the-state-of-customer-experience-2025/\">rapport</a>, de Verint (spécialiste américain de l’IA dans les centres de contact qui vient d’être <a href=\"https://www.verint.com/press-room/2025-press-releases/verint-agrees-to-be-acquired-by-thoma-bravo-for-2-billion/\">racheté</a> par Thomas Bravo) constate pour sa part que 56&nbsp;% des personnes interrogées préfèrent parler à des humains plutôt qu’à un système automatisé&nbsp;; même si (pour être parfaitement objectif) 44&nbsp;% d’entre elles sont également ouvertes à l’automatisation si elle permet de résoudre leur problème.</p> \n<p>Pas convaincu et toujours déterminé à truffer votre CX d’IA&nbsp;? D’accord. Mais alors lisez cette autre&nbsp;<a href=\"https://www.gartner.com/en/newsroom/press-releases/2024-07-09-gartner-survey-finds-64-percent-of-customers-would-prefer-that-companies-didnt-use-ai-for-customer-service?utm_source=chatgpt.com\">étude</a>, de Gartner, et partagée en 2024, qui estime que 64&nbsp;% des clients préféreraient que les entreprises n’utilisent pas l’IA pour le service client, et que 53&nbsp;% envisageraient même de changer de fournisseur si une entreprise y a (trop) recours.</p> \n<p>Là encore, le principal grief est qu’il devient difficile de joindre un conseiller en chair et en os.</p> \n<p>Dans <a href=\"https://www.gartner.com/en/customer-service-support/trends/customer-service-experience\">une autre recherche</a> sur le sujet, Gartner renchérit&nbsp;: seulement 13&nbsp;% des parcours clients débutent et se poursuivent sur des canaux de libre-service.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Des économies, mais à quel prix\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des économies, mais à quel prix</h2>\n <p>Certes, <a href=\"https://www.mckinsey.com/capabilities/growth-marketing-and-sales/our-insights/agents-for-growth-turning-ai-promise-into-impact?utm_source=chatgpt.com\">d’après une note</a> de McKinsey, l’IA (et les agents IA) dans les centres d’appels peut générer jusqu’à 30&nbsp;% d’économies. Mais à quel prix&nbsp;?</p>\n <p>Les clients attendent de l’empathie. Ils refusent d’entendre des bots leur réciter un script. Ils veulent sentir que leur cas est pris en compte. Or, les chatbots et les agents IA ne peuvent tout simplement pas offrir cela.</p>\n <p>Le risque est que les entreprises perdent des clients fidèles. Or acquérir des clients coûte plus cher que de garder ceux que l’on a déjà. Beaucoup plus cher même. Le site Business Dasher <a href=\"https://www.businessdasher.com/customer-acquisition-vs-retention-cost/\">chiffre</a> que le ratio va de cinq à vingt-cinq fois plus.</p>\n <p>Et les clients fidèles achèteraient plus. Gartner <a href=\"https://www.gartner.com/en/newsroom/press-releases/2025-05-20-gartner-survey-finds-73-percent-of-csos-are-prioritizing-growth-from-existing-customers-for-2025#:~:text=Seventy%2Dthree%20percent%20of%20CSOs%20are%20prioritizing%20growth,retention%20and%20growth%20as%20a%20top%2D3%20priority.\">confirme</a> que 73&nbsp;% des directeurs commerciaux prévoient de privilégier la croissance issue de leurs clients. Et 57&nbsp;% d’entre eux considéraient la fidélisation comme l’une de leurs principales priorités.</p>\n <p>De toute évidence, faire réellement plaisir au client, plutôt que de réduire ses coûts internes, compte encore.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Le cas Klarna\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Le cas Klarna</h2>\n <p>Alors, oui, l’IA permet de réaliser des économies. Mais il est essentiel de se rappeler que <a href=\"https://www.lemagit.fr/actualites/366634067/OpenAI-depasse-la-barre-du-million-dentreprises-clientes\">ces outils sont initialement conçus pour compléter le travail humain</a>, et pas pour le remplacer entièrement. Le contact humain demeure essentiel pour le CX.</p>\n <p>Alors oui, Salesforce a <a href=\"https://www.channelfutures.com/channel-business/tech-layoffs-intel-salesforce-follow-oracle-lead\">réduit les effectifs de son service client</a> de 4000&nbsp;personnes. Oui, <a href=\"https://www.customerexperiencedive.com/news/atlassian-lays-off-200-customer-service-support-staff/759832/\">Atlassian a licencié</a>&nbsp;350&nbsp;employés, en expliquant qu’ils seraient en grande partie remplacés par l’IA. Oui, le groupe de média britannique Sky <a href=\"https://www.lefigaro.fr/medias/le-groupe-de-medias-britannique-sky-envisage-de-supprimer-2000-postes-20250327\">envisage</a> de mettre à la porte 2000&nbsp;agents pour offrir «&nbsp;un service client plus rapide, plus simple et plus numérique&nbsp;» (sic).</p>\n <p>Mais toutes ces entreprises devraient aussi se souvenir du cas Klarna. Entre 2022 et 2024, la fintech a supprimé 700&nbsp;postes. Depuis, elle a reconnu son erreur et elle a décidé de&nbsp;<a href=\"https://www.customerexperiencedive.com/news/klarna-reinvests-human-talent-customer-service-AI-chatbot/747586/\">réembaucher</a> afin d’améliorer la qualité de son CX qui s’était fortement dégradée.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Conclusion : l’IA oui, mais beaucoup d’humains aussi\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Conclusion&nbsp;: l’IA oui, mais beaucoup d’humains aussi</h2>\n <p>Montrez à vos employés que vous les appréciez et que vous les respectez en permettant à l’IA de les aider, et non de les remplacer.</p>\n <p>Témoignez à vos clients la même considération et le même respect en comprenant leur besoin de contact humain.</p>\n <p>Et n’oubliez jamais de leur offrir une alternative à l’IA, sous peine de devenir une marque déshumanisée, et donc peu désirable.</p>\n</section>",
      "published_ts": 1763109480,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634515/Processeurs-en-pleine-forme-AMD-travaille-ses-ambitions",
      "title": "Processeurs : en pleine forme, AMD travaille ses ambitions",
      "summary": "<p>AMD vient de <a href=\"https://ir.amd.com/news-events/press-releases/detail/1265/amd-reports-third-quarter-2025-financial-results\">publier</a> un bilan trimestriel tout à fait positif&nbsp;: 9,25&nbsp;milliards de dollars de CA (+36&nbsp;% en un an&nbsp;; les analystes tablaient sur seulement 8,74&nbsp;mds&nbsp;$) et 1,20&nbsp;md&nbsp;$ de bénéfices (+75&nbsp;% en un an). Lisa Su, la PDG du fabricant de processeurs (en photo en haut de cet article), annonce que le trimestre suivant sera à l’avenant, avec un CA compris entre 9,3 et 9,9&nbsp;mds&nbsp;$.</p> \n<p>Parmi les carburants de ce succès, un mégacontrat passé avec OpenAI pour un équivalent de 6&nbsp;gigawatts de GPU Instinct&nbsp;MI450, les puces d’AMD concurrentes des Blackwell de Nvidia. Oracle en a aussi commandé 50&nbsp;000&nbsp;unités pour motoriser les services d’IA de son cloud public OCI. Deux laboratoires américains de supercalcul ont pareillement été séduits&nbsp;: ils achètent à eux deux pour 1&nbsp;milliard de dollars de GPU&nbsp;MI450.</p> \n<p>Tous ces contrats vont s’échelonner sur les prochains trimestres. En ce qui concerne celui qui vient de se clore, les <a href=\"https://www.lemagit.fr/actualites/366613417/Processeurs-AMD-repond-au-Xeon-6P-avec-lEpyc-9005\">processeurs Epyc de cinquième génération</a> et GPU&nbsp;<a href=\"https://www.lemagit.fr/actualites/366626032/Puces-pour-lIA-AMD-devoile-son-GPU-MI350X\">MI350X</a> pour serveurs se sont vendus dans les datacenters à hauteur de 4,3&nbsp;mds&nbsp;$ (+22&nbsp;% en un an). Les processeurs Ryzen et GPU Radeon pour PC ont atteint un CA de 2,8&nbsp;mds&nbsp;$ dans les postes clients (+46&nbsp;%) et de 1,3&nbsp;md&nbsp;$ dans les machines de jeux (+181&nbsp;%). Seul parent pauvre&nbsp;: les puces pour équipements embarqués (machines-outils, <a href=\"https://www.lemagit.fr/actualites/366623942/Processeurs-AMD-lance-les-Epyc-4005-pour-les-serveurs-dappoint\">équipements télécoms</a>, systèmes de vidéosurveillance, etc.) n’ont réalisé que 857&nbsp;millions de dollars de CA, soit une baisse de 8&nbsp;% en un an.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Se donner des objectifs face à la concurrence\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Se donner des objectifs face à la concurrence</h2>\n <p>En face, le concurrent historique Intel continue d’afficher un meilleur <a href=\"https://www.lemagit.fr/actualites/366633615/Contre-toute-attente-Intel-affiche-de-bons-resultats\">bilan trimestriel</a> – CA de 13,7&nbsp;milliards de dollars (+3&nbsp;% en un an) et bénéfice de 4,1&nbsp;mds&nbsp;$. Pour autant, la dynamique est très différente&nbsp;: Intel excelle dans les puces pour PC (8,5&nbsp;mds&nbsp;$ lors du dernier trimestre, soit une augmentation des ventes de 5&nbsp;%), mais contre-performe dans les processeurs pour serveurs, avec des ventes trimestrielles de 4,1&nbsp;mds&nbsp;$ (-1&nbsp;%) inférieures à celles d’AMD.</p>\n <p>Intel a par ailleurs une activité que n’a pas AMD&nbsp;: il possède des usines de gravure de semi-conducteurs. Et la question qui hante tous les analystes en ce moment est de savoir si AMD va continuer à faire fabriquer ses puces à Taiwan, <a href=\"https://www.lemagit.fr/actualites/366622914/Processeurs-AMD-signe-la-production-dEpyc-en-2-nm-chez-TSMC\">chez TSMC</a>, ou s’il va finir par <a href=\"https://www.lemagit.fr/actualites/366632087/Semiconducteurs-Intel-en-pourparlers-pour-fabriquer-les-puces-dAMD-et-Apple\">passer commande chez son concurrent américain</a> pour éviter de payer de lourdes taxes sur les circuits qu’il rapatrie aux USA.</p>\n <p>Nvidia, quant à lui, devrait dévoiler son dernier CA trimestriel dans le courant de la semaine prochaine.</p>\n <p>Lors d’une <a href=\"https://ir.amd.com/news-events/press-releases/detail/1266/amd-unveils-strategy-to-lead-the-1-trillion-compute-market-and-accelerate-next-phase-of-growth\">conférence</a> avec les analystes financiers qu’elle vient de donner, Lisa Su a expliqué que son objectif pour les trois à cinq prochaines années était de continuer à vendre plus de 50&nbsp;% des processeurs pour serveurs. C’est-à-dire à la fois devant son concurrent historique Intel, mais aussi sans céder de parts de marché aux processeurs ARM, alors qu’ils sont de plus en plus populaires chez les hyperscalers et que Nvidia s’est aussi mis à en vendre pour accompagner ses GPU.</p>\n <p>Elle estime aussi pouvoir atteindre 40&nbsp;% de parts de marché, en termes de chiffre d’affaires, sur les puces pour PC, malgré l’avance actuelle d’Intel.</p>\n <p>La véritable inconnue est le succès que vont rencontrer les produits d’AMD qui concurrencent ceux de Nvidia. Pour l’instant, tous les fabricants de serveurs, hébergeurs de cloud et intégrateurs auxquels LeMagIT a posé la question s’accordent à dire que les GPU d’AMD, mais aussi ses puces réseau, sont encore vus comme <a href=\"https://www.lemagit.fr/actualites/366619245/Puces-IA-les-hebergeurs-commencent-a-deployer-les-GPU-dAMD\">des solutions de remplacement quand Nvidia n’a plus de stock</a> à leur fournir. En l’occurrence, les stocks de Nvidia sont en <a href=\"https://www.lemagit.fr/actualites/366619265/Puces-pour-lIA-la-production-menace-de-ne-pas-suivre-la-demande\">pénurie chronique</a>, essentiellement à cause des hyperscalers américains qui lui achètent l’essentiel de sa production.</p>\n</section>",
      "published_ts": 1763097000,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/conseil/Sauvegardes-tout-ce-quil-faut-savoir-sur-la-deduplication",
      "title": "Sauvegardes : tout ce qu’il faut savoir sur la déduplication",
      "summary": "<p>Les <a href=\"https://www.lemagit.fr/conseil/Administration-Comment-mieux-planifier-vos-sauvegardes\">administrateurs de sauvegarde</a> ont la responsabilité de protéger les données critiques de l’entreprise, mais aussi celle de gérer des coûts de stockage et de réseau. La redondance est un élément majeur de la sauvegarde des données, mais une redondance excessive peut augmenter les coûts de stockage et compliquer la gestion des données. C’est là qu’intervient la <a href=\"https://www.lemagit.fr/definition/Deduplication\">déduplication</a> des sauvegardes.</p> \n<p>La déduplication fonctionne en générant un hachage des données analysées. Les résultats du hachage sont ensuite comparés à d’autres résultats afin de déterminer les doublons. Toutes les copies des informations dupliquées, sauf une, sont supprimées et remplacées par des pointeurs vers la source de données unique et définitive.</p> \n<p>Avec la déduplication des sauvegardes, les données dupliquées dans les sauvegardes sont remplacées par des pointeurs vers le fichier source. Il en résulte un gain d’espace assez surprenant. L’espace gagné varie en fonction de la technique de déduplication et des données d’origine. L’espace économisé dépend également fortement du type d’informations générées par les utilisateurs.</p> \n<p>Cet article examine la déduplication des données et la manière dont elle permet aux administrateurs de sauvegarde d’exceller dans leurs fonctions. Il aborde différents types de déduplication, leurs avantages, leurs inconvénients et des techniques spécifiques pour vous aider à déterminer comment la déduplication s’intègre dans votre structure de sauvegarde des données.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Les types de déduplication des données\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les types de déduplication des données</h2>\n <p>Plusieurs options de déduplication sont disponibles, permettant aux administrateurs de sauvegarde de choisir leur propre aventure en ce qui concerne la manière dont le processus est effectué. Lorsqu’ils décident d’une stratégie de déduplication des sauvegardes, les administrateurs peuvent déterminer comment les données dupliquées sont analysées, quand elles sont éliminées et à quel moment du processus de sauvegarde la déduplication a lieu.</p>\n <p><b>Déduplication au niveau des fichiers ou au niveau des blocs. </b>Les techniques de déduplication comprennent deux niveaux d’analyse des informations, chacun offrant ses propres avantages&nbsp;: au niveau des fichiers et au niveau des blocs.</p>\n <p>La déduplication au niveau des fichiers évalue des fichiers complets pour rechercher des informations présentes deux fois. La déduplication au niveau des blocs divise les données en blocs, puis vérifie chaque bloc pour rechercher des informations en double par rapport aux autres blocs. Dans les deux cas, des pointeurs vers une source unique et définitive remplacent ces informations.</p>\n <p><b>Déduplication en temps réel ou en post-traitement. </b>La déduplication peut s’effectuer au fil de l’eau, en temps réel, ou après l’enregistrement du fichier par l’utilisateur. La déduplication après l’enregistrement du fichier par l’utilisateur est appelée post-traitement.</p>\n <p>La déduplication en temps réel peut nécessiter davantage de ressources que la déduplication post-traitement, ce qui ralentit le processus de sauvegarde. Cependant, la déduplication post-traitement nécessite l’utilisation d’un espace de stockage temporaire, contrairement à la déduplication en temps réel. Tenez compte des besoins de votre entreprise en matière de stockage et de traitement afin de déterminer le moment le plus opportun pour effectuer la déduplication.</p>\n <figure class=\"main-article-image full-col\" data-img-fullsize=\"https://www.lemagit.fr/rms/onlineImages/storage-deduplication.png\">\n  <img data-src=\"https://www.lemagit.fr/rms/onlineImages/storage-deduplication_mobile.png\" class=\"lazy\" data-srcset=\"https://www.lemagit.fr/rms/onlineImages/storage-deduplication_mobile.png 960w,https://www.lemagit.fr/rms/onlineImages/storage-deduplication.png 1280w\" alt=\"La déduplication post-traitement nécessite plus d'espace de stockage que la déduplication en temps réel.\" height=\"507\" width=\"520\">\n  <figcaption>\n   <i class=\"icon pictures\" data-icon=\"z\"></i>La déduplication post-traitement nécessite plus d'espace de stockage que la déduplication en temps réel.\n  </figcaption>\n  <div class=\"main-article-image-enlarge\">\n   <i class=\"icon\" data-icon=\"w\"></i>\n  </div>\n </figure>\n <p><b>Déduplication basée sur la source ou sur la cible. </b>Les administrateurs de stockage et de sauvegarde peuvent également décider du moment où la déduplication doit avoir lieu par rapport au processus de sauvegarde. Les options sont la déduplication basée sur la source ou sur la cible.</p>\n <p>La déduplication basée sur la source traite les informations avant le début de la procédure de sauvegarde, ce qui réduit les besoins en bande passante et en stockage. Elle présente également l’avantage de réduire les besoins généraux en stockage pour les données.</p>\n <p>La déduplication basée sur la cible traite les informations au niveau de la cible de sauvegarde. Il s’agit d’une approche plus spécialisée et plus gourmande en ressources, qui convient aux ensembles de données volumineux.</p>\n</section>          \n<section class=\"section main-article-chapter\" data-menu-title=\"Les avantages de la déduplication pour les sauvegardes\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les avantages de la déduplication pour les sauvegardes</h2>\n <p>De nombreux administrateurs de stockage utilisent déjà la déduplication des données, de sorte que les administrateurs de sauvegarde peuvent bénéficier de cette technologie sans s’en rendre compte. Cependant, les avantages spécifiques de la déduplication des données pour les administrateurs de sauvegarde sont les suivants&nbsp;:</p>\n <ul class=\"default-list\"> \n  <li>Efficacité des tâches de sauvegarde.</li> \n  <li>Optimisation de l’espace de stockage.</li> \n  <li>Optimisation de la bande passante réseau.</li> \n  <li>Efficacité accrue de la gestion des données.</li> \n </ul>\n <p>La réduction des coûts qui en résulte permet aux entreprises de consacrer des ressources financières cruciales à d’autres domaines. La déduplication peut également aider les administrateurs de sauvegarde à justifier la conservation des données plus longtemps tout en réduisant l’empreinte de stockage sur les supports physiques.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Les inconvénients de la déduplication des données\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les inconvénients de la déduplication des données</h2>\n <p>Aucune technologie n’est parfaite, et la déduplication des données ne fait pas exception. Vous devez anticiper certains problèmes spécifiques si vous implémentez la déduplication dans votre environnement. Les inconvénients potentiels sont les suivants&nbsp;:</p>\n <ul class=\"default-list\"> \n  <li>Ralentissement des performances du système, en particulier au niveau du processeur. La déduplication est très gourmande en ressources processeur.</li> \n  <li>Risques de perte de données dus à des collisions de hachage ou à d’autres erreurs.</li> \n  <li>Fragmentation accrue du stockage résultant de la manière dont les blocs sont traités et écrits sur le disque à des moments légèrement différents, et sont répartis sur plusieurs périphériques de stockage.</li> \n  <li>Risques de dépendance des blocs associés à la corruption des données. Si un bloc source est corrompu, cela peut avoir des répercussions importantes sur de nombreux fichiers.</li> \n  <li>Niveaux d’efficacité variables en fonction du type et de la structure des données.</li> \n </ul>\n <p>Le ralentissement des performances du système est particulièrement préoccupant. Si la récupération rapide des données est essentielle, la déduplication n’est peut-être pas le meilleur choix.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Les cas d’usage de la déduplication\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les cas d’usage de la déduplication</h2>\n <p>Les cas d’usage de la déduplication couvrent presque tous les types de fichiers. Cependant, chaque type de fichier bénéficie différemment de la déduplication. Prenons l’exemple d’un stockage de fichiers susceptible de contenir des informations identiques. Les fichiers sources d’installation, les images de machines virtuelles ou encore d’autres situations où il existe de nombreuses copies des mêmes fichiers en sont un excellent exemple. Les types de fichiers et de données suivants bénéficient considérablement de la déduplication des données.</p>\n <p><b>Fichiers de sauvegarde. </b>Les tâches de sauvegarde fréquentes ne contiennent souvent que des modifications mineures avec beaucoup d’informations dupliquées.</p>\n <p><b>Fichiers de machines virtuelles. </b>Les images disque de machines virtuelles, les images ISO et autres fichiers de support contiennent des informations identiques sur les fichiers système.</p>\n <p><b>Pièces jointes aux e-mails. </b>De nombreuses entreprises envoient des pièces jointes à des groupes d’e-mails entiers, dupliquant ainsi la même pièce jointe des centaines de fois.</p>\n <p><b>Fichiers binaires de logiciels. </b>Les programmes d’installation, les fichiers CAB et autres fichiers sources de logiciels peuvent être dupliqués dans toute une entreprise.</p>\n <p><b>Documents utilisateur. </b>Les fichiers de la suite Office, les PDF, les images et autres fichiers de données des utilisateurs sont fréquemment dupliqués dans les répertoires personnels, les dossiers des services et divers espaces de stockage collaboratifs.</p>\n <p><b>Référentiels de code. </b>Les développeurs peuvent stocker des versions de code qui se répètent, car ils utilisent les commits Git pour gérer les versions.</p>\n <p><b>Les outils de déduplication sous Windows et Linux</b></p>\n <p>Les outils de déduplication intégrés varient en fonction du système d’exploitation utilisé par l’entreprise.</p>\n <p>Windows Server inclut un utilitaire de déduplication intégré pour NTFS. Il offre plusieurs options de configuration utiles à l’aide de <a href=\"https://www.lemagit.fr/definition/PowerShell\">PowerShell</a> et d’outils graphiques&nbsp;:</p>\n <ul class=\"default-list\"> \n  <li><b>Planification.</b> Planifiez les actions de déduplication pendant les heures creuses à l’aide de PowerShell ou du Planificateur de tâches afin de minimiser l’impact sur les performances du serveur pendant les heures de pointe.</li> \n  <li><b>Exclusions.</b> Excluez certains types de fichiers ou emplacements de stockage du processus de déduplication afin d’éviter tout risque pour les fichiers critiques.</li> \n  <li><b>Seuils d’ancienneté</b>. Définissez des seuils d’ancienneté pour les fichiers candidats à la déduplication. La valeur par défaut est trois jours.</li> \n  <li><b>Rapports et surveillance</b>. Activez la surveillance de l’état des actions de déduplication à l’aide de cmdlets PowerShell tels que <i>Get-DedupStatus</i> et <i>Get-DedupJob</i>.</li> \n </ul>\n <p>Les utilisateurs Linux disposent des options suivantes pour la déduplication&nbsp;:</p>\n <ul class=\"default-list\"> \n  <li><b>Btrfs</b>. Ce système de fichiers permet la déduplication hors ligne, basée sur des blocs, à l’aide d’utilitaires tels que <i>duperemove</i> et <i>bedup</i>.</li> \n  <li><b>Czkawka</b>. Cet outil identifie les informations en double et autres données inutiles afin de récupérer de l’espace de stockage.</li> \n  <li><b>Rdfind</b>. Cet outil identifie les informations en double en fonction du contenu des fichiers, ce qui vous permet de gérer les fichiers en double à l’aide d’autres outils. Il peut supprimer les doublons ou remplacer les informations redondantes.</li> \n </ul>\n</section>",
      "published_ts": 1763096400,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/face-a-la-commission-google-tente-deviter-la-scission-484940.htm#xtor=RSS-1",
      "title": "Face à la Commission, Google tente d'éviter la scission",
      "summary": "Visé par une amende de 2,95 milliards d'euros pour abus de position dominante dans le marché de la publicité en ligne, Google a proposé plusieurs engagements à la Commission européenne afin de se mettre en conformité avec la réglementation.",
      "published_ts": 1763093496,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/sur-la-data-et-lia-les-collectivites-ne-font-plus-de-la-figuration-484921.htm#xtor=RSS-1",
      "title": "Sur la Data et l’IA, les collectivités ne font plus de la figuration",
      "summary": "Les projets de gestion par la donnée (74%) et d’intelligence artificielle (77%) montent en puissance dans les collectivités françaises. Mais celles-ci avancent “dans un contexte contraint” et sans négliger les enjeux de sobriété numérique et de souveraineté.",
      "published_ts": 1763086316,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.lemagit.fr/conseil/Bien-negocier-son-contrat-ERP-a-lere-de-lIA",
      "title": "Bien négocier son contrat ERP à l’ère de l’IA",
      "summary": "<p>Les contrats ERP changent de nature. Selon le <a href=\"https://www.panorama-consulting.com/resource-center/top-erp-systems-report/\">rapport</a> annuel du cabinet de conseils en ERP, Panorama Consulting, la logique centrée sur les licences et les frais de maintenance laisserait désormais place à une tarification par abonnement, plus «&nbsp;dynamique&nbsp;», assortie de garanties en matière de sécurité et d’engagements environnementaux.</p> \n<p>Ces évolutions plutôt positives ajoutent cependant de nouvelles dimensions à prendre en compte lors des négociations.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Cloud et SLA\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Cloud et SLA</h2>\n <p>Les <a href=\"https://www.lemagit.fr/definition/ERP-cloud\">ERP en mode cloud</a> deviennent, pour Panorama Consulting, la norme.</p>\n <p>Conséquence, le rapport met en garde contre une analyse trop rapide des coûts initiaux, qui peuvent sembler faibles dans le cloud. Les conditions associées à ce type d’hébergement du <a href=\"https://www.lemagit.fr/definition/ERP-cloud\">PGI</a> deviennent en réalité critiques et doivent donc être passées en revue.</p>\n <p>«&nbsp;Les dirigeants doivent examiner attentivement les termes concernant la portabilité des données, les <a href=\"https://www.lemagit.fr/definition/SLA\">accords de niveau de service</a> (SLA) sur la disponibilité et les clauses d’évolutivité&nbsp;», résume Panorama Consulting</p>\n <p>Un SLA réellement protecteur doit prévoir des pénalités financières explicites si le fournisseur ne respecte pas ses engagements.</p>\n <p>Le rapport insiste également sur la vigilance à porter à l’évolutivité&nbsp;: «&nbsp;les systèmes qui semblent rentables au premier abord peuvent entraîner des coûts élevés pendant la croissance ou les périodes de pointe s’ils ne sont pas négociés avec soin&nbsp;», écrivent ses auteurs.</p>\n <p>En pratique, il s’agit pour les entreprises de s’assurer que les paliers tarifaires sont clairement définis pour éviter une hausse brutale des coûts en cas de pic ou de croissance de l’activité.</p>\n <p>La question de la portabilité apparaît tout aussi essentielle. Elle conditionne la capacité d’une entreprise à récupérer ses données en cas de changement de fournisseur. Sans clauses claires, avertit le rapport, l’entreprise peut se retrouver totalement coincée.</p>\n <p>Ces éléments (coûts cachés, modalités de service réelles, mécanismes de sortie) sont des zones de risque majeures qui exigent un examen approfondi.</p>\n</section>         \n<section class=\"section main-article-chapter\" data-menu-title=\"L’impact de l’IA\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’impact de l’IA</h2>\n <p><a href=\"https://www.lemagit.fr/actualites/366592461/LIA-est-devenue-un-critere-de-choix-pour-lERP-cloud\">L’intégration de l’IA dans les ERP</a> transforme aussi la négociation.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;[Les systèmes ERP doivent fournir] des résultats d’IA explicables, des journaux d’audit et des mécanismes de gouvernance configurables&nbsp;».\n   </figure>\n   <figcaption>\n    <strong>Rapport Panorama consulting</strong>\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Les clauses dépassent désormais les seules conditions financières ou techniques pour toucher également à la gouvernance, à la transparence des algorithmes et à l’architecture sous-jacente.</p>\n <p>Le rapport insiste sur le fait que, puisque l’IA intervient dans la planification financière ou dans la chaîne d’approvisionnement, la confiance devient un élément stratégique. Les systèmes ERP doivent fournir «&nbsp;des résultats d’IA explicables, des journaux d’audit et des mécanismes de gouvernance configurables&nbsp;».</p>\n <p>Ces exigences doivent figurer explicitement dans les contrats afin de garantir que les décisions «&nbsp;augmentées&nbsp;» par l’IA restent compréhensibles et correctement supervisées.</p>\n <p>Le <a href=\"https://www.lemagit.fr/conseil/Six-criteres-pour-choisir-le-bon-ERP\">choix de la plateforme ERP</a> s’en trouve également affecté. Le document affirme que les entreprises ont tout intérêt à privilégier des «&nbsp;architectures ouvertes et modulaires capables de s’intégrer avec des outils d’IA&nbsp;».</p>\n <p>Le rapport considère que cette modularité est un critère de négociation, car elle conditionne la capacité à intégrer de nouveaux outils d’IA, sans engager des développements sur mesure, à la fois coûteux et complexes. Cette approche permet dans le même temps de réduire la dépendance vis-à-vis d’un seul fournisseur et de mieux suivre l’évolution rapide des technologies.</p>\n <p>Panorama Consulting attire également l’attention sur les risques liés aux solutions d’IA-as-a-Service proposées par les éditeurs.</p>\n <p>De nombreux modules d’IA reposent en réalité sur des services cloud tiers, avec des implications contractuelles importantes en matière d’intégration, de conformité et de pérennité. Le rapport recommande donc de se tourner vers des ERP «&nbsp;flexibles et conçus pour se connecter à des outils externes, ce qui permet d’éviter beaucoup de maux de tête&nbsp;».</p>\n <p>Quant à <a href=\"https://www.lemagit.fr/actualites/366629892/Agent-IA-et-ERP-industriel-vers-une-nouvelle-main-duvre-numerique\">l’arrivée progressive d’agents autonomes dans les ERP</a>, elle imposera de plus en plus de clarifier contractuellement, et noir sur blanc, les mécanismes précis de supervision humaine. Là encore, le cabinet conseille de se tourner vers des systèmes ERP dotés de «&nbsp;des garde-fous configurables, des alertes en temps réel et des circuits d’escalade pour préserver la responsabilité humaine&nbsp;».</p>\n</section>           \n<section class=\"section main-article-chapter\" data-menu-title=\"Sécurité et conformité\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Sécurité et conformité</h2>\n <p>Les enjeux de sécurité et de conformité se complexifient également.</p>\n <p>Les vérifications de base qui suffisaient auparavant ne couvriraient plus l’ensemble des risques liés aux réglementations sectorielles ou aux cybermenaces. Le rapport de Panorama souligne que les contrats «&nbsp;modernes&nbsp;» intègrent à la fois des normes générales, comme ISO&nbsp;27001 ou SOC&nbsp;2, et des obligations propres à certains secteurs, comme IPA (santé aux États-Unis), ou à certaines régions, comme le RGPD.</p>\n <p>Ces exigences deviennent déterminantes pour les organisations dans les secteurs régulés comme la santé, la finance ou l’énergie. «&nbsp;Les entreprises de ces secteurs devraient éviter le langage standardisé et adapter plutôt les termes à leurs environnements de conformité spécifiques&nbsp;», invite le rapport.</p>\n <p>Ce qui implique de définir précisément les réglementations applicables à l’organisation et de vérifier que le contrat couvre bien toutes les dimensions de la compliance (gestion des données sensibles, traçabilité, réponse aux audits, etc.).</p>\n <p>Les négociations sur ce point précis nécessitent souvent l’appui d’experts internes, notamment des équipes juridiques et de conformité, voire d’appuis externes.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"La question du coût et de la valeur\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La question du coût et de la valeur</h2>\n <p>La logique du «&nbsp;paiement à la performance&nbsp;» gagnerait par ailleurs du terrain par rapport aux abonnements au forfait (par utilisateur et par mois, par exemple).</p>\n <p>«&nbsp;Les éditeurs sont de plus en plus ouverts à lier la rémunération à des résultats mesurables&nbsp;», note le rapport. L’objectif de cette nouvelle forme de tarification serait d’aligner plus étroitement les intérêts du client et ceux du fournisseur. En cas de réussite du projet, la valeur est partagée&nbsp;; en cas de difficultés, une (petite) partie du risque serait assumée par l’éditeur d’ERP.</p>\n <p>Des modalités contractuelles peuvent ainsi lier les paiements aux étapes de la mise en service, au taux de disponibilité du système ou au degré d’adoption par les utilisateurs.</p>\n <p>Mais l’étude appelle à la prudence. Ces approches, bien que séduisantes en théorie, supposent une définition rigoureuse en amont de KPI objectifs et une supervision par une tierce partie. Sans cela, le mécanisme perdrait en crédibilité comme en efficacité.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Les critères ESG\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les critères ESG</h2>\n <p>Les critères environnementaux, sociaux et de gouvernance (ESG) entrent aussi dans le nouveau périmètre contractuel de l’ERP.</p>\n <p>Selon Panorama, les entreprises cherchent aujourd’hui à évaluer la responsabilité des fournisseurs (<a href=\"https://www.lemagit.fr/actualites/366632714/Comment-les-DSI-peuvent-dejouer-le-greenwashing-des-fournisseurs-IT\">ce qui n’est pas toujours simple</a>), tout en s’assurant que l’ERP soutiendra leurs propres engagements ESG.</p>\n <p>Un <a href=\"https://www.lemagit.fr/actualites/366610114/ERP-et-durabilite-les-outils-de-reporting-du-carbone-se-multiplient\">ERP moderne peut faciliter ce type de reporting</a>. Il convient donc de vérifier si l’ERP intègre des outils de suivi et d’observabilité de la chaîne d’approvisionnement (par exemple pour contrôler le respect des droits humains chez les fournisseurs), la robustesse de ces outils, et de formaliser le niveau d’engagement du fournisseur quant à la maintenance de ces fonctionnalités.</p>\n <p>L’enjeu est d’aligner, sur le long terme, l’investissement dans l’ERP avec les obligations extra-financières de l’entreprise.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Gestion du changement organisationnel\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Gestion du changement organisationnel</h2>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    « Le succès de la transformation numérique dépend de l’adoption du système. »\n   </figure>\n   <figcaption>\n    <strong>Rapport Panorama consulting</strong>\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>On le sait, <a href=\"https://www.lemagit.fr/conseil/La-cle-dune-mise-en-uvre-ERP-reussie-La-gestion-du-changement\">le volet humain est déterminant dans le succès d’un projet ERP</a>. Le meilleur ERP, même bien négocié, sera un échec si les équipes métiers ne comprennent pas les raisons du changement ou si elles ne sont pas suffisamment formées. «&nbsp;Le succès de la transformation numérique dépend de l’adoption du système&nbsp;», insiste Panorama Consulting.</p>\n <p>Son étude souligne que l’inscription de clauses sur la gestion du changement (ou OCM pour Organizational Change Management) est une des évolutions les plus notables dans les contrats ERP.</p>\n <p>Les clauses OCM peuvent porter sur la formation par rôle, sur le suivi de métriques d’engagement et d’usage, ou encore sur la mise en place d’un accompagnement étendu après la mise en service, au-delà d’une simple assistance technique.</p>\n <p>Avec l’OCM, ce ne sont plus seulement les fonctionnalités de l’ERP qui sont contractualisées, mais également les conditions de réussite – résume le rapport.</p>\n</section>",
      "published_ts": 1763031060,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634532/Sauvegarde-Commvault-devoile-sa-prochaine-version-dopee-a-lIA",
      "title": "Sauvegarde : Commvault dévoile sa prochaine version dopée à l’IA",
      "summary": "<p>L’éditeur de solution de sauvegardes <a href=\"https://www.lemagit.fr/actualites/366581312/Commvault-Personne-na-notre-niveau-dexpertise-dans-la-sauvegarde-en-cloud\">Commvault</a> commercialisera une nouvelle version de sa solution baptisée Commvault Cloud Unity dès le début de l’année prochaine. Elle aura principalement quatre caractéristiques inédites.</p> \n<p>D’abord, une nouvelle console d’administration – Unity, donc – qui supervise toutes les ressources informatiques d’une entreprise, qu’elles soient sur site ou en cloud, protégées ou non par Commvault.</p> \n<p>Ensuite (et c’est sans doute l’avancée la plus importante), la solution automatisera l’essentiel du <a href=\"https://www.lemagit.fr/actualites/366541570/Sauvegarde-et-cybersecurite-Commvault-sessaie-au-melange-des-genres\">déminage des sauvegardes</a> pour ne pas restaurer des fichiers corrompus après une cyberattaque. Cette nouveauté va de pair avec un outil de test des restaurations bien plus pointu qu’auparavant, qui sert désormais à réparer en amont ce qui devra être restauré en cas de cyberattaque.</p> \n<p>Enfin, Commvault Cloud Unity saura plus particulièrement identifier dans les sauvegardes de l’annuaire Active Directory les changements de droits utilisateurs malicieux, qui permettent à des pirates de prendre possession de l’IT d’une entreprise pour compromettre et dérober ses données.</p> \n<p>«&nbsp;Le point le plus important est que tout cela est entièrement basé sur des IA qui comprennent vos besoins et agissent de manière proactive pour augmenter votre résilience aux cyberattaques. D’ailleurs, nous pensons que notre solution va créer une nouvelle discipline dans les entreprises&nbsp;: les ResOps, ou opérateurs de résilience, la nouvelle évolution des administrateurs des sauvegardes&nbsp;», lance Sanjay Mirchandani, le PDG de Commvault (en photo en haut de cet article), dans son discours d’ouverture de l’événement Shift&nbsp;2025, que l’éditeur a organisé cette semaine à New York pour présenter en avant-première Commvault Cloud Unity.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Toute une usine de déminage des sauvegardes avant restauration\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Toute une usine de déminage des sauvegardes avant restauration</h2>\n <p>Avec cette IA viennent surtout des connecteurs pour tout automatiser. Sur scène, l’IA de Cloud Unity comprend le message d’alerte qu’un antivirus vient d’envoyer dans la messagerie Slack des administrateurs système. Elle lance son module interne ThreatScan pour vérifier si la signature de l’attaque mentionnée existe dans les sauvegardes, met automatiquement en quarantaine les données infectées afin qu’elles ne soient pas restaurées, puis envoie son propre rapport aux administrateurs.</p>\n <p><a href=\"https://www.lemagit.fr/actualites/252521621/Cybersecurite-CommVault-se-met-a-lheure-des-leurres\">ThreatScan existait déjà</a>, mais il s’agissait d’une fonction qui se déclenchait soit manuellement, soit à intervalles réguliers, pour vérifier la présence de signatures de malwares dans les sauvegardes. Signatures qui étaient renseignées par des outils de cybersécurité externes.</p>\n <p>«&nbsp;Désormais, ThreatScan est en veille permanente et peut réfléchir par lui-même pour détecter des actions malveillantes. Typiquement, le fait qu’un fichier sauvegardé depuis un moment ait subitement été remplacé par une version chiffrée&nbsp;», explique au MagIT un technicien de Commvault qui détaille la solution sur son stand.</p>\n <p>«&nbsp;Mais le point le plus important est que les fichiers corrompus sont automatiquement mis en quarantaine. Avant, vous deviez décider de le faire à la main. Désormais, vous ne les restaurerez plus jamais par erreur&nbsp;», dit le technicien.</p>\n <p>ThreatScan informe le nouvel outil de restauration Synthetic Recovery. La fonction de celui-ci consiste à aller chercher dans l’historique des sauvegardes des versions encore saines des fichiers mis en quarantaine, de sorte à élaborer un ensemble complet de données que l’on pourra remettre en production après une cyberattaque. L’idée est d’éviter de restaurer un gruyère rempli de trous.</p>\n <p>Le troisième élément est Cleanroom Recovery. C’est un bac à sable, sur Azure ou <a href=\"https://www.lemagit.fr/actualites/366612335/Sauvegarde-Commvault-rachete-Clumio-pour-son-expertise-AWS\">sur AWS</a>, dans lequel Commvault Cloud Unity va restaurer à blanc les sauvegardes, afin que les administrateurs puissent vérifier qu’une remise en production <a href=\"https://www.lemagit.fr/conseil/Reprise-dactivite-apres-sinistre-comment-elaborer-la-strategie-et-rediger-le-PRA\">se passera correctement</a>.</p>\n <p>«&nbsp;D’une part, vous allez passer aussi ces données restaurées à l’antivirus, par exemple Microsoft Defender pour éventuellement exclure à nouveau des fichiers. D’autre part, vous allez vous rendre compte de problèmes&nbsp;: il va manquer des fichiers dans telle VM pour qu’elle se lance, les VM ne seront pas restaurées dans un ordre cohérent, etc. Cleanroom Recovery va enregistrer toutes les réparations que vous ferez pour restaurer les sauvegardes exactement comme vous le souhaitez lorsque ce sera nécessaire&nbsp;», détaille le technicien.</p>\n <p>Selon lui, il faut en moyenne 24&nbsp;jours à une entreprise pour restaurer une IT fonctionnelle après une cyberattaque. Avec Cleanroom Recovery, ce retour en production pourrait ne plus prendre que 5&nbsp;jours.</p>\n <p>«&nbsp;Les entreprises testent leur restauration tous les trimestres, voire une fois par an, parce que c’est une procédure qui prend beaucoup de temps. Mais la capacité de Cleanroom Recovery à conserver en mémoire les réparations à faire permet de réduire la durée de ces tests à chaque fois. Je vous garantis que votre second test sera quatre fois plus rapide que le premier&nbsp;», argumente le technicien.</p>\n</section>          \n<section class=\"section main-article-chapter\" data-menu-title=\"Détecter les compromissions des droits d’accès dans AD\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Détecter les compromissions des droits d’accès dans AD</h2>\n <p>Concernant la protection des identités, Commvault Cloud savait déjà faire des restaurations granulaires de droits utilisateurs dans Active Directory (AD), mais encore fallait-il savoir lesquels.</p>\n <p>«&nbsp;L’IA de Commvault Cloud Unity est désormais capable de repérer des problèmes très difficiles à trouver pour un administrateur humain. En prenant en compte les logs, notamment voir qu’un changement de droit ou de mot de passe n’a pas été fait par un humain sur son clavier, mais par un script&nbsp;» assure Pranay Ahlawat, le directeur technique de Commvault.</p>\n <p>«&nbsp;Et il vous suffit d’un clic de souris pour enlever instantanément toute compromission de votre Active Directory&nbsp;», ajoute-t-il en faisant là aussi mention d’IA qui se parlent entre elles.</p>\n <p>Dans une démonstration, un assistant du support utilisant ServiceNow parle dans son micro pour demander à son IA pourquoi tel administrateur n’a plus accès à son compte et cette IA demande à l’IA de Commvault d’aller vérifier s’il n’y aurait pas un problème dans Active Directory.</p>\n <p>Il est à noter que ces changements suspects de droits utilisateurs dans Active Directory sont aussi pris en charge par l’IA de Commvault, lors des tests de restauration avec Cleanroom Recovery.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Superviser toutes les protections en place et comparer leurs prix\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Superviser toutes les protections en place et comparer leurs prix</h2>\n <p>La nouvelle console Unity succédera à l’actuelle interface d’administration <a href=\"https://www.lemagit.fr/actualites/366623607/CommVault-une-vulnerabilite-de-severite-maximale-desormais-exploitee\">Command Center</a> qui sert à gérer les sauvegardes sur site, ainsi qu’à son équivalent en SaaS qui sert à sauvegarder les données des services cloud. Au-delà de l’ergonomie de tout superviser depuis une seule fenêtre et non deux, la raison d’être d’Unity semble d’abord commerciale.</p>\n <p>«&nbsp;Lorsque vous lancez Unity et que vous lui indiquez tous les comptes cloud et toutes les ressources IT que vous voulez sauvegarder, l’interface dresse un bilan de la manière dont ces ressources IT sont protégées et combien vous coûte cette protection en l’état. Et elle vous dit comment améliorer cette protection ainsi que le prix de cette protection&nbsp;», explique Pranay Ahlawat.</p>\n <p>«&nbsp;Nous recommandons de stocker les sauvegardes dans le cloud, de manière étanche au reste de votre IT, pour éviter les contagions d’une cyberattaque dans votre datacenter. Mais un point très important qui revient dans toutes les discussions que nous avons avec les entreprises est de savoir si les sauvegardes que nous stockons en cloud coûtent moins cher que les services de stockage en cloud auxquels elles peuvent elles-mêmes souscrire. Et aussi moins cher que les services de snapshots que leur proposent les fournisseurs de services en cloud.&nbsp;»</p>\n <p>Il précise que Commvault Cloud sait prendre en charge 200&nbsp;services en cloud. L’essentiel des services IaaS d’AWS et Azure bien entendu (<a href=\"https://www.lemagit.fr/actualites/366613285/Sauvegarde-du-cloud-Commvault-se-depeche-de-supporter-AWS-et-Google\">le support de GCP</a> n’arrivera qu’en 2026), mais aussi un bon nombre d’applications en SaaS ou de services en PaaS que ces clouds hébergent&nbsp;: Microsoft 365, Salesforce, Github, GitLab, Databricks...</p>\n <p>«&nbsp;La raison d’être de cette supervision globale est donc d’abord de vous prouver que notre solution va vous permettre de réaliser des économies substantielles sur votre protection globale&nbsp;», argumente-t-il, en expliquant que <a href=\"https://www.lemagit.fr/actualites/366616612/Commvault-apporte-la-sauvegarde-incrementale-aux-donnees-S3\">Commvault déduplique, compresse, incrémente et chiffre toutes ses sauvegardes</a> pour qu’elles consomment moins d’espace de stockage et soient impossibles à lire en passant par un droit d’accès existant.</p>\n <p>Il ajoute que ce chiffrement n’utilise d’ailleurs plus de système à double clé, susceptible d’être cassé le jour où l’ordinateur quantique fonctionnera...</p>\n</section>",
      "published_ts": 1763025660,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/etude/Bpifrance-mise-sur-une-plateforme-de-donnees-100-temps-reel",
      "title": "Bpifrance mise sur une plateforme de données « 100 % » temps réel",
      "summary": "<p>Bpifrance, qui vient de fêter ses 10&nbsp;ans, est le fruit de plusieurs fusions successives. Conséquences directes sur le système d’information, la DSI recense 700&nbsp;applications. Des progiciels on-premise, des solutions SaaS et de nombreuses applications internes vivent en parallèle. Plusieurs centaines d’équipes agiles travaillent sur le développement des applications et il y a&nbsp;des milliers de bases de données en production.</p> \n<blockquote class=\"main-article-pullquote\">\n <div class=\"main-article-pullquote-inner\">\n  <figure>\n   «&nbsp;Tous les soirs, de multiples extractions sont réalisées dans les systèmes. […] Nous devons orchestrer toutes ces extractions afin d’avoir des états cohérents&nbsp;».\n  </figure>\n  <figcaption>\n   <strong>Christophe Jalady</strong>Architecte chez Bpifrance\n  </figcaption>\n  <i class=\"icon\" data-icon=\"z\"></i>\n </div>\n</blockquote> \n<p>La stratégie «&nbsp;data&nbsp;» de la banque remonte à 2004. À l’époque, une architecture de traitements en lot (batch) est déployée. L’objectif&nbsp;: extraire chaque nuit les données des applications afin d’alimenter une base de données unique. Les données sont ainsi mises à disposition des applications.</p> \n<p>«&nbsp;Tous les soirs, de multiples extractions sont réalisées dans les systèmes sous forme de fichiers plats, voire de dumps de base de données&nbsp;», explique Christophe Jalady, architecte chez Bpifrance. «&nbsp;Nous devons orchestrer toutes ces extractions afin d’avoir des états cohérents&nbsp;».</p> \n<p>Pour constituer cette architecture, Bpifrance a mis en œuvre les solutions de base de données, le système de messagerie et l’ETL d’IBM, ainsi que l’orchestrateur de processus <a href=\"https://www.lemagit.fr/actualites/252514848/ITSM-BMC-Software-deroule-sa-strategie-multicloud\">Control-M de BMC Software</a>.</p> \n<p>L’inconvénient d’une telle approche est évident&nbsp;: les données ne sont disponibles qu’à J+1 ou J+2. Le moindre incident de production sur l’une des chaînes de batch, et tout s’arrête. Quant à la base de données où convergent tous ces fichiers, celle-ci atteint désormais plusieurs centaines de téraoctets.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Une architecture en médaillon 100 % cloud\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une architecture en médaillon 100&nbsp;% cloud</h2>\n <div class=\"imagecaption alignRight\">\n  <img src=\"https://cdn.ttgtmedia.com/visuals/NizarSalhajiBpifrance.jpg\" alt=\"Nizar Salhaji, responsable du domaine architecture, Bpifrance \" width=\"229\" height=\"233\">Nizar Salhaji, responsable du domaine\n  <br>architecture, Bpifrance\n </div>\n <p>En 2018, un projet de remplacement est lancé. L’idée est de se doter d’un véritable entrepôt de données moderne. Une architecture conçue selon l’architecture en médaillon avec les couches Raw, Bronze, Silver et Gold. Des modèles de données sont organisés par comptoirs correspondant aux grands métiers de la banque. «&nbsp;Dans ce modèle, nous sommes capables d’exposer des API pour les usages dits opérationnels&nbsp;», explique l’architecte. «&nbsp;Pour les usages de reporting, des extractions de données devaient être réalisées à partir de ces comptoirs, avec, à chaque fois, une nouvelle base de données dotée de son propre modèle de données dédié au reporting&nbsp;».</p>\n <p>Quelques années plus tard, un volet quasi-temps réel est ajouté à cette architecture. Bpifrance a déployé en production <a href=\"https://www.lemagit.fr/definition/Apache-Kafka\">Apache Kafka</a>. La plateforme est portée par un cloud public et met en œuvre de nombreuses solutions managées d’AWS. Si elle répond aux exigences lors de sa conception, Nizar Salhaji, responsable du domaine architecture chez Bpifrance, en souligne les limites&nbsp;: «&nbsp;Nous n’avons pas réussi à décentraliser les compétences, nous conservons toujours des équipes qui vont être un point de contention dans le développement&nbsp;», déclare-t-il. «&nbsp;Pour chaque nouvelle donnée à gérer, cela implique un développement spécifique&nbsp;».</p>\n <p>De même, l’architecture par comptoirs ne permet pas d’obtenir une vue à 360&nbsp;degrés sur toutes les données. «&nbsp;Nous devions aussi anticiper une grosse évolution de notre SI en termes de diffusion d’informations et d’utilisation de la donnée. Et nous imaginions très mal que ça allait être suffisant pour pouvoir répondre aux enjeux de cette refonte&nbsp;», poursuit-il.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"L’approche « Data In Flight » privilégie le temps réel\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’approche «&nbsp;Data In Flight&nbsp;» privilégie le temps réel</h2>\n <p>En 2023, une nouvelle approche est mise à l’étude, l’architecture «&nbsp;Data In Flight&nbsp;». Elle implique la bascule vers une approche majoritairement en temps réel. Kafka deviendrait alors l’unique diffuseur des données dans l’organisation. «&nbsp;Il s’agit, pour nous, de l’unique moyen de découpler à l’émission de temps réel. La seule chose qu’on demande aux producteurs de données, c’est de diffuser leurs données dans des topics Kafka [N.D.L.R., des groupes logiques de messages]&nbsp;», explique Christophe Jalady. «&nbsp;De leur côté, tous les consommateurs doivent consommer des données telles que les producteurs les ont diffusées&nbsp;».</p>\n <p>Les équipes agiles disposent <a href=\"https://www.lemagit.fr/actualites/366631482/MongoDB-82-la-recherche-vectorielle-et-lIA-agentique-arrivent-sur-site\">d’une base de données MongoDB</a> avec leurs propres données et des données consommées auprès de Kafka pour leurs applications. Elles diffusent également les flux à destination de cette plaque tournante des données. Outre ce volet purement technique, cette approche sensibilise le producteur de données, car il est responsable de ce qu’il expose aux autres équipes.</p>\n <p>Pour qu’une telle approche puisse fonctionner, il a fallu adapter le volet de la gouvernance. Le propriétaire d’une donnée ne peut évidemment pas arrêter de manière unilatérale sa source. S’il veut apporter une modification, il doit livrer une nouvelle version tout en maintenant les autres sur le principe du «&nbsp;dual run&nbsp;» tant que des consommateurs continuent de s’y connecter.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"L’accès aux données est simplifié par un graphe\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’accès aux données est simplifié par un graphe</h2>\n <div class=\"imagecaption alignLeft\">\n  <img src=\"https://cdn.ttgtmedia.com/visuals/ChristopheJaladyBpifrance.jpg\" alt=\"Christophe Jalady\" width=\"278\" height=\"289\">Christophe Jalady, architecte, Bpifrance\n </div>\n <p>En parallèle à cette architecture de type temps réel, l’équipe «&nbsp;Data&nbsp;» a construit un service transverse baptisé «&nbsp;Knowledge In Flight&nbsp;», alias KIF. Celui-ci permet d’effectuer des recherches sur l’ensemble des données diffusées sur l’architecture, dès qu’elles sont rendues disponibles par leur propriétaire. «&nbsp;Un composant de type graphe a pour rôle de consolider cette vision à 360&nbsp;degrés sur les données&nbsp;», indique Nizar Salhaji. «&nbsp;Cela joue un rôle d’auto-découverte&nbsp;: tout le monde peut faire des recherches dans ce graphe afin de trouver des objets métiers&nbsp;», détaille-t-il. Son deuxième rôle est de garder un historique de toutes les données et consulter, par exemple, toutes les versions d’un contrat. Le graphe compte aujourd’hui 1,5&nbsp;milliard de nœuds, 450&nbsp;millions de documents dans MongoDB, soit 250&nbsp;Go. Actuellement, le taux de couverture de ce graphe est de l’ordre de 70 à 80&nbsp;% de l’ensemble des données de Bpifrance.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;Sur la partie graphe, nous sommes capables de filtrer&nbsp;pour un utilisateur les objets métiers auxquels il a accès de manière générale, mais aussi sur des critères beaucoup plus précis.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Nizar Salhaji</strong>Responsable du domaine architecture, Bpifrance\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>L’accès aux données n’est bien évidemment pas ouvert à tous. Une gestion très fine des droits a été mise en place pour gérer les autorisations. Là encore, c’est le responsable d’une donnée qui doit attribuer les droits d’accès aux consommateurs. Nizar Salhaji précise&nbsp;: «&nbsp;Sur la partie graphe, nous sommes capables de filtrer&nbsp;pour un utilisateur les objets métiers auxquels il a accès de manière générale, mais aussi sur des critères beaucoup plus précis. Le consommateur doit faire une demande de droits et si elle est acceptée, il verra les données dans le graphe.&nbsp;»</p>\n <p>Cette approche a permis de proposer une plateforme de gestion de données <a href=\"https://www.lemagit.fr/definition/BI-en-libre-service\">en libre-service</a>. Les métiers peuvent directement chercher les données et les consommer de manière complètement autonome, sans solliciter les producteurs de données. En outre, disposer de l’historique complet de toutes les données est un atout en matière de conformité. C’est un point clé dans le secteur bancaire. Un auditeur peut très facilement accéder à l’ensemble des contrats sur une période spécifique. Avec, en prime, la garantie de disposer de données impossibles à falsifier. Les données transitant par Kafka sont réputées «&nbsp;immutables&nbsp;» «&nbsp;by design&nbsp;», explique Nizar Salhaji.</p>\n <p>Avec des alternatives open source, le choix de MongoDB et Kafka et Java est un choix réversible et ces technologies permettent de trouver plus simplement des compétences sur le marché.</p>\n <p>Parmi les défis qui attendent l’équipe Data figurent des projets d’analytique avancée et d’IA sur ces données, la mise en place d’un <a href=\"https://www.lemagit.fr/definition/Data-Lineage-tracabilite-des-donnees\">lineage automatique</a> et bien évidemment le décommissionnement des deux autres systèmes, toujours en production. Un plan a été lancé en ce sens en 2024 avec, dans un premier temps, une cartographie de tous les usages et leur portage progressif vers la nouvelle architecture.</p>\n</section>",
      "published_ts": 1763015040,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634435/Numerique-responsable-comment-resoudre-le-casse-tete-pose-par-lIA-generative",
      "title": "Numérique responsable : comment résoudre le casse-tête posé par l’IA générative",
      "summary": "<p><b>L’édition&nbsp;2025 du GreenTech Forum</b>, qui se tenait les 4 et 5&nbsp;novembre à Paris, témoigne d’une appropriation croissante des principes du numérique responsable parmi les grandes entreprises françaises.</p> \n<p>Les organisations représentées semblent en tout cas avoir franchi un cap de maturité. La simple mesure de l’empreinte carbone a laissé place à des stratégies plus structurées, qui s’appuient sur un pilotage de plus en plus fin et multicritère qui révèle mieux les véritables sources d’impact sur l’environnement.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"De la mesure ponctuelle au pilotage environnemental\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>De la mesure ponctuelle au pilotage environnemental</h2>\n <p>Des industriels comme Enedis et Arkema démontrent que l’enjeu réside désormais dans un pilotage environnemental industrialisé et multicritère.</p>\n <p>Chez l’opérateur de réseau Enedis, le bilan classique est passé à une évaluation exhaustive qui s’appuie sur les <a href=\"https://bigmedia.bpifrance.fr/nos-dossiers/product-environmental-footprint-pef-evaluer-limpact-environnemental-des-produits\">16&nbsp;indicateurs</a> du Product Environmental Footprint (PEF).</p>\n <p>Cette analyse multicritère a révélé que le changement climatique ne représente que 27&nbsp;% de l’impact global du SI d’Enedis. En revanche, l’épuisement des ressources (fossiles, minerais, métaux) en constitue 42&nbsp;%.</p>\n <p>Ce constat – partagé par Manon Beaufils, pilote GreenIT du groupe – a redéfini les priorités d’action et mis en lumière les enjeux stratégiques de résilience des chaînes d’approvisionnement jusqu’alors masqués par l’ancien prisme unique du CO2.</p>\n <p>Autre exemple, chez Arkema, une première mesure carbone a confirmé que l’empreinte de l’IT était «&nbsp;très inférieure à 1&nbsp;% du chiffre global&nbsp;», dixit son DSI, Sébastien Michon.</p>\n <p>L’enjeu était donc moins une réduction carbone massive que d’établir une culture de la responsabilité environnementale parmi les 20&nbsp;000&nbsp;collaborateurs. Pour ce faire, le passage à un outil spécialisé (Verdikt) s’est imposé pour transformer un exercice ponctuel en outil de pilotage.</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"La GenAI, une opacité inédite\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La GenAI, une opacité inédite</h2>\n <p>Mais ce mouvement vers une IT plus «&nbsp;green&nbsp;» se heurte à un nouveau défi&nbsp;: <a href=\"https://www.lemagit.fr/actualites/366620360/Empreinte-ecologique-de-lIA-generative-Capgemini-tire-la-sonnette-dalarme\">l’intégration de l’intelligence artificielle dans le périmètre de mesure</a> et le manque de transparence des fournisseurs.</p>\n <p>L’IA générative introduit en effet une opacité inédite. Tout au long du <a href=\"https://www.greentech-forum.com/\">GreenTech Forum</a>, les professionnels IT ont pointé le flou que les fournisseurs d’IA et de cloud entretiennent.</p>\n <p>Pour Jacques Kluska (Schneider Electric), Hélène Levrault (Verdikt) et Caroline Vateau (Capgemini Invent), comparer les impacts des modèles de Google ou <a href=\"https://www.lemagit.fr/actualites/366627946/Bilan-environnemental-des-LLM-ce-que-revele-letude-de-Mistral-AI\">de Mistral AI</a> (les seuls à avoir communiqué des données) relèverait de la gageure. Les méthodologies et périmètres de calcul varient. Ils sont rarement divulgués. Et ils rendent toute évaluation comparative hasardeuse, regrettent en résumé les trois experts.</p>\n <p>À cette opacité s’ajoute le phénomène du «&nbsp;Shadow AI&nbsp;». L’IA générative pénètre les entreprises de manière décentralisée, via les usages individuels sur des plateformes publiques comme ChatGPT, ou via son intégration discrète au sein de logiciels existants.</p>\n <p>Cette diffusion quasi virale rend l’empreinte matérielle et énergétique de la GenAI pratiquement impossible à tracer, remarque David Romeyer, architecte GreenIT chez Michelin, ce qui crée un «&nbsp;iceberg&nbsp;» d’impacts dont seule une infime partie serait visible.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"La gouvernance comme rempart\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La gouvernance comme rempart</h2>\n <p>Face à cette complexité, la gouvernance s’impose comme un levier majeur. Les entreprises les plus matures déploient deux approches complémentaires.</p>\n <p>Schneider Electric revendique une démarche centralisée. Le développement de ses solutions d’IA a été fédéré au sein d’un pôle unique pour standardiser les processus d’analyse de risque en amont de chaque projet, confie Jacques Kluska, son expert IA responsable.</p>\n <p>Une autre méthode est expérimentée chez Vinci. Marie Ait Daoud, Green IT Manager à la DSI, mobilise des leviers connexes&nbsp;: en s’appuyant sur les impératifs de cybersécurité, l’entreprise définit une liste d’IA autorisées, limitant ainsi la prolifération d’outils non maîtrisés.</p>\n <p>Ces stratégies partagent cependant un principe commun&nbsp;: elles challengent systématiquement le besoin réel d’une IA pour une tâche donnée.</p>\n <p><a href=\"https://www.lemagit.fr/etude/Dix-pistes-pour-diminuer-lempreinte-environnementale-de-vos-projets-de-GenAI\">D’autres leviers sont aussi activables</a>. L’une des pistes est le recours aux «&nbsp;Small Language Models&nbsp;» (SLM) – même si leur taille tend à croître (2 à 8&nbsp;milliards de paramètres), relève avec ironie Jacques Kluska. Pour des tâches industrielles spécifiques, ces modèles offrent des performances suffisantes, pour un coût financier et environnemental bien moindre.</p>\n <p>Une autre bonne pratique s’impose, <a href=\"https://www.lemagit.fr/actualites/366619814/Small-Language-Models-les-petits-modeles-dIA-montent-en-puissance\">en plus du choix d’un SLM&nbsp;</a>: faire l’inférence dans une région où l’énergie est à faible intensité carbone (comme la France ou la Suède). Avec cette double approche, il serait possible d’atteindre des gains sur l’impact carbone d’une requête qui vont jusqu’à x100.</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"La GenAI irréconciliable avec le Green IT ?\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La GenAI irréconciliable avec le Green IT&nbsp;?</h2>\n <p>Le <a href=\"https://www.epe-asso.org/publication-numerique-2025/\">rapport</a> d’Entreprises pour l’Environnement (EPE) met pour sa part en lumière une dichotomie entre IA «&nbsp;classique&nbsp;» et GenAI.</p>\n <p>L’IA analytique «&nbsp;historique&nbsp;» aurait prouvé sa valeur environnementale dans l’optimisation ou la maintenance prédictive. En revanche, l’IA générative, <a href=\"https://www.lemagit.fr/tribune/Ne-pas-soccuper-de-lempreinte-energetique-de-lIA-generative-est-un-pari-triplement-risque\">gourmande en ressources</a>, reste une promesse dont le «&nbsp;business case&nbsp;» est encore à écrire.</p>\n <p>L’expert de Schneider Electric, Jacques Kluska, confirme que l’impact environnemental varie considérablement selon le type d’IA. Les modèles complexes – dont font partie les LLMs – requièrent beaucoup plus d’énergie et de matériel.</p>\n <p>David Romeyer, de Michelin, l’illustre en s’arrêtant sur un composant essentiel : les processeurs graphiques. Les CPU classiques, à environ 100&nbsp;W de consommation, sont éclipsés par des GPU qui peuvent atteindre 2000&nbsp;watts. «&nbsp;Nous avons changé de dimension&nbsp;», résume l’architecte. «&nbsp;Penser que l’on va résoudre le problème en optimisant le PUE [N.D.R., Power Usage Effectiveness], ça ne marche plus&nbsp;».</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Des actions sur le Make, un angle mort sur le Buy\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Des actions sur le Make, un angle mort sur le Buy</h2>\n <p>Et quid de la fameuse question du «&nbsp;Make or Buy&nbsp;»&nbsp;? Elle prend ici une dimension supplémentaire. La conception en interne de solutions d’IA – notamment avec des SLM – permet de maîtriser plus facilement les impacts écologiques. Avec cette option, finie l’opacité des intermédiaires.</p>\n <p>Sur ses IA développées en interne, Schneider Electric a par ailleurs recours à des ACV (Analyse du Cycle de Vie). Les études, sur 16&nbsp;critères, auraient montré un ratio de gain environnemental très élevé (de 1:60 jusqu’à 1:1000) pour l’IA prédictive et analytique.</p>\n <p>Et l’impact négatif de ces IA serait largement compensé par les gains d’énergie générés par les solutions. Ce serait le cas par exemple avec l’optimisation des systèmes CVC (Chauffage, Ventilation et Climatisation).</p>\n <p>L’industriel s’appuie en outre sur des référentiels reconnus, comme <a href=\"https://ecoresponsable.numerique.gouv.fr/actualites/afnorspec-IAfrugale/\">l’AFNOR Spec IA Frugale</a>, qui fournit des définitions, des méthodes de calcul et 31&nbsp;bonnes pratiques.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Les données fournisseurs à prendre avec des pincettes\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les données fournisseurs à prendre avec des pincettes</h2>\n <p>Évidemment, si la GenAI est fournie par un tiers, ces bonnes pratiques ne sont pas applicables. Et la mesure se heurte à un mur. Pour ces modèles propriétaires, les chiffres d’impact d’une inférence ne sont que peu publiés, voire pas du tout –, regrettent quasiment tous les intervenants.</p>\n <p>Et lorsque des chiffres sont communiqués, les méthodologies de calcul et les périmètres diffèrent d’un acteur à un autre. Jacques Kluska cite <a href=\"https://www.lemagit.fr/actualites/366629905/Empreinte-ecologique-et-lIA-generative-Google-tente-deteindre-le-debut-dincendie\">l’étude publiée par Google</a>, qui ne mentionne pas le nombre de tokens échangés, rendant ainsi difficiles les comparaisons.</p>\n <blockquote class=\"main-article-pullquote\">\n  <div class=\"main-article-pullquote-inner\">\n   <figure>\n    «&nbsp;L’opacité des fournisseurs est un problème qui dure depuis longtemps.&nbsp;»\n   </figure>\n   <figcaption>\n    <strong>Fabien Metivet</strong>Spécialistes du numérique responsable, Crédit Agricole\n   </figcaption>\n   <i class=\"icon\" data-icon=\"z\"></i>\n  </div>\n </blockquote>\n <p>Richard Bury et Fabien Metivet, respectivement spécialistes du numérique responsable d’EDF et du Crédit Agricole, l’ont confirmé au MagIT lors du Forum&nbsp;: la confiance accordée aux données des hyperscalers est «&nbsp;limitée&nbsp;».</p>\n <p>La raison&nbsp;? L’empreinte carbone qu’ils communiquent ne correspondrait pas à la valeur réelle de leurs datacenters (de plus en plus implantés dans des zones en tension énergétique et hydrique). Cette valeur serait minorée par les effets de compensation et l’achat de certificats d’économie d’énergie.</p>\n <p>Pourquoi un tel manque de transparence&nbsp;? Officiellement, les fournisseurs invoquent des raisons de sécurité et de secret industriel, répond Fabien Metivet qui attend cependant de ces acteurs qu’ils «&nbsp;ouvrent le capot&nbsp;». Mais sans se faire d’illusions&nbsp;: «&nbsp;l’opacité des fournisseurs est un problème qui dure depuis longtemps&nbsp;».</p>\n</section>       \n<section class=\"section main-article-chapter\" data-menu-title=\"La GenAI, un problème d’abord pour le B2C ?\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La GenAI, un problème d’abord pour le B2C&nbsp;?</h2>\n <p>Reste un dernier levier d’action&nbsp;: les appels d’offres.</p>\n <p>Dans des entreprises externalisées (72&nbsp;% pour le numérique chez EDF), les achats constituent un moyen puissant de challenger les fournisseurs en renforçant les exigences. À condition d’accepter de ne pas sélectionner les LLM sur leurs seules performances techniques et sur les seules variables financières.</p>\n <p>Une gageure, <a href=\"https://www.lemagit.fr/actualites/366624206/Avec-la-dictature-du-court-terme-nos-entreprises-sacrifient-elles-leur-avenir-technologique\">à l’ère du court terme</a> et d’un certain désengagement des grandes puissances concernant les enjeux environnementaux&nbsp;?</p>\n</section>",
      "published_ts": 1763012820,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/accessibilite-numerique-des-associations-attaquent-en-justice-des-acteurs-de-la-grande-distribution-484864.htm#xtor=RSS-1",
      "title": "Accessibilité numérique : des associations attaquent en justice des acteurs de la grande distribution",
      "summary": "Trois associations assignent en justice les marques Carrefour, Auchan, E.Leclerc et Picard. Le motif de la plainte : le manque d'accessibilité numérique de leurs services de courses en ligne.",
      "published_ts": 1763010705,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/la-cle-de-la-mise-en-oeuvre-de-lia-pourrait-bien-etre-un-scepticisme-de-bon-aloi-voici-pourquoi-484823.htm#xtor=RSS-1",
      "title": "La clé de la mise en œuvre de l'IA pourrait bien être un scepticisme de bon aloi - voici pourquoi",
      "summary": "Même les entreprises les plus axées sur la technologie abordent l'IA et l'IA générative avec autant d'optimisme que de prudence.",
      "published_ts": 1762999893,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-13-11-2025-wi-fi-ou-6g-maj-w10-esu-lechec-des-formations-anti-phishing-484783.htm#xtor=RSS-1",
      "title": "ZDNET Morning 13/11/2025 : Wi-Fi ou 6G ? Maj W10 ESU, L'échec des formations anti-phishing, ...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1762996316,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545977-yann-lecun-quitte-meta-le-desaccord-qui-revele-la-crise-de-vision-de-l-ia/",
      "title": "Yann LeCun quitte Meta : le désaccord qui révèle la crise de vision de l'IA",
      "summary": "Le départ de Yann LeCun met en lumière la crise de vision qui oppose la science de long terme à la logique économique de court terme dans l'IA.",
      "published_ts": 1762961316,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.journaldunet.com/intelligence-artificielle/1545953-l-ia-est-elle-reellement-au-service-de-l-humanite/",
      "title": "L'IA est-elle réellement au service de l'humanité",
      "summary": "L'analyse du comportement humain par l'intelligence artificielle est une réalité, elle s'impose dans le domaine de la compréhension des interactions sociales, des décisions d'achat et des processus cognitifs. Cette technologie, L'IA désormais déployée dans de nombreux secteurs, soulève des questions essentielles sur ses objectifs réels et ses implications pour la société.",
      "published_ts": 1762961190,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634289/Chiffrement-post-quantique-dans-OpenShift-les-entreprises-nen-auront-pas-besoin-avant-2035",
      "title": "Chiffrement post-quantique dans OpenShift : les entreprises n’en auront pas besoin avant 2035",
      "summary": "<p>A l’occasion de l’édition nord-américaine de la KubeCon&nbsp;2025, Red Hat a annoncé la disponibilité générale d’OpenShift&nbsp;4.20. Une mise à jour placée sous le signe de la cybersécurité et de la résilience.</p> \n<p>La filiale d’IBM commence par la prise en charge du chiffrement post-quantique. Pour mémoire, cette approche consiste à se protéger contre la menace hypothétique de superordinateurs, potentiellement <a href=\"https://www.lemagit.fr/definition/Informatique-quantique\">quantiques</a>, capables de casser les clés de chiffrement issues d’algorithmes comme RSA et ECC.</p> \n<p>Le NIST (National Institute of Standards and Technology) a développé trois standards d’implémentation de techniques de chiffrement post-quantique&nbsp;: <a href=\"https://www.lemagit.fr/actualites/366555098/Le-chiffrement-post-quantique-se-standardise\">les FIPS&nbsp;203, 204 et 205</a>. En juin dernier, Red Hat avait déjà ajouté la prise en charge des algorithmes d’encapsulation et de désencapsulation de clés&nbsp;ML-KEM et RSASVE dans RHEL 10. C’est au tour d’OpenShift d’y passer. Plus spécifiquement, l’éditeur applique la technique au mTLS, un type d’authentification mutuelle associée au protocole de sécurisation des échanges de paquets TLS.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Chiffrement post-quantique dans Kubernetes : Red Hat prend les devants, même s’il a le temps\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Chiffrement post-quantique&nbsp;dans Kubernetes&nbsp;: Red Hat prend les devants, même s’il a le temps</h2>\n <p>Il s’agit plus particulièrement de renforcer la protection des communications entre l’API Server, <a href=\"https://www.lemagit.fr/conseil/Kubernetes-comment-fonctionnent-les-pilotes-de-stockage-CSI\">Kubelet</a>, le planificateur et le contrôleur du cœur Kubernetes sous-jacent.</p>\n <p>Ici, Red Hat s’appuie sur une librairie de la version&nbsp;1.24 de Go, le langage dans lequel Kubernetes est écrit.</p>\n <p>«&nbsp;La version&nbsp;1.24 de Go a marqué une étape importante en introduisant la prise en charge du mécanisme <a href=\"https://www.lemagit.fr/actualites/366555597/Cosmian-mixe-chiffrement-pre-et-post-quantique\">d’échange de clés hybride</a>s&nbsp;X25519MLKEM768&nbsp;», écrit dans un billet de blog Jean-Philippe Jung, responsable produit sécurité d’OpenShift et d’OpenStack chez Red Hat.</p>\n <p>Le système utilisé combine «&nbsp;le mécanisme classique&nbsp;X25519 (courbe elliptique Diffie-Hellman) et ML-KEM-768 (algorithme post-quantique). Le secret partagé final est dérivé des deux mécanismes combinés&nbsp;», ajoute-t-il.</p>\n <p>Cette approche permettrait de bénéficier des avantages des deux technologies de chiffrement. Cette combinaison est surtout nécessaire puisque l’implémentation des algorithmes <a href=\"https://www.lemagit.fr/actualites/366619619/Chiffrement-post-quantique-Google-Cloud-commence-par-la-signature-numerique\">n’est pas standardisée</a> dans la plupart des systèmes. Les fournisseurs cloud et les grands éditeurs proposent des déploiements parfois radicalement différents. En la matière, Red Hat tente d’aller un peu plus vite que le projet Kubernetes, sans pour autant trop s’en éloigner.</p>\n <p>Il faut dire que la galerie de composants de l’orchestrateur n’évolue pas au même rythme. &nbsp;</p>\n <p>Par exemple, etcd, la base de données clé-valeur <a href=\"https://www.lemagit.fr/conseil/Administration-Kubernetes-tout-comprendre-au-composant-central-etcd\">qui stocke les informations sur le fonctionnement des clusters</a>, utilise encore Go&nbsp;1.23. Les contributeurs de Kubernetes estiment que la «&nbsp;source de vérité&nbsp;» des clusters&nbsp;K8s doit maintenir une forme de stabilité, d’intégrité des données et de bonnes performances, dixit Jean Philippe Jung.</p>\n <p>Et c’est aux primoadoptants de faire attention à ces possibles incompatibilités entre les composants d’un même cluster Kubernetes.</p>\n <p>«&nbsp;Par exemple, si un client kubectl construit avec une version de Go prenant en compte&nbsp;ML-KEM communique avec un serveur API plus ancien, la négociation TLS peut passer silencieusement à un algorithme de chiffrement classique&nbsp;», illustre Jean-Philippe Jung. «&nbsp;Cela entraînerait la perte de la protection post-quantique, sans avertissement explicite. Il est donc essentiel de confirmer que tous les composants de votre environnement OpenShift utilisent des versions compatibles qui prennent en charge PQC&nbsp;».</p>\n <p>Si le chiffrement post-quantique dans Kubernetes et OpenShift est balbutiant (<a href=\"https://www.lemagit.fr/actualites/366626337/RHEL-10-Red-Hat-conteneurise-la-gestion-des-deploiements-de-son-OS\">et sûrement un peu marketing</a>), il n’en reste pas moins qu’une forme de préparation est nécessaire, notent les porte-parole de la filiale d’IBM. Les acteurs malveillants et certains États sont soupçonnés de stocker des données en attente d’avoir la puissance de calcul pour les déchiffrer.</p>\n <p>De son côté, Red Hat estime que les entreprises issues de secteurs critiques n’ont pas besoin du chiffrement post-quantique avant 2035. La date n’est pas choisie au hasard. Et elle n’a pas grand-chose à voir avec le développement d’ordinateur quantique enfin complet. Le NIST a pour <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-131Ar3.ipd.pdf\">projet</a> de déprécier les algorithmes&nbsp;RSA-2048 et ECC-256 bits en 2030, puis de les désactiver en 2035.</p>\n <p>Les acteurs du marché IT ont encore dix ans pour se mettre d’accord.</p>\n</section>             \n<section class=\"section main-article-chapter\" data-menu-title=\"La gestion externalisée des secrets enfin disponible\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>La gestion externalisée des secrets enfin disponible</h2>\n <p>En attendant, la sortie d’OpenShift&nbsp;4.20 est l’occasion pour Red Hat d’annoncer la disponibilité générale d’un moyen d’apporter son propre fournisseur d’identité OIDC. Les administrateurs accèdent également à un framework de gestion de sécurité sans confiance basé sur le projet SPIFFE (Secure Production Identity Framework for Everyone).</p>\n <p><a href=\"https://www.lemagit.fr/actualites/366575394/Istio-Ambient-Mesh-franchit-lobstacle-de-linteroperabilite-dans-le-cloud\">Pour les plus motivés</a>, Red Hat se propose de se mettre à Istio à travers Red Hat OpenShift Service Mesh&nbsp;3.2. L’implémentation de la technologie de maillage de (micro) services prend désormais en charge le mode Ambient. Cette approche sans side-car permettrait de réduire la gestion du chiffrement des flux mTLS entre pods, de simplifier l’observabilité et l’application des règles de sécurité réseau. Le tout à un coût plus faible qu’à l’accoutumée.</p>\n <p>De plus, il est dorénavant possible de s’appuyer sur des services de gestion de secrets externes via un opérateur. Les secrets peuvent être stockés dans AWS Secret Manager et Systems Manager Parameter Store, HashiCorp Vault, Google Secret Manager, <a href=\"https://www.lemagit.fr/essentialguide/A-la-decouverte-des-services-de-chiffrement-des-fournisseurs-cloud\">Azure Key Vault</a>, ou encore IBM Key Secrets Manager. L’opérateur gère l’application external-secrets. Il appelle les clés pour les provisionner et les rafraîchir à l’échelle d’un cluster.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Une haute à disponibilité à deux nœuds (ou presque)\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Une haute à disponibilité à deux nœuds (ou presque)</h2>\n <p>Red Hat n’oublie pas ses clients on premise. Il vante un nouveau mode de déploiement d’OpenShift basé sur seulement deux nœuds. Pour cela, il s’appuie sur le projet Arbiter, outil de planification et de mise à l’échelle pour Kubernetes. Il s’agit là de réduire les coûts d’infrastructure tout en maintenant une forme de haute disponibilité. En réalité, ce «&nbsp;form factor&nbsp;» dépend de trois nœuds&nbsp;: deux nœuds disposant du control plane OpenShift Container Plaftform et un nœud Arbiter. Il est toutefois léger. «&nbsp;Le nœud Arbiter stocke l’intégralité des données etcd, ce qui permet de maintenir un quorum etcd et d’éviter le “split brain”&nbsp;», précise la documentation de la filiale d’IBM.</p>\n <p>Dans le cas de Kubernetes, un scénario «&nbsp;split brain&nbsp;» (séparation du cerveau, en français) se produit quand une panne réseau ou autre provoque la séparation et l’isolation des nœuds d’un cluster etcd. La «&nbsp;source de vérité&nbsp;» est alors divisée en deux parties ou plus. Ici, le nœud Arbiter contient l’ensemble des données etcd en provenance des deux autres nœuds.</p>\n <p>«&nbsp;Le nœud Arbiter n’exécute pas les composants supplémentaires du plan de contrôle kube-apiserver et kube-controller-manager, ni les charges de travail&nbsp;». Il n’aurait besoin que de 2vCPU et de 8&nbsp;Go de mémoire vive pour fonctionner.</p>\n <p>Enfin, l’opérateur réseau des clusters OpenShift prend en charge «&nbsp;nativement&nbsp;» le routage BGP (Border Gateway Protocol) à travers le plug-in OVN-Kubernetes. Cela permettrait de faciliter les échanges entre la plateforme de conteneurisation et les autres réseaux dans les data centers on premise des entreprises. «&nbsp;Cela signifie une adaptation plus rapide aux changements de réseau, à la migration des machines virtuelles ou aux événements de basculement (fail-over)&nbsp;», assure Red Hat dans un communiqué. Pour l’instant, ce routage est seulement disponible pour les machines bare-metal, mais une prise en charge des fournisseurs cloud est également sur la feuille de route.</p>\n <p>À noter qu’OpenShift&nbsp;4.20 bénéficie d’un support étendu à l’ensemble des services d’infrastructure d’Oracle, <a href=\"https://www.lemagit.fr/conseil/Lessentiel-sur-Oracle-Alloy-le-cloud-en-marque-blanche-dOracle\">dont Alloy et EU Sovereign Cloud.</a></p>\n</section>",
      "published_ts": 1762950660,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634311/Sante-lediteur-du-logiciel-medical-Weda-coupe-ses-services-par-precaution",
      "title": "Santé : l’éditeur du logiciel médical Weda coupe ses services « par précaution »",
      "summary": "<p>C’est ce mercredi 12 novembre, en début de matinée, que plusieurs sources ont commencé à solliciter <i>LeMagIT </i>: Weda ne répond plus et plusieurs dizaines de milliers de professionnels de santé sont affectés.</p> \n<p>Weda, c’est un éditeur de logiciels métiers en mode SaaS pour médecins généralistes, spécialistes mais aussi sage-femmes, maisons de santé, centre de santé, ou encore le paramédical.</p> \n<p>Dans son offre, on trouve de quoi gérer le dossier médical, avec assistant de consultation, assistant vocal de génération des comptes-rendus de consultations – 85 000 praticiens sont revendiqués –, ou encore gestion des prescriptions. À cela s’ajoute un agenda médical, des outils de collaboration dont une messagerie, ainsi que des outils de gestion administrative. Weda fait partie du groupe Vidal depuis l’automne 2020.</p> \n<p>Plusieurs praticiens confirment être «&nbsp;retournés au papier crayon&nbsp;» quand d’autres parlent de «&nbsp;paralysie totale&nbsp;».</p> \n<p>C’est ce lundi 10 novembre, à 23h, que Weda a fermé l’accès à ses services SaaS. Dans un message adressé à ses utilisateurs, dont copie nous a été fournie, l’éditeur indique que, quelques heures plus tôt, ses « équipes ont détecté une activité inhabituelle sur certains comptes utilisateurs, laissant penser à des tentatives d’accès non autorisés ».</p> \n<p>C’est donc «&nbsp;par précaution&nbsp;», explique Weda, que la «&nbsp;plateforme a été mise en maintenance […] afin de stopper immédiatement toute possibilité de fuite de données&nbsp;».</p> \n<p>L’éditeur indique que, «&nbsp;depuis cette décision, [ses] équipes techniques et de cybersécurité travaillent sans relâche, en collaboration avec des experts externes, pour renforcer les mesures de protection&nbsp;». Et d’assurer que «&nbsp;la faille d'accès est fermée et aucune nouvelle activité suspecte n’a été détectée&nbsp;».</p> \n<p>Las, explique Weda, « les premières analyses indiquent que les accès malveillants auraient pu permettre une extraction partielle de données, mais ni l’ampleur ni la confirmation formelle d'une fuite de données ne sont encore établies ». L’éditeur ne fournit pas de calendrier de relance de ses services SaaS et explique que «&nbsp;la réouverture du service ne se fera qu’après validation complète de la sécurité par [ses] experts&nbsp;».</p> \n<p>Nous avons sollicité les commentaires de Weda et du groupe Vidal, en leur adressant <a href=\"https://www.lemagit.fr/tribune/7-questions-cles-pour-les-victimes-de-cyberattaque\">nos questions usuelles</a> en de telles circonstances. Elles sont sans réponse à l’heure où nous publions ces lignes.</p> \n<p>Dans une telle situation, <a href=\"https://www.lemagit.fr/tribune/7-questions-cles-pour-les-victimes-de-cyberattaque\">déterminer</a> si des données ont été volées, lesquelles, et en quelle quantité peut prendre du temps. La description faite de l’incident à ce stade peut suggérer un détournement d’identifiants légitimes de professionnels de santé utilisateurs des applications métier de Weda.</p> \n<p>Hudson Rock a référencé plus de 55 comptes d’utilisateurs des services SaaS de l’éditeur ainsi compromis par cleptogiciel – ou <i>infostealers</i>. Des compromissions étant survenues sur les postes de travail des utilisateurs et pas sur les systèmes d’information de Weda.</p> \n<p>Un tel scénario n’aurait hélas rien d’exceptionnel. Le groupe d’acteurs malveillants Stormous nous l’a encore <a href=\"https://www.lemagit.fr/actualites/366633627/Cleptogiciels-une-menace-persistante-qui-se-rappelle-encore-a-nous\">rappelé fin octobre</a> à l’occasion de la revendication d’une prétendue cyberattaque <a href=\"https://www.lemagit.fr/actualites/366633511/Que-sait-on-de-la-pretendue-cyberattaque-contre-France-Travail\">contre France Travail</a>.</p>",
      "published_ts": 1762945740,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lebigdata.fr/un-chanteur-100-ia-grimpe-au-sommet-du-billboard-et-trompe-tout-le-monde",
      "title": "Un chanteur 100 % IA grimpe au sommet du Billboard et trompe tout le monde",
      "summary": "Un artiste virtuel en tête des classements, cela semblait encore improbable il y a peu. Pourtant, Breaking Rust, né de … Cet article Un chanteur 100 % IA grimpe au sommet du Billboard et trompe tout le monde a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762888656,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/openai-en-panique-son-ia-ressuscite-des-stars-sans-autorisation",
      "title": "OpenAI en panique : son IA ressuscite des stars sans autorisation",
      "summary": "Faire parler un défunt, Sora 2, l’IA générateur de vidéos d’OpenAI, l’a fait. Quoique, tout le monde n’est pas émerveillé … Cet article OpenAI en panique : son IA ressuscite des stars sans autorisation a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762885477,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/le-pere-de-lia-previent-pour-quelle-rapporte-il-faut-virer-les-humains",
      "title": "Le père de l’IA prévient : pour qu’elle rapporte, il faut virer les humains",
      "summary": "Depuis des siècles, chaque innovation promet de soulager l’humain sans jamais l’effacer. La machine à vapeur, l’ordinateur ou Internet ont … Cet article Le père de l’IA prévient : pour qu’elle rapporte, il faut virer les humains a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762885236,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/whatsapp-et-signal-votre-protection-nest-pas-totale-dit-la-dgse",
      "title": "WhatsApp et Signal : votre protection n’est pas totale, dit la DGSE",
      "summary": "WhatsApp, Signal, Telegram, on les considère souvent comme les forteresses ultimes de nos conversations privées. Pourtant, tout n’est pas inviolable. … Cet article WhatsApp et Signal : votre protection n’est pas totale, dit la DGSE a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762883296,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/meta-renforce-sa-puissance-ia-mais-ses-profits-font-un-plongeon-inquietant",
      "title": "Meta renforce sa puissance IA, mais ses profits font un plongeon inquiétant",
      "summary": "Tout allait bien chez de Meta. Les publicités cartonnent, les utilisateurs défilent, les revenus explosent. Puis, au milieu de la … Cet article Meta renforce sa puissance IA, mais ses profits font un plongeon inquiétant a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762879504,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/en-chine-les-scenaristes-passent-a-la-trappe-lia-ecrit-les-series",
      "title": "En Chine, les scénaristes passent à la trappe : l’IA écrit les séries",
      "summary": "L’IA commence à prendre la place de tout le monde. En Chine, les séries ne sont plus écrites par des … Cet article En Chine, les scénaristes passent à la trappe : l’IA écrit les séries a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762877523,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/iphone-16e-128-go-a-prix-choc-seulement-489-e-au-lieu-de-719-e-chez-rakuten-32",
      "title": "iPhone 16e 128  Go à prix choc : seulement 489 € au lieu de 719 € chez Rakuten (-32 %)",
      "summary": "Le plus abordable des iPhone chute à un tarif inédit : 489 € seulement au lieu de 719 €, grâce … Cet article iPhone 16e 128  Go à prix choc : seulement 489 € au lieu de 719 € chez Rakuten (-32 %) a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762873866,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/les-depenses-folles-openai-ne-toucheront-pas-sam-altman",
      "title": "Les dépenses folles d’OpenAI ne toucheront pas Sam Altman",
      "summary": "Sam Altman évite toute responsabilité pour les dépenses massives d’OpenAI. Sans enjeux financiers, il mise sur des renégociations ou une … Cet article Les dépenses folles d’OpenAI ne toucheront pas Sam Altman a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762872363,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://www.lebigdata.fr/meta-quest-3-10x-moins-cher-que-lapple-vision-pro-il-explose-les-ventes-sur-aliexpress",
      "title": "Meta Quest 3 : 10x moins cher que l’Apple Vision Pro, il explose les ventes sur AliExpress",
      "summary": "Le casque VR/AR haut de gamme de Meta s’effondre à seulement 390 € au lieu de 699 €. En ajoutant … Cet article Meta Quest 3 : 10x moins cher que l’Apple Vision Pro, il explose les ventes sur AliExpress a été publié sur LEBIGDATA.FR .",
      "published_ts": 1762869830,
      "source_name": "Le Big Data"
    },
    {
      "url": "https://powerbi.microsoft.com/en-us/blog/microsoft-named-leader-and-outperformer-in-the-2025-gigaom-radar-for-semantic-layers-metric-stores/",
      "title": "Microsoft named Leader and Outperformer in the 2025 GigaOm Radar for Semantic Layers &amp; Metric Stores",
      "summary": "In today’s data-driven world, semantic models have become the backbone of trustworthy analytics. They define business logic, metrics, and relationships that turn raw data into meaningful, trusted and curated insights. As organizations embrace generative AI, semantic models provide the structure and context that AI needs to deliver accurate, reliable answers.  At Microsoft, we have spent nearly two decades refining the semantic layer that connects data … Continue reading “Microsoft named Leader and Outperformer in the 2025 GigaOm Radar for Semantic Layers & Metric Stores “",
      "published_ts": 1762858928,
      "source_name": "Power BI Blog"
    },
    {
      "url": "https://www.numerama.com/tech/2114763-le-morceau-actuellement-top-1-country-est-genere-par-ia-je-lai-ecoute-jaime-bien-et-cest-un-probleme.html",
      "title": "Le morceau actuellement top 1 country est généré par IA : je l’ai écouté, j’aime bien (et c’est un problème)",
      "summary": "Un titre de country généré par IA, par un artiste IA, est top 1 des écoutes numériques. Problème pour les musiciens : il est vraiment pas mal.",
      "published_ts": 1762852663,
      "source_name": "Numerama"
    },
    {
      "url": "https://blog.zenika.com/2025/11/11/llm-assistance/",
      "title": "Using Jest and LLM assistance to test your real-time chat",
      "summary": "In the\nprevious article\n, we delved into creating a simple web server that serves static files, flat file database that uses lock and the API endpoints that allows for real-time chat interaction. In this article, we’ll follow-up by taking a look into writing unit tests for our flat file database to ",
      "published_ts": 1762840995,
      "source_name": "Zenika Tech Blog"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-11-11-2025-qualcomm-detrone-apple-carriere-et-si-lia-boostait-vos-chances-boostez-vos-slides-avec-gemini-484744.htm#xtor=RSS-1",
      "title": "ZDNET Morning 11/11/2025 : Qualcomm détrône Apple, Carrière : et si l'IA boostait vos chances ? Boostez vos slides avec Gemini,...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1762823466,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.numerama.com/tech/2114311-xpeng-devoile-iron-un-robot-humanoide-quil-compte-livrer-des-2026.html",
      "title": "XPeng dévoile IRON, un robot humanoïde qu’il compte livrer dès 2026",
      "summary": "Quelques jours après la présentation de Neo, le robot domestique de la startup 1X Technologies, XPeng entre à son tour dans la course aux humanoïdes. Le constructeur chinois a dévoilé la dernière version d'IRON, un robot qu’il espère produire à grande échelle d’ici fin 2026.",
      "published_ts": 1762794353,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634339/Celonis-France-resserre-sa-strategie-autour-de-ses-clients-existants",
      "title": "Celonis France recadre sa stratégie autour de ses clients existants",
      "summary": "<p>Brice Faure, ancien dirigeant d’Anaplan en France, passé par SAP, a pris la tête de la direction générale de Celonis France en février 2025.</p> \n<p>Il remplace Fadi Naffah qui, peu de temps après son départ, a rejoint le concurrent Aris en tant Chief Revenue Officer.</p> \n<p>Lui affirmait avoir <a href=\"https://www.lemagit.fr/actualites/366614836/En-France-Celonis-gagne-du-terrain-chez-les-grands-groupes\">convaincu 57&nbsp;clients français en quatre ans</a>. Trois entreprises avaient choisi la suite d’analyse et d’automation des processus (process mining, process intelligence) avant son installation dans le <a href=\"https://www.lemagit.fr/actualites/252508826/Process-Mining-Celonis-affiche-de-fortes-ambitions-en-France\">bureau parisien, en 2020</a>. Brice Faure évoque une quarantaine de clients, avec pour objectif d’en signer une vingtaine supplémentaire d’ici à deux ans.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Se concentrer sur les grands comptes pour doubler le chiffre d’affaires\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Se concentrer sur les grands comptes pour doubler le chiffre d’affaires</h2>\n <p>«&nbsp;Notre objectif est de doubler le chiffre d’affaires de l’entité française&nbsp;», ajoute l’actuel vice-président et directeur général de Celonis France,&nbsp;lors d’un point presse. Il participait à la conférence annuelle Celosphere qui se déroulait du 3 au 5&nbsp;novembre à Munich. «&nbsp;Le groupe prévoit une croissance annuelle de 30 à 40&nbsp;%&nbsp;».</p>\n <div class=\"imagecaption alignLeft\">\n  <img src=\"https://cdn.ttgtmedia.com/visuals/LeMagIT/bricefaure.jpg\" alt=\"Brice Faure, vice-président &amp; DG France, Celonis\">Brice Faure, \n  <br>vice-président &amp; DG France, Celonis\n </div>\n <p>Celonis est adopté par un peu plus de la moitié des groupes du CAC40. Pour autant, les déploiements à l’échelle ne sont pas encore une généralité. Le chiffre d’affaires, bien qu’en hausse par rapport à l’année passée, n’est pas au niveau des attentes de l’éditeur.</p>\n <p>«&nbsp;Nous avons un retard à rattraper. Et ce retard, pour moi, ne peut se combler que par la maximisation de nos revenus chez nos clients existants&nbsp;», note Brice Faure.</p>\n <p>En France, Celonis veut donc se concentrer sur les grands comptes généralement convaincus par les apports du process mining. Ce qui implique une nouvelle organisation, en cours de développement.</p>\n <p>«&nbsp;Ouvrir des comptes, c’est une chose, mais ensuite il faut les suivre, les garder, les développer et l’on ne peut pas tout faire&nbsp;», pose le directeur général de Celonis France.</p>\n <p>De ce fait, pour répondre aux besoins des ETI, Celonis misera davantage sur les partenaires autres que les grands intégrateurs. Le dirigeant indique que cette partie de la stratégie est en cours de structuration.</p>\n</section>        \n<section class=\"section main-article-chapter\" data-menu-title=\"Place au « tailor made », à l’expertise sectorielle\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Place au «&nbsp;tailor made&nbsp;», à l’expertise sectorielle</h2>\n <p>Du côté des grands comptes, ce développement passe par des commerciaux nommés, et ce que Celonis appelle des «&nbsp;Value Engineers&nbsp;». Ce sont des ingénieurs couvrant l’ensemble du cycle, de l’avant à l’après-vente. Ceux-là sont en cours de spécialisation. Ils doivent accompagner les projets des clients les plus avancés. Ils tiennent généralement un rôle de supervision au côté des grands cabinets de conseil et les intégrateurs sur les premiers projets.</p>\n <p>Il s’agit d’aller au-delà des «&nbsp;gains les plus faciles à obtenir&nbsp;», comme l’expliquait l’année dernière Fadi Naffah.</p>\n <p>«&nbsp;Celonis le reconnaît aujourd’hui, nous nous concentrions trop sur les processus standards&nbsp;: compte fournisseurs, compte clients, gestion d’inventaires, etc.&nbsp;», rappelle Brice Faure. «&nbsp;Nous devons proposer du “tailor made”, une expertise sur des processus métier critique pour nos clients&nbsp;».</p>\n <p>Techniquement, cela implique de passer de l’analyse de processus à l’orchestration d’actions correctives et d’amélioration continue. Ce vers quoi les clients les plus avancés, <a href=\"https://www.lemagit.fr/etude/Comment-Saint-Gobain-suit-ses-processus-metiers-en-continu\">comme Saint-Gobain en France</a>, BMW et Mercedes-Benz en Allemagne, se sont dirigés. <a href=\"https://www.lemagit.fr/actualites/366634061/IA-agentique-un-argument-de-plus-en-faveur-du-process-mining-selon-Celonis\">L’IA et l’orchestrateur de flux automatisés, codéveloppé avec Emporix</a>, peuvent y participer. C’est la feuille de route défendue par l’éditeur.</p>\n <p>De son côté, Celonis France doit recruter des experts métiers par ligne d’activité. «&nbsp;Nous avons des équipes dédiées au manufacturing, au CPG, au secteur bancaire qui sont parmi les principales industries couvertes par Celonis&nbsp;», liste Brice Faure. «&nbsp;Nous avons quelqu’un qui ne traite que des processus des opérateurs télécoms, une autre personne traite des sujets des énergéticiens, etc.&nbsp;»</p>\n <p>Cela vaut aussi pour certains volets plus horizontaux. Par exemple, cette année, LeMagIT a pu échanger avec le «&nbsp;champion de l’IA&nbsp;» chez Celonis en France.</p>\n <p>L’éditeur recherche des profils sortis des grandes écoles «&nbsp;capables de s’adapter&nbsp;rapidement&nbsp;» et qui ont, de préférence, plusieurs années d’expérience dans un des domaines cités plus haut.</p>\n <p>«&nbsp;Nous sommes censés être le miroir des experts métier que nous rencontrons chez nos clients&nbsp;», note Brice Faure. Cela implique par ailleurs le recrutement de consultants dans l’entité service de l’éditeur.</p>\n <p>Or, ces spécialistes sont aussi difficiles à dénicher des deux côtés de la barrière. Ils sont néanmoins nécessaires pour que Celonis prouve sa valeur.</p>\n <p>À ce titre, le dirigeant français, dont c’était le premier Celosphere, a apprécié les «&nbsp;no bullshit talks&nbsp;»&nbsp;de ses clients. «&nbsp;Ils sont dans l’action&nbsp;», constate-t-il. Peu des grands groupes français souhaitaient communiquer avec la presse. Mais, lors du salon se déroulant à Munich, ils ont affiché des résultats et des objectifs conséquents dans le cadre de leur adoption de la plateforme de process mining. Tout en évoquant les défis qu’ils ont rencontrés lors de l’implémentation de la technologie.</p>\n</section>           \n<section class=\"section main-article-chapter\" data-menu-title=\"Les enjeux croisés de Celonis et de ses clients\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Les enjeux croisés de Celonis et de ses clients</h2>\n <p>Celonis a largement bâti sa communication sur les économies réalisées par ses clients. Elles se chiffrent en millions, en dizaine, voire en centaine de millions d’euros/dollars. Des résultats certes impressionnants, mais qui masquent certains aspects de son modèle.</p>\n <p>D’abord, les clients remarquent que le premier projet est généralement plus long à mettre en place. Il faut s’acclimater à la technologie de Celonis et la déployer.</p>\n <p>Depuis deux ans, l’éditeur passe de la modélisation des processus par cas («&nbsp;case centric&nbsp;») à une autre par objet (Object Centric Process Mining, OCPM). Cette deuxième approche doit permettre de capturer les relations entre les composants d’un processus et les intersections entre deux processus ou plus. Or, sur les 300&nbsp;clients ayant adopté ce modèle de données (sur 1400 au total), 30 l’ont déployé sur plus de cinq processus.</p>\n <p>En France, les porte-parole de Celonis rencontrés par LeMagIT assurent que la majorité des clients, sinon tous, ont adopté OCPM. Dans son Magic Quadrant publié le 15&nbsp;avril 2025, Gartner notait que cela accélère les déploiements, mais réclame une plus grande maturité pour bâtir les bonnes analyses, «&nbsp;à cause de l’abondance d’objets et de processus interconnectés&nbsp;».</p>\n <p>Aux enjeux de déploiement s’ajoutent des défis contractuels. Pour rappel, Celonis a porté plainte contre SAP aux États-Unis pour pratiques anticoncurrentielles. <a href=\"https://www.lemagit.fr/actualites/366626841/Donnees-ERP-SAP-autorise-lacces-a-Celonis-jusquau-verdict\">Dans l’attente du verdict, SAP autorise son concurrent</a> (et ex-partenaires), à ingérer les données de son système ERP. Mais Celonis n’est toujours pas un partenaire certifié de SAP, ce qui rebute certains prospects. Pour mémoire, SAP propose une solution concurrente&nbsp;: Signavio.</p>\n <p>Brice Faure imagine que le partenariat entre Celonis et Databricks (puis, plus tard Snowflake), annoncé lors de Celosphere, représente une alternative. Databricks entretient lui-même un partenariat avec SAP.</p>\n <p>Par ailleurs, il convient de «&nbsp;négocier&nbsp;» avec les métiers (dixit les représentants de Socar Turquie, une branche de la compagnie pétrolière et gazière nationale d’Azerbaïdjan) pour le bon usage de la plateforme et appliquer les premières mesures correctives.</p>\n <p>Ces premières corrections sont présentées par le porte-parole d’un grand industriel français comme les «&nbsp;dolipranes&nbsp;» du processus. Elles soignent les symptômes. Reste à trouver le traitement pour le guérir.</p>\n</section>         \n<section class=\"section main-article-chapter\" data-menu-title=\"Stabiliser le modèle économique\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Stabiliser le modèle économique</h2>\n <p>Ensuite, Celonis a vanté, pendant quelques années, un modèle économique basée sur un pourcentage des économies obtenus. Il en revient. Depuis deux ans, il se concentre sur une tarification fonction du nombre de processus et d’une échelle de déploiement (un pays, une région, plusieurs, etc.).</p>\n <p>« Le réflexe de mes commerciaux, c’est de promettre une génération de valeur permettant d’autofinancer l’usage de la plateforme », résume Brice Faure. « Savez-vous combien d’éditeurs de logiciels font ça ? Moi, je n’en connais pas d’autres. Mais nous nous enfermons dans ce discours ».&nbsp;</p>\n <p>La génération de valeur n’est pas forcément financière, justifie-t-il. Comment quantifier les gains d’efficience des métiers, la meilleure connaissance des processus de l’entreprise. «&nbsp;Dans certains cas, ça ne se mesure pas, ou peu&nbsp;».</p>\n <p>De plus, certains clients refusent de partager avec l’éditeur les gains obtenus.</p>\n <p>La promesse de retour sur investissement peut engendrer des frictions au moment de poser le périmètre d’un projet. Certains prospects avancés ont pu découvrir des anomalies importantes dans les processus cibles. Anomalies qu’ils ont préféré régler en interne plutôt que de payer une solution. Ou maintenir le statu quo si cela réclame un changement organisationnel, inenvisageable à&nbsp;l’instant T. «&nbsp;Notre travail consiste à déterminer au plus tôt les organisations compatibles avec notre approche&nbsp;», résume Brice Faure. &nbsp;</p>\n <p>Toutefois, ce choix d’un modèle économique plus prédictible n’était pas forcément limpide pour les clients en début d’année&nbsp;2025. «&nbsp;En particulier, les utilisateurs expriment des difficultés liées à l’évolution des paramètres de tarification, aux coûts basés sur les processus, aux mécanismes d’échelonnement peu clairs et au nombre élevé de SKU complémentaires&nbsp;», note Gartner dans son Magic Quadrant.</p>\n <p>Celonis demeure le leader de sa catégorie, devant Signavio, ARIS, <a href=\"https://www.lemagit.fr/actualites/366632645/IA-agentique-Salesforce-veut-mettre-Slack-au-centre-de-son-dispositif\">Apromore (Salesforce),</a> IBM, UiPah, Pegasystems et Mehrwerk.</p>\n</section>",
      "published_ts": 1762785480,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.lemagit.fr/actualites/366634321/Remplacer-les-juniors-par-lIA-pas-une-bonne-idee",
      "title": "Remplacer les juniors par l’IA, pas une bonne idée",
      "summary": "<p>Pour le cabinet de conseil international en organisation Korn Ferry, c’est un fait avéré. L’IA prend de plus en plus la place des débutants sur les postes juniors. Problème&nbsp;: en fermant cette porte d’entrée dans l’entreprise, l’IA tarirait aussi une source essentielle au recrutement et au développement des futurs dirigeants.</p> \n<p>Selon <a href=\"https://www.kornferry.com/about-us/press/korn-ferry-research-unveils-top-talent-acquisition-trends-shaping-2026\">un rapport</a> Korn Ferry publié fin octobre, environ 4&nbsp;entreprises sur 10 prévoiraient de remplacer des postes débutant par une IA (37&nbsp;% exactement).</p> \n<p>Une autre étude, du cabinet LHH (groupe Adecco) celle-ci, et menée auprès de 2 000&nbsp;dirigeants dans 13&nbsp;pays, <a href=\"https://www.lesechos.fr/travailler-mieux/metiers-reconversion-professionnelle/la-moitie-des-entreprises-disent-avoir-deja-reduit-leurs-effectifs-a-cause-de-lia-2191307\">confirme</a>. 46&nbsp;% des entreprises auraient déjà réduit leurs effectifs à cause (ou avec) l’IA.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Yale et Hellowork relativisent\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Yale et Hellowork relativisent</h2>\n <p>Et 54&nbsp;% prévoiraient d’employer moins dans les cinq prochaines années.</p>\n <p>La société française de recrutement Hellowork nuance cependant ce constat. Elle rappelle qu’une étude de Yale (<a href=\"https://budgetlab.yale.edu/\">The Budget Lab</a>) ne verrait pas de choc visible sur l’emploi global. Pour l’instant, en tout cas.</p>\n <p>D’après la prestigieuse université américaine, les métiers évolueraient plus vite, certes, mais la tendance aurait commencé avant <a href=\"https://www.lemagit.fr/ezine/Applications-Donnees/Applications-et-donnees-19-ChatGPT-super-ambassadeur-de-lIA\">l’essor de l’IA générative fin&nbsp;2022</a>.</p>\n <p>L’impact de l’IA pourrait ainsi prendre des années à se matérialiser.</p>\n</section>     \n<section class=\"section main-article-chapter\" data-menu-title=\"Un danger pour l’avenir des talents\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Un danger pour l’avenir des talents</h2>\n <p>Quoi qu’il en soit, lorsque Korn Ferry a interrogé plus de 1 670&nbsp;responsables, le cabinet a confirmé que la réduction des recrutements juniors pourrait générer des économies pour les entreprises sur 2026 et sur 2027. Mais il avertit aussi que réduire ce vivier de futurs dirigeants pourrait bien aboutir à une crise de leadership à plus long terme.</p>\n <p>«&nbsp;À mesure que l’IA se déploie – et <a href=\"https://www.lemagit.fr/actualites/366629373/Enterprise-Asset-Management-IFS-inscrit-ses-agents-IA-dans-son-organigramme\">qu’elle devient un vrai collègue, et plus un simple outil</a> – les dirigeants doivent mesurer avec précaution l’équilibre entre l’innovation et le développement de la prochaine génération de leaders&nbsp;», <a href=\"https://www.kornferry.com/about-us/press/korn-ferry-research-unveils-top-talent-acquisition-trends-shaping-2026\">insiste</a> Jeanne MacDonald, CEO, Recruitment Process Outsourcing chez Korn Ferry.</p>\n <p>Pour relever ce défi et s’assurer que la mise en œuvre de l’IA est bien alignée sur les ambitions à long terme de l’entreprise, l’une des priorités serait que la direction générale communique sa vision à l’ensemble du personnel, quitte à se faire aider par les responsables RH de l’acquisition de talents, conseille Korn Ferry.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"L’esprit critique toujours aussi critique\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>L’esprit critique toujours aussi critique</h2>\n <p>Son rapport confirme un autre point. Il y a certes une «&nbsp;hype IA&nbsp;», mais 73&nbsp;% des recruteurs cherchent toujours à évaluer en priorité l’esprit critique des candidats.</p>\n <p>Les entreprises recherchent des personnes capables d’évaluer les recommandations de l’IA, d’analyser ses résultats, de repérer les erreurs, voire de savoir quand il faut passer outre ses conclusions, liste le rapport.</p>\n <p>Lors de son Symposium, <a href=\"https://www.lemagit.fr/actualites/366633467/Gartner-prevoit-un-retour-en-force-de-lesprit-critique-face-a-lIA-generative\">Gartner était arrivé exactement à la même conclusion</a>.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"Former à l’IA ou laisser former à l’IA ?\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Former à l’IA ou laisser former à l’IA&nbsp;?</h2>\n <p>Sur ce sujet, <a href=\"https://www.hrdive.com/news/entry-level-workers-are-unprepared-for-their-jobs-amid-ai-blitz-survey-say/761239/\">un autre rapport</a>, de l’entreprise spécialisée dans la formation General Assembly (également du groupe Adecco), estime que les jeunes employés seraient très mal préparés à la montée en puissance de l’IA.</p>\n <p>Les entreprises – du moins aux États-Unis et au Royaume-Uni – estimeraient de leur que se <a href=\"https://www.lemagit.fr/conseil/Former-les-salaries-a-lIA-les-douze-etapes-cles\">former à l’IA</a> relèverait de la responsabilité des employés. Il n’est <a href=\"https://www.lemagit.fr/actualites/366618024/Lacculturation-le-talon-dAchille-des-strategies-IA-en-entreprise-etude\">pas certain que la situation soit très différente en France</a>.</p>\n <p>Mais General Assembly prévient&nbsp;: si l’IA affecte de plus en plus le vivier de talents, c’est aux employeurs qu’il revient d’investir dans la formation des prochaines générations. Sans quoi, les entreprises seront bientôt confrontées à une pénurie critique de compétences.</p>\n <p><i>Avec nos collègues de <a href=\"https://www.hrdive.com/news/entry-level-workers-are-unprepared-for-their-jobs-amid-ai-blitz-survey-say/761239/\">HR Dive</a> (groupe Informa Techtarget dont fait partie LeMagIT)</i></p>\n</section>",
      "published_ts": 1762777620,
      "source_name": "LeMagIT"
    },
    {
      "url": "https://www.zdnet.fr/actualites/zdnet-morning-10-11-2025-bulle-de-lia-dans-le-labo-des-tv-samsung-la-chine-superpuissance-de-lia-484707.htm#xtor=RSS-1",
      "title": "ZDNET Morning 10/11/2025 : Bulle de l'IA, Dans le labo des TV Samsung, La Chine superpuissance de l'IA,...",
      "summary": "Le ZDNET Morning le brief de l'actu tech pour les pros tous les matins à 9h00. Transformation numérique, IA, matériel, logiciels,... ne passez pas à côté de ce qui fait la Une du secteur.",
      "published_ts": 1762769494,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/guide-achat/test-xtar-vx2-pro-ce-testeur-de-batteries-est-un-produit-de-reve-484680.htm#xtor=RSS-1",
      "title": "Test Xtar VX2 Pro : ce testeur de batteries est un produit de rêve",
      "summary": "Cet appareil n’est pas seulement un chargeur, il diagnostique et prépare les piles rechargeables pour un stockage à long terme.",
      "published_ts": 1762765896,
      "source_name": "ZDNet France"
    },
    {
      "url": "https://www.zdnet.fr/actualites/un-nouveau-modele-dia-chinois-gratuit-pretend-surpasser-gpt-5-et-sonnet-4-5-484684.htm#xtor=RSS-1",
      "title": "Un nouveau modèle d'IA chinois gratuit prétend surpasser GPT-5 et Sonnet 4.5",
      "summary": "La course en matière d'IA entre les États-Unis et la Chine vient de s'intensifier, une fois de plus.",
      "published_ts": 1762762295,
      "source_name": "ZDNet France"
    }
  ],
  "python_polars_duckdb": [
    {
      "url": "https://blog.cloudflare.com/python-workflows/",
      "title": "A closer look at Python Workflows, now in beta",
      "summary": "Cloudflare Workflows, our durable execution engine for running multi-step applications, now supports Python. That means less friction, more possibilities, and another reason to build on Cloudflare.",
      "published_ts": 1762783200,
      "source_name": "Cloudflare Engineering Blog"
    }
  ],
  "viz_bi": [
    {
      "url": "https://www.numerama.com/tech/2118019-les-excellents-ecouteurs-1000xm5-de-sony-sont-a-un-prix-rarement-vu-pour-le-single-day.html",
      "title": "Les excellents écouteurs 1000XM5 de Sony sont à un prix rarement vu pour le Single Day",
      "summary": "[Deal du jour] Dotés d’un grand confort, d’une excellente qualité audio et d'une réduction active de bruit efficace, les 1000XM5 sont de très bons écouteurs haut de gamme signés Sony, encore plus intéressants en promotion pour le Single Day.",
      "published_ts": 1763218800,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.journaldunet.com/cloud/1545979-comparatif-des-plateformes-de-data-analytics-power-bi-s-impose/",
      "title": "Comparatif des plateformes de data analytics : Power BI s'impose",
      "summary": "Compte tenu de sa richesse fonctionnelle et de son intégration à Microsoft 365, la solution de l'éditeur de Redmond se démarque comme l'outil à l'état de l'art face à Looker, Qlik, SAP ou Tableau.",
      "published_ts": 1762971426,
      "source_name": "Journal du Net"
    },
    {
      "url": "https://www.numerama.com/vroom/2115057-on-a-trouve-8-excellents-velos-electriques-a-prix-hallucinant-dans-le-bike-friday-dupway.html",
      "title": "On a trouvé 8 excellents vélos électriques à prix hallucinant dans le « Bike Friday » d’Upway",
      "summary": "On a exploré tout le rayon vélo du Bike Friday d'Upway pour vous dénicher ces pépites. Foncez, il n'y a qu'un exemplaire par modèle.",
      "published_ts": 1762873646,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/1841152-cette-excellente-console-portable-retrogaming-est-a-35-pour-le-single-day.html",
      "title": "Cette excellente console portable rétrogaming est à 35 € pour le Single Day",
      "summary": "Pour le Single Day, AliExpress fait baisser le prix de la Miyoo Mini+ 35 € avec un code promo qui enlève 5 € dès 29 € d'achat. Une occasion à ne pas manquer.",
      "published_ts": 1762849092,
      "source_name": "Numerama"
    },
    {
      "url": "https://www.numerama.com/tech/2114679-liphone-air-2-repousse-indefiniment-un-echec-pour-le-smartphone-coince-entre-les-excellents-iphone-17-et-17-pro.html",
      "title": "L’iPhone Air 2 « repoussé indéfiniment » : un échec pour le smartphone coincé entre les excellents iPhone 17 et 17 Pro ?",
      "summary": "L'iPhone Air, un one shot ? Le smartphone le plus fin jamais conçu par Apple n'aurait pas séduit autant que Cupertino l'espérait. Même s'il a de nombreuses qualités, son absence de polyvalence au niveau photo, sa batterie limitée et son prix très élevé n'en faisaient pas un excellent client pour un achat en 2025 d'après nos tests.",
      "published_ts": 1762847759,
      "source_name": "Numerama"
    }
  ]
}