{
  "ai_data_engineering": [
    {
      "url": "https://huggingface.co/blog/rapidfireai",
      "title": "20x Faster TRL Fine-tuning with RapidFire AI",
      "summary": "20x Faster TRL Fine-tuning with RapidFire AI\nHugging Face TRL now officially integrates with RapidFire AI to accelerate your fine-tuning and post-training experiments. TRL users can now discover, install, and run RapidFire AI as the fastest way to compare multiple fine-tuning/post-training configura",
      "published_ts": 1763683200,
      "source_name": "Hugging Face Blog"
    },
    {
      "url": "https://blog.langchain.com/customers-jimdo/",
      "title": "How Jimdo empower solopreneurs with AI-powered business assistance",
      "summary": "See how Jimdo uses LangChain.js, LangGraph.js, and LangSmith to deliver personalized business insights that drive 50% more first customer contacts and 40% more overall customer activity.",
      "published_ts": 1763603251,
      "source_name": "LangChain Blog"
    },
    {
      "url": "https://huggingface.co/blog/anylanguagemodel",
      "title": "Introducing AnyLanguageModel: One API for Local and Remote LLMs on Apple Platforms",
      "summary": "Introducing AnyLanguageModel: One API for Local and Remote LLMs on Apple Platforms\nLLMs have become essential tools for building software.\nBut for Apple developers, integrating them remains unnecessarily painful.\nDevelopers building AI-powered apps typically take a hybrid approach,\nadopting some com",
      "published_ts": 1763596800,
      "source_name": "Hugging Face Blog"
    },
    {
      "url": "https://www.dataengineeringweekly.com/p/the-dark-data-tax-how-hoarding-is",
      "title": "The Dark Data Tax: How Hoarding is Poisoning Your AI",
      "summary": "Storage is cheap. Attention is finite. Hallucinations are expensive. It’s time to stop building Data Lakes and start managing Data Metabolism",
      "published_ts": 1763533994,
      "source_name": "Data Engineering Weekly"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/accelerate-large-scale-ai-applications-with-the-new-amazon-ec2-p6-b300-instances/",
      "title": "Accelerate large-scale AI applications with the new Amazon EC2 P6-B300 instances",
      "summary": "Amazon announces the general availability of EC2 P6-B300 instances, powered by NVIDIA Blackwell Ultra GPUs, which deliver 2x networking bandwidth and 1.5x GPU memory than previous generations, making them well suited for training and serving large-scale AI models with trillion parameters across distributed GPU clusters",
      "published_ts": 1763504176,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://www.databricks.com/blog/announcing-public-preview-distributed-ml-serverless-and-standard-clusters",
      "title": "Announcing the Public Preview of Distributed ML on Serverless and Standard Clusters",
      "summary": "The Public Preview of Apache Spark MLlib (Python) and Optuna on serverless notebooks and jobs...",
      "published_ts": 1763495400,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://vutr.substack.com/p/i-spent-the-weekend-learning-about",
      "title": "I spent the weekend learning about one of the most iconic database storage engines.",
      "summary": "The one once common in the OLTP world, now gaining more and more adoption in OLAP systems.",
      "published_ts": 1763435730,
      "source_name": "VuTrinh · Data Engineering"
    },
    {
      "url": "https://blog.langchain.com/customers-servicenow/",
      "title": "How ServiceNow uses LangSmith to get visibility into its customer success agents",
      "summary": "Authors: Ganesh Srinivasan (ServiceNow), Linda Ye (LangChain), and Jake Broekhuizen (LangChain) ServiceNow is a leading digital workflow platform that helps enterprises transform service management across IT, customer service, and other departments. To improve their internal sales and customer success operations, ServiceNow's AI team is using LangSmith and LangGraph",
      "published_ts": 1763419370,
      "source_name": "LangChain Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-lambda-load-balancers-amazon-dcv-amazon-linux-2023-and-more-november-17-2025/",
      "title": "AWS Weekly Roundup: AWS Lambda for Rust, NLB for QUIC protocol, Amazon DCV for Mac, and more (November 17, 2025)",
      "summary": "The weeks before AWS re:Invent, my team is full steam ahead preparing content for the conference. I can’t wait to meet you at one of my three talks: CMP346 : Supercharge AI/ML on Apple Silicon with EC2 Mac, CMP344: Speed up Apple application builds with CI/CD on EC2 Mac, and DEV416: Develop your AI Agents […]",
      "published_ts": 1763402348,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://blog.octo.com/la-duck-conf--decouvrez-les-premier-speakers-!",
      "title": "La Duck Conf : Découvrez les premiers speakers !",
      "summary": "Découvrez les premiers speakers de la 9ᵉ édition de la Duck Conf, votre rendez-vous incontournable sur l'architecture numérique, qui se tiendra le mardi 24 mars 2026 au Pavillon Chesnaie du Roy.",
      "published_ts": 1763389990,
      "source_name": "OCTO Talks!"
    },
    {
      "url": "http://www.dataiku.com/stories/blog/frontrunner-awards-2025-celebrating-agentic-ai-excellence",
      "title": "Dataiku Frontrunner Awards 2025: Celebrating Agentic AI Excellence",
      "summary": "The world of data and AI is transforming at a breakneck pace, and 2025 marked a definitive shift from predictive insights to autonomous action with AI agents . Organizations are now masterfully combining human expertise with AI systems that can act, make decisions, and deliver tangible business impact.",
      "published_ts": 1763387100,
      "source_name": "Dataiku Blog"
    },
    {
      "url": "https://huggingface.co/blog/build-rocm-kernels",
      "title": "Easily Build and Share ROCm Kernels with Hugging Face",
      "summary": "Easily Build and Share ROCm Kernels with Hugging Face\nIntoduction\nCustom kernels are the backbone of high-performance deep learning, enabling GPU operations tailored precisely to your workload; whether that’s image processing, tensor transformations, or other compute-heavy tasks. But compiling these",
      "published_ts": 1763337600,
      "source_name": "Hugging Face Blog"
    }
  ],
  "cloud": [],
  "cloud_infra_observability": [
    {
      "url": "https://aws.amazon.com/blogs/aws/new-one-click-onboarding-and-notebooks-with-ai-agent-in-amazon-sagemaker-unified-studio/",
      "title": "New one-click onboarding and notebooks with a built-in AI agent in Amazon SageMaker Unified Studio",
      "summary": "Amazon SageMaker Unified Studio introduces new one-click onboarding experiences and serverless notebooks with a built-in AI agent without any manual set up or provisioning of your domain or compute resources. You can launch SageMaker Unified Studio directly from Amazon SageMaker, Amazon Athena, Amazon Redshift, and Amazon S3 Tables console pages, giving a fast path to analytics and AI workloads.",
      "published_ts": 1763774592,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/build-production-ready-applications-without-infrastructure-complexity-using-amazon-ecs-express-mode/",
      "title": "Build production-ready applications without infrastructure complexity using Amazon ECS Express Mode",
      "summary": "Amazon ECS Express Mode simplifies containerized application deployment by automating infrastructure setup through a single command, allowing developers to focus on building applications while following AWS best practices.",
      "published_ts": 1763760885,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/introducing-cluster-insights-unified-monitoring-dashboard-for-amazon-opensearch-service-clusters/",
      "title": "Introducing Cluster insights: Unified monitoring dashboard for Amazon OpenSearch Service clusters",
      "summary": "This blog will guide you through setting up and using Cluster Insights, including key features and metrics. By the conclusion, you'll understand how to use Cluster insights to recognize and address performance and resiliency issues within your OpenSearch Service clusters.",
      "published_ts": 1763743136,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-vpc-encryption-controls-enforce-encryption-in-transit-within-and-across-vpcs-in-a-region/",
      "title": "Introducing VPC encryption controls: Enforce encryption in transit within and across VPCs in a Region",
      "summary": "AWS announces VPC encryption controls, a new capability that helps organizations audit and enforce encryption in transit for all traffic within and across VPCs in a Region, simplifying compliance with regulatory frameworks like HIPAA, PCI DSS, and FedRAMP through automated monitoring and enforcement modes.",
      "published_ts": 1763742230,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://www.databricks.com/blog/databricks-and-aws-partner-simplify-infrastructure-setup",
      "title": "Databricks and AWS Partner to Simplify Infrastructure Setup",
      "summary": "Today, we’re announcing that automated configuration for classic workspace deployment...",
      "published_ts": 1763683200,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/getting-started-with-amazon-s3-tables-in-amazon-sagemaker-unified-studio/",
      "title": "Getting started with Amazon S3 Tables in Amazon SageMaker Unified Studio",
      "summary": "In this post, you learn how to integrate SageMaker Unified Studio with S3 Tables and query your data using Amazon Athena, Amazon Redshift, or Apache Spark in EMR and AWS Glue.",
      "published_ts": 1763594817,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/simplify-access-to-external-services-using-aws-iam-outbound-identity-federation/",
      "title": "Simplify access to external services using AWS IAM Outbound Identity Federation",
      "summary": "AWS IAM now enables outbound identity federation, allowing developers to securely authenticate AWS workloads with external services using short-lived JSON Web Tokens instead of storing long-term credentials like API keys and passwords.",
      "published_ts": 1763594484,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/accelerate-workflow-development-with-enhanced-local-testing-in-aws-step-functions/",
      "title": "Accelerate workflow development with enhanced local testing in AWS Step Functions",
      "summary": "AWS Step Functions' enhanced TestState API now enables local unit testing with mocking support, comprehensive state type validation, and individual state testing capabilities without requiring AWS deployment or IAM permissions.",
      "published_ts": 1763590397,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/streamlined-multi-tenant-application-development-with-tenant-isolation-mode-in-aws-lambda/",
      "title": "Streamlined multi-tenant application development with tenant isolation mode in AWS Lambda",
      "summary": "AWS Lambda introduces tenant isolation mode, enabling separate execution environments for each tenant within a single function to meet strict security requirements without managing dedicated per-tenant infrastructure.",
      "published_ts": 1763579547,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-control-tower-introduces-a-controls-dedicated-experience/",
      "title": "AWS Control Tower introduces a Controls Dedicated experience",
      "summary": "AWS Control Tower now offers Control Only Experience, enabling faster governance setup for established multi-account environments by providing access to AWS managed controls without requiring a full landing zone implementation.",
      "published_ts": 1763579266,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/new-aws-billing-transfer-for-centrally-managing-aws-billing-and-costs-across-multiple-organizations/",
      "title": "New: AWS Billing Transfer for centrally managing AWS billing and costs across multiple organizations",
      "summary": "AWS Billing Transfer enables customers to centrally manage and pay bills across multiple AWS organizations by allowing billing administrators to transfer payment responsibility while maintaining individual security and governance autonomy over their accounts.",
      "published_ts": 1763579208,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/monitor-network-performance-and-traffic-across-your-eks-clusters-with-container-network-observability/",
      "title": "Monitor network performance and traffic across your EKS clusters with Container Network Observability",
      "summary": "Amazon EKS introduces Container Network Observability, providing enhanced visibility into Kubernetes workload traffic and performance insights to help teams monitor and troubleshoot microservice environments.",
      "published_ts": 1763579159,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://www.databricks.com/blog/databricks-partners-microsoft-bring-our-data-intelligence-platform-azure-government",
      "title": "Databricks Partners with Microsoft to bring our Data Intelligence Platform to Azure Government",
      "summary": "The US Government isn't just a customer—it's a strategic partner in our mission to democratize data and AI. ...",
      "published_ts": 1763568000,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/new-amazon-bedrock-service-tiers-help-you-match-ai-workload-performance-with-cost/",
      "title": "New Amazon Bedrock service tiers help you match AI workload performance with cost",
      "summary": "Amazon Bedrock introduces three service tiers—Priority, Standard, and Flex—allowing you to optimize AI workload costs by matching performance requirements with pricing for different application needs.",
      "published_ts": 1763504986,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/microsoft-foundry-scale-innovation-on-a-modular-interoperable-and-secure-agent-stack/",
      "title": "Microsoft Foundry: Scale innovation on a modular, interoperable, and secure agent stack",
      "summary": "Agents are reshaping software. No longer mere assistants, they are becoming dynamic collaborators layered within our everyday tools. The post Microsoft Foundry: Scale innovation on a modular, interoperable, and secure agent stack appeared first on Microsoft Azure Blog .",
      "published_ts": 1763481600,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/microsoft-databases-and-microsoft-fabric-your-unified-and-ai-powered-data-estate/",
      "title": "Microsoft Databases and Microsoft Fabric: Your unified and AI-powered data estate",
      "summary": "Today, I’m thrilled to announce the next generation of Microsoft’s databases: SQL Server 2025, Azure Document DB, Azure Horizon DB, and Fabric Databases, each redesigned to meet the demands of AI. The post Microsoft Databases and Microsoft Fabric: Your unified and AI-powered data estate appeared first on Microsoft Azure Blog .",
      "published_ts": 1763481600,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/announcing-azure-copilot-agents-and-ai-infrastructure-innovations/",
      "title": "Announcing Azure Copilot agents and AI infrastructure innovations",
      "summary": "Learn about the new AI features and products In Azure announced at Microsoft Ignite 2025 to help modernize your cloud infrastructure. The post Announcing Azure Copilot agents and AI infrastructure innovations appeared first on Microsoft Azure Blog .",
      "published_ts": 1763481600,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/introducing-anthropics-claude-models-in-microsoft-foundry-bringing-frontier-intelligence-to-azure/",
      "title": "Introducing Anthropic’s Claude models in Microsoft Foundry: Bringing Frontier intelligence to Azure",
      "summary": "Microsoft Foundry already offers the widest selection of models of any cloud and with today’s partnership announcement with Anthropic, we’re proud that Azure is now the only cloud providing access to both Claude and GPT frontier models to customers on one platform. The post Introducing Anthropic’s Claude models in Microsoft Foundry: Bringing Frontier intelligence to Azure appeared first on Microsoft Azure Blog .",
      "published_ts": 1763478028,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/introducing-amazon-mwaa-serverless/",
      "title": "Introducing Amazon MWAA Serverless",
      "summary": "Today, AWS announced Amazon Managed Workflows for Apache Airflow (MWAA) Serverless. This is a new deployment option for MWAA that eliminates the operational overhead of managing Apache Airflow environments while optimizing costs through serverless scaling. In this post, we demonstrate how to use MWAA Serverless to build and deploy scalable workflow automation solutions.",
      "published_ts": 1763418166,
      "source_name": "Redshift / AWS Big Data"
    }
  ],
  "data_modeling_governance": [
    {
      "url": "https://aws.amazon.com/blogs/big-data/enforce-business-glossary-classification-rules-in-amazon-sagemaker-catalog/",
      "title": "Enforce business glossary classification rules in Amazon SageMaker Catalog",
      "summary": "Amazon SageMaker Catalog now supports metadata enforcement rules for glossary terms classification (tagging) at the asset level. With this capability, administrators can require that assets include specific business terms or classifications. Data producers must apply required glossary terms or classifications before an asset can be published. In this post, we show how to enforce business glossary classification rules in SageMaker Catalog.",
      "published_ts": 1763663981,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/enhanced-data-discovery-in-amazon-sagemaker-catalog-with-custom-metadata-forms-and-rich-text-documentation/",
      "title": "Enhanced data discovery in Amazon SageMaker Catalog with custom metadata forms and rich text documentation",
      "summary": "Amazon SageMaker Catalog now supports custom metadata forms and rich text descriptions at the column level, extending existing curation capabilities for business names, descriptions, and glossary term classifications. Column-level context is essential for understanding and trusting data. This release helps organizations improve data discoverability, collaboration, and governance by letting metadata stewards document columns using structured and formatted information that aligns with internal standards. In this post, we show how to enhance data discovery in SageMaker Catalog with custom metadata forms and rich text documentation at the schema level.",
      "published_ts": 1763663707,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/new-business-metadata-features-in-amazon-sagemaker-catalog-to-improve-discoverability-across-organizations/",
      "title": "New business metadata features in Amazon SageMaker Catalog to improve discoverability across organizations",
      "summary": "Amazon SageMaker Catalog now offers column-level metadata forms and enforced glossary requirements, enabling organizations to improve data classification, discoverability, and governance through standardized business metadata.",
      "published_ts": 1763579367,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://www.databricks.com/blog/expanding-support-onelake-unity-catalog",
      "title": "Expanding support for OneLake in Unity Catalog",
      "summary": "Today marks an important milestone for open standards and the broader data community...",
      "published_ts": 1763514000,
      "source_name": "Databricks Blog"
    }
  ],
  "dataprep_orchestration_etl": [],
  "db_sql_olap": [],
  "etl_orchestration": [
    {
      "url": "https://dagster.io/blog/when-and-when-not-to-optimize-data-pipelines",
      "title": "Stop Optimizing the Wrong Things: A Data Pipeline Performance Guide",
      "summary": "Most data pipeline performance problems aren't Python problems—they're I/O, queries, and architecture issues. Learn a profiling-first framework to optimize what actually matters and avoid wasting time on premature optimization.",
      "published_ts": 1763392944,
      "source_name": "Dagster Blog"
    }
  ],
  "hors_sujet": [],
  "lake_storage_formats": [
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-attribute-based-access-control-for-amazon-s3-general-purpose-buckets/",
      "title": "Introducing attribute-based access control for Amazon S3 general purpose buckets",
      "summary": "AWS introduces Attribute-Based Access Control (ABAC) for S3 general purpose buckets, enabling administrators to automatically manage permissions through tag-based policies that match tags between users, roles, and buckets—eliminating the need to constantly update IAM policies as organizations scale.",
      "published_ts": 1763686955,
      "source_name": "AWS Blog"
    }
  ],
  "ml_ai": [],
  "news": [
    {
      "url": "https://www.databricks.com/blog/bring-data-intelligence-microsoft-ecosystem-agent-bricks-agent-365",
      "title": "Bring Data Intelligence to the Microsoft Ecosystem with Agent Bricks + Agent 365",
      "summary": "A New Kind of CoworkerAcross industries, employees spend hours searching for insights...",
      "published_ts": 1763496000,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://azure.microsoft.com/en-us/blog/azure-at-microsoft-ignite-2025-all-the-intelligent-cloud-news-explained/",
      "title": "Azure at Microsoft Ignite 2025: All the intelligent cloud news explained",
      "summary": "This week at Microsoft Ignite 2025, Azure introduces solutions that address your technology strategy questions with innovations designed for this very inflection point. The post Azure at Microsoft Ignite 2025: All the intelligent cloud news explained appeared first on Microsoft Azure Blog .",
      "published_ts": 1763481600,
      "source_name": "Azure Blog"
    },
    {
      "url": "https://blog.cloudflare.com/18-november-2025-outage/",
      "title": "Cloudflare outage on November 18, 2025",
      "summary": "Cloudflare suffered a service outage on November 18, 2025. The outage was triggered by a bug in generation logic for a Bot Management feature file causing many Cloudflare services to be affected.",
      "published_ts": 1763424000,
      "source_name": "Cloudflare Engineering"
    },
    {
      "url": "https://seattledataguy.substack.com/p/what-it-really-takes-to-move-from",
      "title": "What It Really Takes to Move From Senior to Staff Data Engineer",
      "summary": "An Interview With A Staff Level Data Engineer At Apple",
      "published_ts": 1763410484,
      "source_name": "Seattle Data Guy"
    },
    {
      "url": "https://blog.cloudflare.com/replicate-joins-cloudflare/",
      "title": "Replicate is joining Cloudflare",
      "summary": "Bringing Replicate’s tools into Cloudflare will continue to make our Workers Platform the best place on the Internet to build and deploy any AI or agentic workflow.",
      "published_ts": 1763388000,
      "source_name": "Cloudflare Engineering"
    },
    {
      "url": "https://www.dataengineeringweekly.com/p/data-engineering-weekly-246",
      "title": "Data Engineering Weekly #246",
      "summary": "The Weekly Data Engineering Newsletter",
      "published_ts": 1763362967,
      "source_name": "Data Engineering Weekly"
    }
  ],
  "news_general": [],
  "python_analytics": [],
  "python_polars_duckdb": [],
  "viz_bi": [],
  "warehouses_engines": [
    {
      "url": "https://www.databricks.com/blog/databricks-named-leader-2025-gartner-magic-quadrant-cloud-database-management-systems",
      "title": "Databricks Named a Leader in 2025 Gartner® Magic Quadrant™ for Cloud Database Management Systems",
      "summary": "Databricks has been named a Leader in the 2025 Gartner Magic Quadrant for Cloud Database...",
      "published_ts": 1763740800,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://www.databricks.com/blog/redefining-data-warehouse-ai-era-azure-databricks",
      "title": "Redefining the Data Warehouse for the AI Era with Azure Databricks",
      "summary": "Traditional data warehouses were built for predictable, structured workloads. Today’s...",
      "published_ts": 1763712600,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://www.databricks.com/blog/how-build-production-ready-data-and-ai-apps-databricks-apps-and-lakebase",
      "title": "How to Build Production-Ready Data and AI Apps with Databricks Apps and Lakebase",
      "summary": "The Challenge of Production Data ApplicationsBuilding production-ready data applications is complex...",
      "published_ts": 1763582625,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://www.databricks.com/blog/new-way-build-pipelines-databricks-introducing-ide-data-engineering",
      "title": "The New Way to Build Pipelines on Databricks: Introducing the IDE for Data Engineering",
      "summary": "At this year’s Data + AI Summit, we introduced the IDE for Data Engineering: a new...",
      "published_ts": 1763582400,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/cross-account-lakehouse-governance-with-amazon-s3-tables-and-sagemaker-catalog/",
      "title": "Cross-account lakehouse governance with Amazon S3 Tables and SageMaker Catalog",
      "summary": "In this post, we walk you through a practical solution for secure, efficient cross-account data sharing and analysis. You’ll learn how to set up cross-account access to S3 Tables using federated catalogs in Amazon SageMaker, perform unified queries across accounts with Amazon Athena in Amazon SageMaker Unified Studio, and implement fine-grained access controls at the column level using AWS Lake Formation.",
      "published_ts": 1763506863,
      "source_name": "Redshift / AWS Big Data"
    },
    {
      "url": "https://www.databricks.com/blog/launching-gemini-3-pro-databricks",
      "title": "Launching Gemini 3 Pro on Databricks",
      "summary": "Starting today, you can use Gemini 3 Pro, the latest frontier model from our partners...",
      "published_ts": 1763506800,
      "source_name": "Databricks Blog"
    }
  ]
}