{
  "ai_data_engineering": [
    {
      "url": "https://blog.cloudflare.com/waf-rules-react-vulnerability/",
      "title": "Cloudflare WAF proactively protects against React vulnerability",
      "summary": "Cloudflare offers protection against a new high profile vulnerability for React Server Components: CVE-2025-55182. All WAF customers are automatically protected as long as the WAF is deployed.",
      "published_ts": 1764720000,
      "source_name": "Cloudflare Engineering"
    },
    {
      "url": "https://huggingface.co/blog/nvidia/custom-policy-reasoning-nemotron-content-safety",
      "title": "Custom Policy Enforcement with Reasoning: Faster, Safer AI Applications",
      "summary": "Custom Policy Enforcement with Reasoning: Faster, Safer AI Applications\nMost safety models enforce a single, generalized policy that blocks obviously harmful content,  toxicity, and jailbreak attempts. That works for broad categories, but real-world applications demand more. Generic content safety m",
      "published_ts": 1764701428,
      "source_name": "Hugging Face Blog"
    },
    {
      "url": "https://blog.langchain.com/langsmith-agent-builder-now-in-public-beta/",
      "title": "LangSmith Agent Builder now in Public Beta",
      "summary": "Now anyone can create production ready agents without writing code, just chat.\nAgent Builder guides you from initial idea to deployed agent, creating detailed prompts, selecting required tools, and even creating subagents.",
      "published_ts": 1764693039,
      "source_name": "LangChain Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-s3-vectors-now-generally-available-with-increased-scale-and-performance/",
      "title": "Amazon S3 Vectors now generally available with increased scale and performance",
      "summary": "Scale vector storage and querying to new heights with S3 Vectors' general availability—now supporting up to 1 billion vectors per index, 100ms query latencies, and expanded regional availability, while reducing costs up to 90% compared to specialized databases.",
      "published_ts": 1764691571,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-bedrock-adds-fully-managed-open-weight-models/",
      "title": "Amazon Bedrock adds 18 fully managed open weight models, including the new Mistral Large 3 and Ministral 3 models",
      "summary": "Access fully managed foundation models from leading providers like Google, Kimi AI, MiniMax AI, Mistral AI, NVIDIA, OpenAI, and Qwen, including the new Mistral Large 3 and Ministral 3 3B, 8B, and 14B models through Amazon Bedrock.",
      "published_ts": 1764691557,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/accelerate-ai-development-using-amazon-sagemaker-ai-with-serverless-mlflow/",
      "title": "Accelerate AI development using Amazon SageMaker AI with serverless MLflow",
      "summary": "Simplify AI experimentation with zero-infrastructure MLflow that launches in minutes, scales automatically, and seamlessly integrates with SageMaker's model customization and pipeline capabilities.",
      "published_ts": 1764691376,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-fsx-for-netapp-ontap-now-integrates-with-amazon-s3-for-seamless-data-access/",
      "title": "Amazon FSx for NetApp ONTAP now integrates with Amazon S3 for seamless data access",
      "summary": "Access FSx for NetApp ONTAP file data through S3 to enable AI/ML workloads and analytics—letting you use enterprise file data with Bedrock, SageMaker, and analytics services while it remains in your file system.",
      "published_ts": 1764691194,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://blog.octo.com/la-school-of-product-2025-talk-d'olivier-girardot-construire-un-compagnon-ia-pour-les-hopitaux",
      "title": "La School of Product 2025 - Talk d'Olivier Girardot - Construire un compagnon IA pour les hôpitaux",
      "summary": "Dans ce contexte où l’IA est poussé partout et tout le temps, la conférence d’Olivier Girardot  rappelle que l’IA en santé doit rester utile, responsable et digne de confiance. Elle doit libérer du temps aux médecins tout en garantissant la souveraineté des données, malgré une maturité produit encore fragile et un marché en pleine effervescence.",
      "published_ts": 1764672430,
      "source_name": "OCTO Talks!"
    },
    {
      "url": "https://huggingface.co/blog/transformers-v5",
      "title": "Transformers v5: Simple model definitions powering the AI ecosystem",
      "summary": "Transformers v5: Simple model definitions powering the AI ecosystem\nTransformers' version v4.0.0rc-1, the initial release candidate for version 4, was released on November 19th, 2020. Five years later, we now release v5.0.0rc-0.\nToday, as we launch v5, Transformers is installed more than\n3 million t",
      "published_ts": 1764547200,
      "source_name": "Hugging Face Blog"
    }
  ],
  "cloud_infra_observability": [
    {
      "url": "https://aws.amazon.com/blogs/aws/announcing-replication-support-and-intelligent-tiering-for-amazon-s3-tables/",
      "title": "Announcing replication support and Intelligent-Tiering for Amazon S3 Tables",
      "summary": "New features enable automatic cost optimization through intelligent storage tiering and simplified table replication across AWS Regions and accounts.",
      "published_ts": 1764692354,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/build-multi-step-applications-and-ai-workflows-with-aws-lambda-durable-functions/",
      "title": "Build multi-step applications and AI workflows with AWS Lambda durable functions",
      "summary": "New Lambda capability lets you build applications that coordinate multiple steps reliably over extended periods—from seconds to up to one year—without paying for idle compute time when waiting for external events or human decisions.",
      "published_ts": 1764691939,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-rds-for-oracle-and-rds-for-sql-server-add-new-capabilities-to-enhance-performance-and-optimize-costs/",
      "title": "New capabilities to optimize costs and improve scalability on Amazon RDS for SQL Server and Oracle",
      "summary": "Manage development, testing, and production database workloads more efficiently with new features including Developer Edition support for SQL Server, M7i/R7i instance support with optimize CPU, and expanded storage options up to 256 TiB.",
      "published_ts": 1764691769,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-database-savings-plans-for-aws-databases/",
      "title": "Introducing Database Savings Plans for AWS Databases",
      "summary": "New pricing model helps maintain cost efficiency while providing flexibility with database services and deployment options.",
      "published_ts": 1764691766,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/new-and-enhanced-aws-support-plans-add-ai-capabilities-to-expert-guidance/",
      "title": "New and enhanced AWS Support plans add AI capabilities to expert guidance",
      "summary": "Prevent cloud infrastructure issues before they impact your business with AWS Support plans that combine AI-powered insights with expert guidance, offering faster response times and proactive monitoring across performance, security, and cost dimensions.",
      "published_ts": 1764691623,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-devops-agent-helps-you-accelerate-incident-response-and-improve-system-reliability-preview/",
      "title": "AWS DevOps Agent helps you accelerate incident response and improve system reliability (preview)",
      "summary": "New service acts as an always-on DevOps engineer, helping you respond to incidents, identify root causes, and prevent future issues through systematic analysis of incidents and operational patterns.",
      "published_ts": 1764691542,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-amazon-nova-2-lite-a-fast-cost-effective-reasoning-model/",
      "title": "Introducing Amazon Nova 2 Lite, a fast, cost-effective reasoning model",
      "summary": "New fast, cost-effective model supports extended thinking with adjustable reasoning depth, letting you control the balance between speed, intelligence, and cost while building AI applications for everyday workloads.",
      "published_ts": 1764691180,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/new-aws-security-agent-secures-applications-proactively-from-design-to-deployment-preview/",
      "title": "New AWS Security Agent secures applications proactively from design to deployment (preview)",
      "summary": "Scale your AppSec expertise with AI-powered design reviews, code analysis, and contextual penetration testing that understand your unique security requirements and application architecture.",
      "published_ts": 1764691121,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-security-hub-now-generally-available-with-near-real-time-analytics-and-risk-prioritization/",
      "title": "AWS Security Hub now generally available with near real-time analytics and risk prioritization",
      "summary": "Today, AWS Security Hub is generally available, transforming how security teams identify and respond to critical security risks across their AWS environments. These new capabilities were first announced in preview at AWS re:Inforce 2025. Security Hub prioritizes your critical security issues and unifies your security operations to help you respond at scale by correlating and […]",
      "published_ts": 1764691091,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-guardduty-adds-extended-threat-detection-for-amazon-ec2-and-amazon-ecs/",
      "title": "Amazon GuardDuty adds Extended Threat Detection for Amazon EC2 and Amazon ECS",
      "summary": "Today, we’re announcing new enhancements to Amazon GuardDuty Extended Threat Detection with the addition of two attack sequence findings for Amazon Elastic Compute Cloud (Amazon EC2) instances and Amazon Elastic Container Service (Amazon ECS) tasks. These new findings build on the existing Extended Threat Detection capabilities, which already combine sequences involving AWS Identity and Access […]",
      "published_ts": 1764691074,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-amazon-nova-forge-build-your-own-frontier-models-using-nova/",
      "title": "Introducing Amazon Nova Forge: Build your own frontier models using Nova",
      "summary": "New program gives organizations unprecedented access to Nova model training, enabling them to build custom frontier models that deeply embed domain expertise without the traditional barriers of cost, compute, and time.",
      "published_ts": 1764690831,
      "source_name": "AWS Blog"
    }
  ],
  "data_modeling_governance": [
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-bedrock-agentcore-adds-quality-evaluations-and-policy-controls-for-deploying-trusted-ai-agents/",
      "title": "Amazon Bedrock AgentCore adds quality evaluations and policy controls for deploying trusted AI agents",
      "summary": "Deploy AI agents with confidence using new quality evaluations and policy controls—enabling precise boundaries on agent actions, continuous quality monitoring, and experience-based learning while maintaining natural conversation flows.",
      "published_ts": 1764692076,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-opensearch-service-improves-vector-database-performance-and-cost-with-gpu-acceleration-and-auto-optimization/",
      "title": "Amazon OpenSearch Service improves vector database performance and cost with GPU acceleration and auto-optimization",
      "summary": "Build and optimize large-scale vector databases up to 10 times faster and at a quarter of the cost with new GPU acceleration and auto-optimization capabilities that automatically balance search quality, speed, and resource usage.",
      "published_ts": 1764691601,
      "source_name": "AWS Blog"
    }
  ],
  "etl_orchestration": [],
  "hors_sujet": [],
  "lake_storage_formats": [
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-s3-storage-lens-adds-performance-metrics-support-for-billions-of-prefixes-and-export-to-s3-tables/",
      "title": "Amazon S3 Storage Lens adds performance metrics, support for billions of prefixes, and export to S3 Tables",
      "summary": "New capabilities help optimize application performance, analyze unlimited prefixes, and simplify metrics analysis through S3 Tables integration.",
      "published_ts": 1764692112,
      "source_name": "AWS Blog"
    }
  ],
  "news": [
    {
      "url": "https://blog.cloudflare.com/ddos-threat-report-2025-q3/",
      "title": "Cloudflare's 2025 Q3 DDoS threat report -- including Aisuru, the apex of botnets",
      "summary": "Welcome to the 23rd edition of Cloudflare’s Quarterly DDoS Threat Report. This report offers a comprehensive analysis of the evolving threat landscape of Distributed Denial of Service (DDoS) attacks based on data from the Cloudflare network. In this edition, we focus on the third quarter of 2025.",
      "published_ts": 1764770400,
      "source_name": "Cloudflare Engineering"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/amazon-cloudwatch-introduces-unified-data-management-and-analytics-for-operations-security-and-compliance/",
      "title": "Amazon CloudWatch introduces unified data management and analytics for operations, security, and compliance",
      "summary": "Reduce data management complexity and costs with automatic normalization across sources, native analytics integration, and built-in support for industry-standard formats like OCSF and Apache Iceberg.",
      "published_ts": 1764691631,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/introducing-amazon-ec2-x8aedz-instances-powered-by-5th-gen-amd-epyc-processors-for-memory-intensive-workloads/",
      "title": "Introducing Amazon EC2 X8aedz instances powered by 5th Gen AMD EPYC processors for memory-intensive workloads",
      "summary": "New memory-optimized instances deliver up to 5 GHz processor speeds and 3 TiB of memory—ideal for electronic design automation workloads and memory-intensive databases requiring high single-threaded performance.",
      "published_ts": 1764691544,
      "source_name": "AWS Blog"
    },
    {
      "url": "https://seattledataguy.substack.com/p/translating-data-buzzwords-into-real",
      "title": "Translating Data Buzzwords Into Real Requirements",
      "summary": "Bridging the Communication Gap Between Data and the Business",
      "published_ts": 1764688343,
      "source_name": "Seattle Data Guy"
    },
    {
      "url": "https://www.databricks.com/blog/databricks-and-nvidia-powering-next-generation-industry-ai",
      "title": "Databricks and NVIDIA: Powering the Next Generation of Industry AI",
      "summary": "Industry Use Case Transformation with AIAs we head to Las Vegas for Amazon Web Services (AWS) re:Invent...",
      "published_ts": 1764628200,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://www.databricks.com/blog/events-insights-complex-state-processing-schema-evolution-transformwithstate",
      "title": "From Events to Insights: Complex State Processing with Schema Evolution in transformWithState",
      "summary": "Across industries, one of the most persistent challenges in data engineering is schema...",
      "published_ts": 1764608444,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://huggingface.co/blog/hugging-science/sarlo-80-sar-optic-language-dataset",
      "title": "SARLO-80: Worldwide Slant SAR Language Optic Dataset at 80 cm Resolution",
      "summary": "SARLO-80: Worldwide Slant SAR Language Optic Dataset at 80 cm Resolution\nAuthors: Solène Debuysère\n1\n, Nicolas Trouvé\n1\n, Nathan Letheule\n1\n, Elise Colin\n1\n, Georgia Channing\n2\nAffiliations:\n1\nONERA – The French Aerospace Lab\n2\nHugging Face\nSatellite imagery has transformed the way we observe our pl",
      "published_ts": 1764583838,
      "source_name": "Hugging Face Blog"
    },
    {
      "url": "https://blog.cloudflare.com/why-replicate-joining-cloudflare/",
      "title": "Why Replicate is joining Cloudflare",
      "summary": "Today, we’re excited to announce that Replicate is officially part of Cloudflare. We wanted to share a bit about our journey and why we made this decision.",
      "published_ts": 1764568800,
      "source_name": "Cloudflare Engineering"
    },
    {
      "url": "https://airbyte.com/blog/introducing-agent-blueprint",
      "title": "Introducing Agent Blueprint | Airbyte",
      "summary": "Agent Blueprint helps teams connect real-time data to AI agents with production-ready infrastructure, faster integration, and reliable context management.",
      "published_ts": 1764547200,
      "source_name": "Airbyte Blog"
    }
  ],
  "news_general": [],
  "python_analytics": [],
  "warehouses_engines": [
    {
      "url": "https://www.dataiku.com/stories/blog/a-modern-approach-to-analytics-powered-by-dataiku-and-databricks",
      "title": "A Modern Approach to Analytics, Powered by Dataiku and Databricks",
      "summary": "Data and IT leaders are under increasing pressure to accelerate the delivery of AI results while  maintaining airtight governance . Data volumes are exploding, models are more complex, and business teams expect real-time, self-service capabilities. Traditional, siloed analytics systems built for batch processing and static reporting can no longer support the speed and scale of today’s enterprise.",
      "published_ts": 1764768023,
      "source_name": "Dataiku Blog"
    },
    {
      "url": "https://www.databricks.com/blog/completing-lakehouse-vision-open-storage-open-access-unified-governance",
      "title": "Completing the Lakehouse Vision: Open Storage, Open Access, Unified Governance",
      "summary": "Until now, organizations have had no way to unify attribute-based access control...",
      "published_ts": 1764683680,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://vutr.substack.com/p/my-framework-to-build-a-data-pipeline",
      "title": "A framework I use to build a data pipeline.",
      "summary": "You cannot simply say, \"I'll use Spark, Kafka, and so on\"; you need to ask clarifying questions to gather information for proposing a robust data pipeline.",
      "published_ts": 1764645335,
      "source_name": "VuTrinh · Data Engineering"
    },
    {
      "url": "https://www.databricks.com/blog/genesis-workbench-blueprint-life-sciences-applications-databricks",
      "title": "Genesis Workbench: A Blueprint for Life Sciences Applications on Databricks",
      "summary": "AI is Accelerating Target Discovery and Transforming Drug DesignThe life sciences...",
      "published_ts": 1764610476,
      "source_name": "Databricks Blog"
    },
    {
      "url": "https://www.databricks.com/blog/databricks-neurips-2025",
      "title": "Databricks at NeurIPS 2025",
      "summary": "Databricks is proud to be a platinum sponsor of NeurIPS 2025. The conference runs...",
      "published_ts": 1764601200,
      "source_name": "Databricks Blog"
    }
  ]
}